{"move_to_index":{"c7c6":0,"g8f6":1,"d7d5":2,"e7e6":3,"e8g8":4,"c8g4":5,"b8d7":6,"f8d6":7,"h7h6":8,"b8c6":9,"d5e4":10,"f6e4":11,"c6d5":12,"g7g6":13,"g4f3":14,"f8e7":15,"a7a6":16,"c6c5":17,"d8c7":18,"h7h5":19,"a8c8":20,"f8e8":21,"e6e5":22,"f7f6":23,"f7f5":24,"e8c8":25,"f8g7":26,"d8e7":27,"b7b5":28,"g7g5":29,"c8f5":30,"e7f6":31,"h5h4":32,"d7f6":33,"e6d5":34,"g7f6":35,"a7a5":36,"d6e5":37,"d7e5":38,"f6d5":39,"c5d4":40,"b7b6":41,"b7c6":42,"h6h5":43,"g4h5":44,"a8b8":45,"c8d7":46,"d8d7":47,"g8g7":48,"g8h8":49,"g6g5":50,"h7g6":51,"e7d6":52,"d7d6":53,"f8d8":54,"g8h7":55,"a5a4":56,"g5g4":57,"h5g6":58,"g8f8":59,"h8g8":60,"f6f5":61,"e5e4":62,"d5d4":63,"a8e8":64,"d7b6":65,"f5g6":66,"b5b4":67,"f5e4":68,"f7g6":69,"c6e5":70,"a8d8":71,"d8d6":72,"f6e5":73,"d5c4":74,"e7e5":75,"f6d7":76,"e8e7":77,"f6g4":78,"c8b8":79,"d6f4":80,"h5g4":81,"f5f4":82,"c8b7":83,"d6e7":84,"f7e6":85,"d8c8":86,"e6f5":87,"f8f7":88,"h4h3":89,"c8c7":90,"d8e8":91,"a6a5":92,"e8f7":93,"c5c4":94,"f6h5":95,"g7h6":96,"e7g5":97,"c8e6":98,"d8b8":99,"d8d5":100,"a4a3":101,"d7f8":102,"f8c8":103,"g6f5":104,"g8f7":105,"c7c5":106,"g6h5":107,"c6d4":108,"e8d8":109,"g5f4":110,"h6g5":111,"d6c7":112,"h8h7":113,"d4d3":114,"e5d4":115,"f8g8":116,"g8e7":117,"d7e7":118,"e4e3":119,"b4c3":120,"d8b6":121,"c7d7":122,"f5g4":123,"h4g3":124,"d8f6":125,"d8f8":126,"d6c5":127,"d6d5":128,"a3a2":129,"d6g3":130,"d6h2":131,"e4f3":132,"a6b5":133,"c8c2":134,"e8f8":135,"b6d5":136,"e7d7":137,"f8f6":138,"b4b3":139,"c7d6":140,"d8d4":141,"e7c5":142,"d7c7":143,"f8b4":144,"c7b6":145,"d7c5":146,"d8d1":147,"d8g8":148,"f6g5":149,"g4e2":150,"f4f3":151,"h3h2":152,"b6b5":153,"d7c6":154,"c8d8":155,"e8d7":156,"f7g8":157,"a5b4":158,"c4c3":159,"e5f4":160,"f6g6":161,"g5h4":162,"h7h8":163,"b8a8":164,"e7f8":165,"g4h3":166,"b6c5":167,"c3c2":168,"d8a5":169,"a8f8":170,"d4c3":171,"d7e6":172,"g6e4":173,"g7g8":174,"c7f4":175,"d3d2":176,"d8h8":177,"e7f5":178,"f7g7":179,"f8c5":180,"b8c8":181,"c6a5":182,"c8c1":183,"f4g3":184,"e4d3":185,"f6e8":186,"f6f7":187,"g7f7":188,"b3b2":189,"c6b5":190,"d8g5":191,"f6e7":192,"f6g7":193,"g3g2":194,"g4g3":195,"b5c4":196,"b6c4":197,"b6c7":198,"b8b2":199,"e5f3":200,"e7h4":201,"f5d3":202,"g7f8":203,"h8h2":204,"c7e5":205,"d5c3":206,"d5e3":207,"e7f7":208,"h3g2":209,"h7g8":210,"c7e7":211,"d8h4":212,"e3e2":213,"e7d8":214,"e7g6":215,"e8e6":216,"h2d6":217,"h8f8":218,"b7c8":219,"c8c3":220,"d4e5":221,"d5f4":222,"d6b4":223,"f7e7":224,"f8b8":225,"f8g6":226,"g4f5":227,"h8d8":228,"b2a2":229,"b8b7":230,"c7b7":231,"f4e3":232,"f6e6":233,"f6h7":234,"g5f5":235,"g6d3":236,"h7g7":237,"h8g7":238,"h8h3":239,"a2a1q":240,"a7b6":241,"b8c7":242,"d4e3":243,"d6d7":244,"d7e8":245,"e5f6":246,"e8e1":247,"e8e5":248,"f3f2":249,"g7h7":250,"b8d8":251,"c5d6":252,"c6b4":253,"c7a5":254,"c7d8":255,"c7g3":256,"d5e5":257,"d8d3":258,"e4f6":259,"e4g3":260,"e7b4":261,"g2h2":262,"h6g7":263,"h6h7":264,"a2a1":265,"c2a2":266,"c5b6":267,"d7b8":268,"d7c8":269,"e6f6":270,"e7e8":271,"f5g5":272,"f7e8":273,"g6f6":274,"h2h1":275,"h8h1":276,"b4a3":277,"d5f6":278,"d7d8":279,"e5d3":280,"f5e6":281,"f7f8":282,"g5f6":283,"g5g6":284,"h4g5":285,"h8e8":286,"a1a2":287,"a5c4":288,"b8a6":289,"d6e6":290,"e3f4":291,"e6d7":292,"e8e4":293,"h2h1q":294,"h2h3":295,"h5e2":296,"h5f4":297,"h5f6":298,"a8a7":299,"a8g8":300,"b6d7":301,"c8c6":302,"d8d2":303,"e4f5":304,"e5f5":305,"e6f7":306,"e7c7":307,"f2g2":308,"f5f6":309,"f8h8":310,"g4e3":311,"g6f7":312,"h3h4":313,"a2a3":314,"a8a1":315,"b6a5":316,"c5b4":317,"c6e7":318,"c8h3":319,"d2d1q":320,"d5d8":321,"e8e2":322,"f6d4":323,"g3f2":324,"g4d1":325,"g4f6":326,"g6h7":327,"g7e5":328,"b2b1q":329,"b5a4":330,"b7a6":331,"c2c3":332,"c8c4":333,"d2a2":334,"e4d2":335,"e5c4":336,"e5d5":337,"e5e6":338,"e6e7":339,"e8c7":340,"f4e4":341,"f4f2":342,"f4g5":343,"f8e6":344,"f8f4":345,"g2f2":346,"g8g3":347,"g8g6":348,"a5b6":349,"b2b1":350,"b6e3":351,"b7c7":352,"c1c2":353,"c2b2":354,"c3d4":355,"c7c8":356,"c8f8":357,"d4f4":358,"d5c5":359,"e4d6":360,"f4e5":361,"f5h3":362,"f8f5":363,"g3f4":364,"g6f4":365,"g6g7":366,"g7h8":367,"g8g2":368,"h5f3":369,"h5g5":370,"h8h4":371,"a2b2":372,"a8a2":373,"a8h8":374,"b2b3":375,"c4d3":376,"c8a8":377,"c8c5":378,"d3e4":379,"d5b6":380,"e4c3":381,"e4e5":382,"e4f4":383,"e5g3":384,"e5g6":385,"f5f3":386,"f6f4":387,"f6h4":388,"g5h5":389,"g6h6":390,"h1g2":391,"h6g6":392,"h7g5":393,"h8h5":394,"a3a4":395,"a4b3":396,"b1b2":397,"b4b5":398,"b4d6":399,"b6b2":400,"b8b4":401,"b8e8":402,"c4b3":403,"c7f7":404,"c7h2":405,"d1d2":406,"d4f5":407,"e3d3":408,"e3f2":409,"e4f2":410,"e4g2":411,"e6c4":412,"e6d6":413,"e7e4":414,"f3g2":415,"f4d2":416,"f8a8":417,"f8d7":418,"f8f1":419,"f8f2":420,"f8f3":421,"g3f3":422,"g3h3":423,"g5h6":424,"g6e5":425,"h4g4":426,"h4h5":427,"h8h6":428,"a2f2":429,"a3b4":430,"a6c7":431,"b2c3":432,"b4c5":433,"b4d2":434,"b8b1":435,"b8f8":436,"c4e3":437,"c5d3":438,"c5d5":439,"c5e3":440,"c6d8":441,"d2b2":442,"d7b5":443,"d7d4":444,"e4d4":445,"e4g5":446,"e5d6":447,"e6g6":448,"e7d5":449,"f4f5":450,"f4g4":451,"f6c3":452,"g2g1q":453,"g4e6":454,"h1g1":455,"h1h2":456,"h2g2":457,"h8c8":458,"a2c2":459,"a4a2":460,"a4b4":461,"a5a2":462,"a5b3":463,"a7b7":464,"b1a2":465,"b3a3":466,"b3b4":467,"b4d3":468,"b6d4":469,"b6f2":470,"c5b5":471,"c5e7":472,"c6c7":473,"c6d7":474,"c7b8":475,"c7c3":476,"c7e6":477,"c8e8":478,"d2e2":479,"d3c2":480,"d3c3":481,"d3d4":482,"d5b4":483,"d5d6":484,"d5e6":485,"d6d2":486,"d6e4":487,"d6f6":488,"d7f5":489,"d7f7":490,"d7g4":491,"d8a8":492,"e2e1q":493,"e4c5":494,"e4g6":495,"e5g4":496,"e8a8":497,"f1f2":498,"f2f1":499,"f2f3":500,"f2h2":501,"f3e3":502,"f3g3":503,"f4d6":504,"f4h4":505,"f5d4":506,"f6d8":507,"f6f2":508,"f8h6":509,"g1f2":510,"g5e7":511,"g5g3":512,"g7d4":513,"g8h6":514,"h2g3":515,"h3g4":516,"h5g3":517,"a1c1":518,"a2b3":519,"a5c3":520,"a5c7":521,"a7a8":522,"a8a3":523,"b2a3":524,"b2d2":525,"b4e7":526,"b7a8":527,"b7b2":528,"b7e4":529,"b8a7":530,"b8b3":531,"c2d3":532,"c5e4":533,"c7c4":534,"d2d1":535,"d2f2":536,"d4b2":537,"d4e4":538,"d4f6":539,"d5c6":540,"d6c4":541,"d6f5":542,"d6f8":543,"d7d2":544,"e2e3":545,"e3e4":546,"e5b2":547,"e5d7":548,"e5e2":549,"e6e4":550,"e6g5":551,"e6h3":552,"e7a3":553,"e7b7":554,"e8d6":555,"f2b2":556,"f2d2":557,"f4d4":558,"f5d7":559,"f6b2":560,"g1h1":561,"g2g1":562,"g3d6":563,"g3h4":564,"g4g2":565,"g5e3":566,"g5g2":567,"g6e6":568,"g6h4":569,"g8e8":570,"h3g3":571,"h3h5":572,"h4f2":573,"h4h2":574,"h7f6":575,"a1f6":576,"a3b3":577,"a8b7":578,"b2c2":579,"b2g2":580,"b3a2":581,"b7a7":582,"b7b8":583,"b8f4":584,"c2c1q":585,"c3b4":586,"c3c1":587,"c3d3":588,"c4b2":589,"c4b6":590,"c4c2":591,"c4d2":592,"c5e5":593,"c7b5":594,"c7c2":595,"c8a6":596,"d1b1":597,"d2c2":598,"d3c4":599,"d4c5":600,"d4f3":601,"d5c7":602,"d5d2":603,"d5f3":604,"d6g6":605,"d7h3":606,"e3f1":607,"e4c2":608,"e5e1":609,"e7e1":610,"e7e2":611,"e8g6":612,"f2e3":613,"f2f1q":614,"f3d1":615,"f5d6":616,"f5e5":617,"f5h4":618,"f6f3":619,"f6g8":620,"f6h6":621,"g1f1":622,"g2g3":623,"g2h3":624,"g4h4":625,"g6g4":626,"g7c3":627,"g7g3":628,"g8g4":629,"h4f4":630,"h4h1":631,"h5f5":632,"h5h6":633,"h6f5":634,"a2a4":635,"a2b1":636,"a2d5":637,"a2e2":638,"a3e3":639,"a4a5":640,"a5a6":641,"a6b6":642,"b1c1":643,"b1g1":644,"b2b5":645,"b2d4":646,"b2f6":647,"b3c3":648,"b3c4":649,"b4b1":650,"b4c4":651,"b4c6":652,"b5c5":653,"b6a7":654,"b6c6":655,"c2d2":656,"c2e2":657,"c2f2":658,"c2g2":659,"c3b3":660,"c3c4":661,"c4c5":662,"c4d5":663,"c5c3":664,"c5d7":665,"c6c1":666,"c6d6":667,"c7c1":668,"c7g7":669,"d2d3":670,"d2e1":671,"d3d1":672,"d4b6":673,"d4c6":674,"d4e2":675,"d6a3":676,"d6c6":677,"d7a7":678,"d7d1":679,"e1f2":680,"e2g2":681,"e3f5":682,"e4d5":683,"e5c7":684,"e5h5":685,"e6g4":686,"e7g7":687,"e8b8":688,"e8f6":689,"e8h5":690,"e8h8":691,"f2e1":692,"f3d3":693,"f3e2":694,"f4d3":695,"f4d5":696,"f4f6":697,"f5b1":698,"f5e3":699,"f5h7":700,"f8h7":701,"g1g2":702,"g2d2":703,"g2f3":704,"g3h2":705,"g4c8":706,"g4f2":707,"g4f4":708,"g6c2":709,"h1e1":710,"h2b2":711,"h2f4":712,"h2g1":713,"h3h1":714,"h5h3":715,"h6e3":716,"h7h4":717,"a1a4":718,"a1b1":719,"a1b2":720,"a1d1":721,"a1e1":722,"a2a5":723,"a2g2":724,"a3a5":725,"a3b2":726,"a5b5":727,"a5d8":728,"a5e1":729,"a6b7":730,"b1b3":731,"b1c2":732,"b1f5":733,"b1h1":734,"b3b1":735,"b4a5":736,"b4c2":737,"b5a5":738,"b5b2":739,"b6a6":740,"b8d6":741,"c1d1":742,"c1h1":743,"c3b2":744,"c3e4":745,"c3e5":746,"c4c6":747,"c4d4":748,"c5b3":749,"c5c1":750,"c5c2":751,"c6b8":752,"c7d5":753,"c7e8":754,"d1a1":755,"d1e1":756,"d2e4":757,"d3b3":758,"d4c2":759,"d4d1":760,"d4d2":761,"d4f2":762,"d5d1":763,"d5d7":764,"d5e7":765,"d5h5":766,"d6b8":767,"d6d8":768,"d7a4":769,"d7d3":770,"d8c6":771,"e1f1":772,"e2b2":773,"e2c2":774,"e3e1":775,"e4e7":776,"e5e3":777,"e5g7":778,"e6c7":779,"e6f4":780,"e7c6":781,"e7h7":782,"e8g7":783,"f2d4":784,"f2e2":785,"f2g1":786,"f3d2":787,"f3e5":788,"f4c7":789,"f4e6":790,"f4g2":791,"f5e7":792,"f5f2":793,"f5g3":794,"f6f1":795,"f7f3":796,"g2h1":797,"g3d3":798,"g3e1":799,"g3e2":800,"g5c1":801,"g5d2":802,"g5g1":803,"g5g7":804,"g5h3":805,"g6e7":806,"g6g2":807,"g6g3":808,"g7b2":809,"g8a8":810,"g8d8":811,"g8g5":812,"h1f3":813,"h1h3":814,"h2d2":815,"h2e2":816,"h3f3":817,"h3f5":818,"h4f6":819,"h4h6":820,"h5h1":821,"h6f4":822,"a1d4":823,"a1f1":824,"a2c4":825,"a3a1":826,"a3a6":827,"a3b5":828,"a3d6":829,"a4e4":830,"a5c5":831,"a5d2":832,"a5d5":833,"a5e5":834,"a6c5":835,"a7a2":836,"a8a4":837,"a8b6":838,"b1a1":839,"b1f1":840,"b2b4":841,"b2c1":842,"b2c4":843,"b3b7":844,"b3e3":845,"b3f3":846,"b4a4":847,"b5b6":848,"b5c6":849,"b5f1":850,"b6a8":851,"b6b3":852,"b6b7":853,"b6c8":854,"b6d6":855,"b7b1":856,"b7f3":857,"b8b5":858,"b8g3":859,"c1a1":860,"c1b1":861,"c1d2":862,"c1e3":863,"c2c1":864,"c2f5":865,"c3c7":866,"c3d2":867,"c3g3":868,"c4a5":869,"c4b5":870,"c4c1":871,"c4c7":872,"c4e2":873,"c5a3":874,"c5a5":875,"c5c6":876,"c5e6":877,"c5f8":878,"c6a4":879,"c6b6":880,"d1c2":881,"d1d3":882,"d2d4":883,"d2d7":884,"d2f4":885,"d3d7":886,"d3e2":887,"d3f2":888,"d3g6":889,"d4c4":890,"d4g4":891,"d6d4":892,"d7h7":893,"e1e2":894,"e1g1":895,"e1h1":896,"e2a2":897,"e2d2":898,"e2d3":899,"e3c1":900,"e3c3":901,"e3d4":902,"e3f3":903,"e3g3":904,"e3h3":905,"e3h6":906,"e5c3":907,"e5g5":908,"e6a2":909,"e6d4":910,"e8e3":911,"f1e1":912,"f1e2":913,"f2c2":914,"f2f4":915,"f2f5":916,"f3f1":917,"f3f4":918,"f3f5":919,"f4g6":920,"f5d5":921,"f5f1":922,"f7c7":923,"f7f2":924,"f7h5":925,"f8a3":926,"g2e2":927,"g2g7":928,"g3g1":929,"g3g4":930,"g4d4":931,"g4d7":932,"g4e5":933,"g4g5":934,"g4g6":935,"g4h2":936,"g5d8":937,"g5e4":938,"g5e6":939,"g5f3":940,"g6f8":941,"g7a1":942,"g7g2":943,"g7g4":944,"g8g1":945,"h1b1":946,"h1f1":947,"h2c7":948,"h2e5":949,"h2h4":950,"h2h5":951,"h3f1":952,"h3h6":953,"h4d4":954,"h4g6":955,"h5c5":956,"h5g7":957,"h5h2":958,"h7h2":959,"h8g6":960,"a1c3":961,"a1e5":962,"a1g1":963,"a2a6":964,"a2a7":965,"a2d2":966,"a2h2":967,"a3c3":968,"a3d3":969,"a3e7":970,"a4a1":971,"a4b5":972,"a4f4":973,"a5a1":974,"a5a3":975,"a5h5":976,"a6a7":977,"a6b8":978,"a6c4":979,"a6c8":980,"a7a1":981,"a7a3":982,"a7a4":983,"a7b8":984,"a8a5":985,"b1d1":986,"b2d3":987,"b2e2":988,"b2e5":989,"b2f2":990,"b2h2":991,"b3a4":992,"b3d4":993,"b3d5":994,"b4h4":995,"b5a3":996,"b5a6":997,"b5b8":998,"b5c3":999,"b5d4":1000,"b6e6":1001,"b7d6":1002,"b8e5":1003,"b8g8":1004,"b8h8":1005,"c1f1":1006,"c2d4":1007,"c2g6":1008,"c2h2":1009,"c3a1":1010,"c3e1":1011,"c3e3":1012,"c3f6":1013,"c4b4":1014,"c4d6":1015,"c5a6":1016,"c5a7":1017,"c5b7":1018,"c5c8":1019,"c6a6":1020,"c6e8":1021,"c6g2":1022,"c7a7":1023,"c8e7":1024,"c8g8":1025,"c8h8":1026,"d1g4":1027,"d1h1":1028,"d2b4":1029,"d2f3":1030,"d2g2":1031,"d2h2":1032,"d3a3":1033,"d3b2":1034,"d3b5":1035,"d3c1":1036,"d3e1":1037,"d3e3":1038,"d3f1":1039,"d3f4":1040,"d3f5":1041,"d4a1":1042,"d4d5":1043,"d4d7":1044,"d4d8":1045,"d5g5":1046,"d5h1":1047,"d6b6":1048,"d6e8":1049,"d8e6":1050,"e1a5":1051,"e1c1":1052,"e1d1":1053,"e1d2":1054,"e1e5":1055,"e1e8":1056,"e2e1":1057,"e2f1":1058,"e2g3":1059,"e3b6":1060,"e3c5":1061,"e3g5":1062,"e4a4":1063,"e4e2":1064,"e4g4":1065,"e5a1":1066,"e5c6":1067,"e5e7":1068,"e5h2":1069,"e6b3":1070,"e6b6":1071,"e6e1":1072,"e6g7":1073,"e7c8":1074,"f1a6":1075,"f1c4":1076,"f2a2":1077,"f2b6":1078,"f2d3":1079,"f2g3":1080,"f2g4":1081,"f3g4":1082,"f4a4":1083,"f4e2":1084,"f4h3":1085,"f5c2":1086,"f5f7":1087,"f5h5":1088,"f6a1":1089,"f6b6":1090,"f6c6":1091,"f7b7":1092,"f7d7":1093,"f7f4":1094,"f7h7":1095,"g1a1":1096,"g1e3":1097,"g2a2":1098,"g2b2":1099,"g3e3":1100,"g3f1":1101,"g3h5":1102,"g4h6":1103,"g6g8":1104,"g7e8":1105,"h1a1":1106,"h1d1":1107,"h2f2":1108,"h3e3":1109,"h3f2":1110,"h3f4":1111,"h4d8":1112,"h4e1":1113,"h4e7":1114,"h6e6":1115,"h6f6":1116,"h6f8":1117,"h6g4":1118,"h6h2":1119,"h6h3":1120,"h7b1":1121,"h7d3":1122,"h7h1":1123,"a1a3":1124,"a1a5":1125,"a1a7":1126,"a3f3":1127,"a4a6":1128,"a4a7":1129,"a4c2":1130,"a4c6":1131,"a4g4":1132,"a5c6":1133,"a6a2":1134,"a6a3":1135,"a6a8":1136,"a6c6":1137,"a7b5":1138,"a7c7":1139,"a7d7":1140,"b1b5":1141,"b1e1":1142,"b1e4":1143,"b2a1":1144,"b2b7":1145,"b2b8":1146,"b2g7":1147,"b3a5":1148,"b3c5":1149,"b4b2":1150,"b4d5":1151,"b4e1":1152,"b5b3":1153,"b5d5":1154,"b5d6":1155,"b6d8":1156,"b7b4":1157,"b7d5":1158,"b7e7":1159,"b7g2":1160,"b8b6":1161,"b8h2":1162,"c1b2":1163,"c1c4":1164,"c1g5":1165,"c2a1":1166,"c2a3":1167,"c2b3":1168,"c2c4":1169,"c2c5":1170,"c2c6":1171,"c3a3":1172,"c3a5":1173,"c3b5":1174,"c3c5":1175,"c3c6":1176,"c3e2":1177,"c3g7":1178,"c4a3":1179,"c4a4":1180,"c4e4":1181,"c4e5":1182,"c5c7":1183,"c5f2":1184,"c5h5":1185,"c6a7":1186,"c6e4":1187,"c6f3":1188,"c6f6":1189,"c7a6":1190,"c8d6":1191,"d1d7":1192,"d1e2":1193,"d1f3":1194,"d2c1":1195,"d2d5":1196,"d2d6":1197,"d2f1":1198,"d3d5":1199,"d3h7":1200,"d4b4":1201,"d4d6":1202,"d4e6":1203,"d5a2":1204,"d5a5":1205,"d5b3":1206,"d5b5":1207,"d5f5":1208,"d6a6":1209,"d6b5":1210,"d6d1":1211,"d6f7":1212,"d7b7":1213,"d8f7":1214,"e1a1":1215,"e1b1":1216,"e1e3":1217,"e1e4":1218,"e1e6":1219,"e1g3":1220,"e2b5":1221,"e2e4":1222,"e2f4":1223,"e2g4":1224,"e3c2":1225,"e3d2":1226,"e3e5":1227,"e4b1":1228,"e4c4":1229,"e4e6":1230,"e4h4":1231,"e4h7":1232,"e5b5":1233,"e5c5":1234,"e6c5":1235,"e6c8":1236,"e6e8":1237,"e7a7":1238,"e7e3":1239,"e8c6":1240,"f1a1":1241,"f1b1":1242,"f1d2":1243,"f1f3":1244,"f1f5":1245,"f1g1":1246,"f2d1":1247,"f2h3":1248,"f3e4":1249,"f3h3":1250,"f4c4":1251,"f4f1":1252,"f4h2":1253,"f4h5":1254,"f4h6":1255,"f6d6":1256,"f6f8":1257,"f6h8":1258,"f7c4":1259,"f7f1":1260,"g1b1":1261,"g1c5":1262,"g1d4":1263,"g1g3":1264,"g1g4":1265,"g1h2":1266,"g1h3":1267,"g2c2":1268,"g2d5":1269,"g2e4":1270,"g2f1":1271,"g2g4":1272,"g2g5":1273,"g3c7":1274,"g3e4":1275,"g3e5":1276,"g3g5":1277,"g4e4":1278,"g4g7":1279,"g5a5":1280,"g6h8":1281,"g7b7":1282,"g7d7":1283,"g7e7":1284,"g8b8":1285,"g8c8":1286,"h1c1":1287,"h1c6":1288,"h1e4":1289,"h2a2":1290,"h2g4":1291,"h3e6":1292,"h4c4":1293,"h4f3":1294,"h4g2":1295,"h5d1":1296,"h5d5":1297,"h5e5":1298,"h5f7":1299,"h5h7":1300,"h6b6":1301,"h6h1":1302,"h7e4":1303,"h7f7":1304,"h8b8":1305,"a1h1":1306,"a1h8":1307,"a2a8":1308,"a2b4":1309,"a2e6":1310,"a3c1":1311,"a3c2":1312,"a3c4":1313,"a3c5":1314,"a3g3":1315,"a4a8":1316,"a4c3":1317,"a4c4":1318,"a4d1":1319,"a4d4":1320,"a5b7":1321,"a5g5":1322,"a6a1":1323,"a6a4":1324,"a6b4":1325,"a6d3":1326,"a6d6":1327,"a6e2":1328,"a6f6":1329,"a7c5":1330,"a7c6":1331,"a7d4":1332,"a7e3":1333,"a7e7":1334,"a7f2":1335,"a7h7":1336,"a8a6":1337,"a8c6":1338,"a8c7":1339,"a8d5":1340,"a8f3":1341,"a8h1":1342,"b1b4":1343,"b1b7":1344,"b1d3":1345,"b2c1q":1346,"b2d1":1347,"b2h8":1348,"b3c1":1349,"b3c2":1350,"b3d3":1351,"b4a2":1352,"b4a6":1353,"b4b7":1354,"b4b8":1355,"b4d4":1356,"b4e4":1357,"b4f4":1358,"b4g4":1359,"b5b1":1360,"b5d3":1361,"b5d7":1362,"b5e2":1363,"b5e5":1364,"b6a4":1365,"b6b4":1366,"b6f6":1367,"b6h6":1368,"b7f7":1369,"b7g7":1370,"b7h1":1371,"c1a3":1372,"c1c3":1373,"c1e1":1374,"c1e2":1375,"c1f4":1376,"c1g1":1377,"c1h6":1378,"c2b1":1379,"c2c7":1380,"c2c8":1381,"c2d1":1382,"c2e4":1383,"c3c8":1384,"c3d1":1385,"c3f3":1386,"c4a6":1387,"c4c8":1388,"c4e6":1389,"c4f1":1390,"c4f4":1391,"c4f7":1392,"c5f5":1393,"c5g1":1394,"c5g5":1395,"c6b7":1396,"c6c2":1397,"c6c3":1398,"c6c4":1399,"c6c8":1400,"c6e6":1401,"c6g6":1402,"c7h7":1403,"c8a7":1404,"c8b6":1405,"d1b3":1406,"d1d6":1407,"d1d8":1408,"d1f1":1409,"d1g1":1410,"d2a5":1411,"d2b3":1412,"d2c4":1413,"d2d8":1414,"d2e1q":1415,"d2h6":1416,"d3a6":1417,"d3b1":1418,"d3c5":1419,"d3d8":1420,"d3e5":1421,"d3f3":1422,"d3g3":1423,"d3h3":1424,"d4a4":1425,"d4a7":1426,"d4b3":1427,"d4b5":1428,"d4g1":1429,"d4g7":1430,"d4h4":1431,"d5d3":1432,"d5f7":1433,"d5g2":1434,"d5g8":1435,"d6b7":1436,"d6c8":1437,"d6d3":1438,"d7g7":1439,"d8b7":1440,"e1c2":1441,"e1e7":1442,"e1f3":1443,"e1h4":1444,"e2c1":1445,"e2d1":1446,"e2e5":1447,"e2f1q":1448,"e2f2":1449,"e2f3":1450,"e2h2":1451,"e3b3":1452,"e3c4":1453,"e3d1":1454,"e3e7":1455,"e3e8":1456,"e4a8":1457,"e4c6":1458,"e4e8":1459,"e4h1":1460,"e5a5":1461,"e5b8":1462,"e5e8":1463,"e6e2":1464,"e6e3":1465,"e6f8":1466,"e6h6":1467,"e7g8":1468,"e8a4":1469,"f1b5":1470,"f1c1":1471,"f1f4":1472,"f1f7":1473,"f1f8":1474,"f1g2":1475,"f1g3":1476,"f1h1":1477,"f2c5":1478,"f2e4":1479,"f2f6":1480,"f2f7":1481,"f2f8":1482,"f3a3":1483,"f3b3":1484,"f3c6":1485,"f3d4":1486,"f3d5":1487,"f3e1":1488,"f3f7":1489,"f3g1":1490,"f3g5":1491,"f3h1":1492,"f3h2":1493,"f3h4":1494,"f3h5":1495,"f4b4":1496,"f4b8":1497,"f4c1":1498,"f5a5":1499,"f5g7":1500,"f5h6":1501,"f6a6":1502,"f7a2":1503,"f7b3":1504,"f7d5":1505,"f7d6":1506,"f7d8":1507,"f7e5":1508,"f7g5":1509,"g1c1":1510,"g2c6":1511,"g2e1":1512,"g2g8":1513,"g3c3":1514,"g3g6":1515,"g3g7":1516,"g4a4":1517,"g4c4":1518,"g4g1":1519,"g5e5":1520,"g5f7":1521,"g5g8":1522,"g5h7":1523,"g6c6":1524,"g6d6":1525,"g6g1":1526,"g7a7":1527,"g7e6":1528,"g7f5":1529,"g7h5":1530,"g8b3":1531,"g8e6":1532,"h1b7":1533,"h1d5":1534,"h1h5":1535,"h1h6":1536,"h2c2":1537,"h2f1":1538,"h2h8":1539,"h3c3":1540,"h3d7":1541,"h3g1":1542,"h3h8":1543,"h4e4":1544,"h4f5":1545,"h4h7":1546,"h4h8":1547,"h5e8":1548,"h6d2":1549,"h6h4":1550,"h7c7":1551,"h7d7":1552,"h7f8":1553,"h8a1":1554,"h8d4":1555,"h8f6":1556},"index_to_move":{"0":"c7c6","1":"g8f6","2":"d7d5","3":"e7e6","4":"e8g8","5":"c8g4","6":"b8d7","7":"f8d6","8":"h7h6","9":"b8c6","10":"d5e4","11":"f6e4","12":"c6d5","13":"g7g6","14":"g4f3","15":"f8e7","16":"a7a6","17":"c6c5","18":"d8c7","19":"h7h5","20":"a8c8","21":"f8e8","22":"e6e5","23":"f7f6","24":"f7f5","25":"e8c8","26":"f8g7","27":"d8e7","28":"b7b5","29":"g7g5","30":"c8f5","31":"e7f6","32":"h5h4","33":"d7f6","34":"e6d5","35":"g7f6","36":"a7a5","37":"d6e5","38":"d7e5","39":"f6d5","40":"c5d4","41":"b7b6","42":"b7c6","43":"h6h5","44":"g4h5","45":"a8b8","46":"c8d7","47":"d8d7","48":"g8g7","49":"g8h8","50":"g6g5","51":"h7g6","52":"e7d6","53":"d7d6","54":"f8d8","55":"g8h7","56":"a5a4","57":"g5g4","58":"h5g6","59":"g8f8","60":"h8g8","61":"f6f5","62":"e5e4","63":"d5d4","64":"a8e8","65":"d7b6","66":"f5g6","67":"b5b4","68":"f5e4","69":"f7g6","70":"c6e5","71":"a8d8","72":"d8d6","73":"f6e5","74":"d5c4","75":"e7e5","76":"f6d7","77":"e8e7","78":"f6g4","79":"c8b8","80":"d6f4","81":"h5g4","82":"f5f4","83":"c8b7","84":"d6e7","85":"f7e6","86":"d8c8","87":"e6f5","88":"f8f7","89":"h4h3","90":"c8c7","91":"d8e8","92":"a6a5","93":"e8f7","94":"c5c4","95":"f6h5","96":"g7h6","97":"e7g5","98":"c8e6","99":"d8b8","100":"d8d5","101":"a4a3","102":"d7f8","103":"f8c8","104":"g6f5","105":"g8f7","106":"c7c5","107":"g6h5","108":"c6d4","109":"e8d8","110":"g5f4","111":"h6g5","112":"d6c7","113":"h8h7","114":"d4d3","115":"e5d4","116":"f8g8","117":"g8e7","118":"d7e7","119":"e4e3","120":"b4c3","121":"d8b6","122":"c7d7","123":"f5g4","124":"h4g3","125":"d8f6","126":"d8f8","127":"d6c5","128":"d6d5","129":"a3a2","130":"d6g3","131":"d6h2","132":"e4f3","133":"a6b5","134":"c8c2","135":"e8f8","136":"b6d5","137":"e7d7","138":"f8f6","139":"b4b3","140":"c7d6","141":"d8d4","142":"e7c5","143":"d7c7","144":"f8b4","145":"c7b6","146":"d7c5","147":"d8d1","148":"d8g8","149":"f6g5","150":"g4e2","151":"f4f3","152":"h3h2","153":"b6b5","154":"d7c6","155":"c8d8","156":"e8d7","157":"f7g8","158":"a5b4","159":"c4c3","160":"e5f4","161":"f6g6","162":"g5h4","163":"h7h8","164":"b8a8","165":"e7f8","166":"g4h3","167":"b6c5","168":"c3c2","169":"d8a5","170":"a8f8","171":"d4c3","172":"d7e6","173":"g6e4","174":"g7g8","175":"c7f4","176":"d3d2","177":"d8h8","178":"e7f5","179":"f7g7","180":"f8c5","181":"b8c8","182":"c6a5","183":"c8c1","184":"f4g3","185":"e4d3","186":"f6e8","187":"f6f7","188":"g7f7","189":"b3b2","190":"c6b5","191":"d8g5","192":"f6e7","193":"f6g7","194":"g3g2","195":"g4g3","196":"b5c4","197":"b6c4","198":"b6c7","199":"b8b2","200":"e5f3","201":"e7h4","202":"f5d3","203":"g7f8","204":"h8h2","205":"c7e5","206":"d5c3","207":"d5e3","208":"e7f7","209":"h3g2","210":"h7g8","211":"c7e7","212":"d8h4","213":"e3e2","214":"e7d8","215":"e7g6","216":"e8e6","217":"h2d6","218":"h8f8","219":"b7c8","220":"c8c3","221":"d4e5","222":"d5f4","223":"d6b4","224":"f7e7","225":"f8b8","226":"f8g6","227":"g4f5","228":"h8d8","229":"b2a2","230":"b8b7","231":"c7b7","232":"f4e3","233":"f6e6","234":"f6h7","235":"g5f5","236":"g6d3","237":"h7g7","238":"h8g7","239":"h8h3","240":"a2a1q","241":"a7b6","242":"b8c7","243":"d4e3","244":"d6d7","245":"d7e8","246":"e5f6","247":"e8e1","248":"e8e5","249":"f3f2","250":"g7h7","251":"b8d8","252":"c5d6","253":"c6b4","254":"c7a5","255":"c7d8","256":"c7g3","257":"d5e5","258":"d8d3","259":"e4f6","260":"e4g3","261":"e7b4","262":"g2h2","263":"h6g7","264":"h6h7","265":"a2a1","266":"c2a2","267":"c5b6","268":"d7b8","269":"d7c8","270":"e6f6","271":"e7e8","272":"f5g5","273":"f7e8","274":"g6f6","275":"h2h1","276":"h8h1","277":"b4a3","278":"d5f6","279":"d7d8","280":"e5d3","281":"f5e6","282":"f7f8","283":"g5f6","284":"g5g6","285":"h4g5","286":"h8e8","287":"a1a2","288":"a5c4","289":"b8a6","290":"d6e6","291":"e3f4","292":"e6d7","293":"e8e4","294":"h2h1q","295":"h2h3","296":"h5e2","297":"h5f4","298":"h5f6","299":"a8a7","300":"a8g8","301":"b6d7","302":"c8c6","303":"d8d2","304":"e4f5","305":"e5f5","306":"e6f7","307":"e7c7","308":"f2g2","309":"f5f6","310":"f8h8","311":"g4e3","312":"g6f7","313":"h3h4","314":"a2a3","315":"a8a1","316":"b6a5","317":"c5b4","318":"c6e7","319":"c8h3","320":"d2d1q","321":"d5d8","322":"e8e2","323":"f6d4","324":"g3f2","325":"g4d1","326":"g4f6","327":"g6h7","328":"g7e5","329":"b2b1q","330":"b5a4","331":"b7a6","332":"c2c3","333":"c8c4","334":"d2a2","335":"e4d2","336":"e5c4","337":"e5d5","338":"e5e6","339":"e6e7","340":"e8c7","341":"f4e4","342":"f4f2","343":"f4g5","344":"f8e6","345":"f8f4","346":"g2f2","347":"g8g3","348":"g8g6","349":"a5b6","350":"b2b1","351":"b6e3","352":"b7c7","353":"c1c2","354":"c2b2","355":"c3d4","356":"c7c8","357":"c8f8","358":"d4f4","359":"d5c5","360":"e4d6","361":"f4e5","362":"f5h3","363":"f8f5","364":"g3f4","365":"g6f4","366":"g6g7","367":"g7h8","368":"g8g2","369":"h5f3","370":"h5g5","371":"h8h4","372":"a2b2","373":"a8a2","374":"a8h8","375":"b2b3","376":"c4d3","377":"c8a8","378":"c8c5","379":"d3e4","380":"d5b6","381":"e4c3","382":"e4e5","383":"e4f4","384":"e5g3","385":"e5g6","386":"f5f3","387":"f6f4","388":"f6h4","389":"g5h5","390":"g6h6","391":"h1g2","392":"h6g6","393":"h7g5","394":"h8h5","395":"a3a4","396":"a4b3","397":"b1b2","398":"b4b5","399":"b4d6","400":"b6b2","401":"b8b4","402":"b8e8","403":"c4b3","404":"c7f7","405":"c7h2","406":"d1d2","407":"d4f5","408":"e3d3","409":"e3f2","410":"e4f2","411":"e4g2","412":"e6c4","413":"e6d6","414":"e7e4","415":"f3g2","416":"f4d2","417":"f8a8","418":"f8d7","419":"f8f1","420":"f8f2","421":"f8f3","422":"g3f3","423":"g3h3","424":"g5h6","425":"g6e5","426":"h4g4","427":"h4h5","428":"h8h6","429":"a2f2","430":"a3b4","431":"a6c7","432":"b2c3","433":"b4c5","434":"b4d2","435":"b8b1","436":"b8f8","437":"c4e3","438":"c5d3","439":"c5d5","440":"c5e3","441":"c6d8","442":"d2b2","443":"d7b5","444":"d7d4","445":"e4d4","446":"e4g5","447":"e5d6","448":"e6g6","449":"e7d5","450":"f4f5","451":"f4g4","452":"f6c3","453":"g2g1q","454":"g4e6","455":"h1g1","456":"h1h2","457":"h2g2","458":"h8c8","459":"a2c2","460":"a4a2","461":"a4b4","462":"a5a2","463":"a5b3","464":"a7b7","465":"b1a2","466":"b3a3","467":"b3b4","468":"b4d3","469":"b6d4","470":"b6f2","471":"c5b5","472":"c5e7","473":"c6c7","474":"c6d7","475":"c7b8","476":"c7c3","477":"c7e6","478":"c8e8","479":"d2e2","480":"d3c2","481":"d3c3","482":"d3d4","483":"d5b4","484":"d5d6","485":"d5e6","486":"d6d2","487":"d6e4","488":"d6f6","489":"d7f5","490":"d7f7","491":"d7g4","492":"d8a8","493":"e2e1q","494":"e4c5","495":"e4g6","496":"e5g4","497":"e8a8","498":"f1f2","499":"f2f1","500":"f2f3","501":"f2h2","502":"f3e3","503":"f3g3","504":"f4d6","505":"f4h4","506":"f5d4","507":"f6d8","508":"f6f2","509":"f8h6","510":"g1f2","511":"g5e7","512":"g5g3","513":"g7d4","514":"g8h6","515":"h2g3","516":"h3g4","517":"h5g3","518":"a1c1","519":"a2b3","520":"a5c3","521":"a5c7","522":"a7a8","523":"a8a3","524":"b2a3","525":"b2d2","526":"b4e7","527":"b7a8","528":"b7b2","529":"b7e4","530":"b8a7","531":"b8b3","532":"c2d3","533":"c5e4","534":"c7c4","535":"d2d1","536":"d2f2","537":"d4b2","538":"d4e4","539":"d4f6","540":"d5c6","541":"d6c4","542":"d6f5","543":"d6f8","544":"d7d2","545":"e2e3","546":"e3e4","547":"e5b2","548":"e5d7","549":"e5e2","550":"e6e4","551":"e6g5","552":"e6h3","553":"e7a3","554":"e7b7","555":"e8d6","556":"f2b2","557":"f2d2","558":"f4d4","559":"f5d7","560":"f6b2","561":"g1h1","562":"g2g1","563":"g3d6","564":"g3h4","565":"g4g2","566":"g5e3","567":"g5g2","568":"g6e6","569":"g6h4","570":"g8e8","571":"h3g3","572":"h3h5","573":"h4f2","574":"h4h2","575":"h7f6","576":"a1f6","577":"a3b3","578":"a8b7","579":"b2c2","580":"b2g2","581":"b3a2","582":"b7a7","583":"b7b8","584":"b8f4","585":"c2c1q","586":"c3b4","587":"c3c1","588":"c3d3","589":"c4b2","590":"c4b6","591":"c4c2","592":"c4d2","593":"c5e5","594":"c7b5","595":"c7c2","596":"c8a6","597":"d1b1","598":"d2c2","599":"d3c4","600":"d4c5","601":"d4f3","602":"d5c7","603":"d5d2","604":"d5f3","605":"d6g6","606":"d7h3","607":"e3f1","608":"e4c2","609":"e5e1","610":"e7e1","611":"e7e2","612":"e8g6","613":"f2e3","614":"f2f1q","615":"f3d1","616":"f5d6","617":"f5e5","618":"f5h4","619":"f6f3","620":"f6g8","621":"f6h6","622":"g1f1","623":"g2g3","624":"g2h3","625":"g4h4","626":"g6g4","627":"g7c3","628":"g7g3","629":"g8g4","630":"h4f4","631":"h4h1","632":"h5f5","633":"h5h6","634":"h6f5","635":"a2a4","636":"a2b1","637":"a2d5","638":"a2e2","639":"a3e3","640":"a4a5","641":"a5a6","642":"a6b6","643":"b1c1","644":"b1g1","645":"b2b5","646":"b2d4","647":"b2f6","648":"b3c3","649":"b3c4","650":"b4b1","651":"b4c4","652":"b4c6","653":"b5c5","654":"b6a7","655":"b6c6","656":"c2d2","657":"c2e2","658":"c2f2","659":"c2g2","660":"c3b3","661":"c3c4","662":"c4c5","663":"c4d5","664":"c5c3","665":"c5d7","666":"c6c1","667":"c6d6","668":"c7c1","669":"c7g7","670":"d2d3","671":"d2e1","672":"d3d1","673":"d4b6","674":"d4c6","675":"d4e2","676":"d6a3","677":"d6c6","678":"d7a7","679":"d7d1","680":"e1f2","681":"e2g2","682":"e3f5","683":"e4d5","684":"e5c7","685":"e5h5","686":"e6g4","687":"e7g7","688":"e8b8","689":"e8f6","690":"e8h5","691":"e8h8","692":"f2e1","693":"f3d3","694":"f3e2","695":"f4d3","696":"f4d5","697":"f4f6","698":"f5b1","699":"f5e3","700":"f5h7","701":"f8h7","702":"g1g2","703":"g2d2","704":"g2f3","705":"g3h2","706":"g4c8","707":"g4f2","708":"g4f4","709":"g6c2","710":"h1e1","711":"h2b2","712":"h2f4","713":"h2g1","714":"h3h1","715":"h5h3","716":"h6e3","717":"h7h4","718":"a1a4","719":"a1b1","720":"a1b2","721":"a1d1","722":"a1e1","723":"a2a5","724":"a2g2","725":"a3a5","726":"a3b2","727":"a5b5","728":"a5d8","729":"a5e1","730":"a6b7","731":"b1b3","732":"b1c2","733":"b1f5","734":"b1h1","735":"b3b1","736":"b4a5","737":"b4c2","738":"b5a5","739":"b5b2","740":"b6a6","741":"b8d6","742":"c1d1","743":"c1h1","744":"c3b2","745":"c3e4","746":"c3e5","747":"c4c6","748":"c4d4","749":"c5b3","750":"c5c1","751":"c5c2","752":"c6b8","753":"c7d5","754":"c7e8","755":"d1a1","756":"d1e1","757":"d2e4","758":"d3b3","759":"d4c2","760":"d4d1","761":"d4d2","762":"d4f2","763":"d5d1","764":"d5d7","765":"d5e7","766":"d5h5","767":"d6b8","768":"d6d8","769":"d7a4","770":"d7d3","771":"d8c6","772":"e1f1","773":"e2b2","774":"e2c2","775":"e3e1","776":"e4e7","777":"e5e3","778":"e5g7","779":"e6c7","780":"e6f4","781":"e7c6","782":"e7h7","783":"e8g7","784":"f2d4","785":"f2e2","786":"f2g1","787":"f3d2","788":"f3e5","789":"f4c7","790":"f4e6","791":"f4g2","792":"f5e7","793":"f5f2","794":"f5g3","795":"f6f1","796":"f7f3","797":"g2h1","798":"g3d3","799":"g3e1","800":"g3e2","801":"g5c1","802":"g5d2","803":"g5g1","804":"g5g7","805":"g5h3","806":"g6e7","807":"g6g2","808":"g6g3","809":"g7b2","810":"g8a8","811":"g8d8","812":"g8g5","813":"h1f3","814":"h1h3","815":"h2d2","816":"h2e2","817":"h3f3","818":"h3f5","819":"h4f6","820":"h4h6","821":"h5h1","822":"h6f4","823":"a1d4","824":"a1f1","825":"a2c4","826":"a3a1","827":"a3a6","828":"a3b5","829":"a3d6","830":"a4e4","831":"a5c5","832":"a5d2","833":"a5d5","834":"a5e5","835":"a6c5","836":"a7a2","837":"a8a4","838":"a8b6","839":"b1a1","840":"b1f1","841":"b2b4","842":"b2c1","843":"b2c4","844":"b3b7","845":"b3e3","846":"b3f3","847":"b4a4","848":"b5b6","849":"b5c6","850":"b5f1","851":"b6a8","852":"b6b3","853":"b6b7","854":"b6c8","855":"b6d6","856":"b7b1","857":"b7f3","858":"b8b5","859":"b8g3","860":"c1a1","861":"c1b1","862":"c1d2","863":"c1e3","864":"c2c1","865":"c2f5","866":"c3c7","867":"c3d2","868":"c3g3","869":"c4a5","870":"c4b5","871":"c4c1","872":"c4c7","873":"c4e2","874":"c5a3","875":"c5a5","876":"c5c6","877":"c5e6","878":"c5f8","879":"c6a4","880":"c6b6","881":"d1c2","882":"d1d3","883":"d2d4","884":"d2d7","885":"d2f4","886":"d3d7","887":"d3e2","888":"d3f2","889":"d3g6","890":"d4c4","891":"d4g4","892":"d6d4","893":"d7h7","894":"e1e2","895":"e1g1","896":"e1h1","897":"e2a2","898":"e2d2","899":"e2d3","900":"e3c1","901":"e3c3","902":"e3d4","903":"e3f3","904":"e3g3","905":"e3h3","906":"e3h6","907":"e5c3","908":"e5g5","909":"e6a2","910":"e6d4","911":"e8e3","912":"f1e1","913":"f1e2","914":"f2c2","915":"f2f4","916":"f2f5","917":"f3f1","918":"f3f4","919":"f3f5","920":"f4g6","921":"f5d5","922":"f5f1","923":"f7c7","924":"f7f2","925":"f7h5","926":"f8a3","927":"g2e2","928":"g2g7","929":"g3g1","930":"g3g4","931":"g4d4","932":"g4d7","933":"g4e5","934":"g4g5","935":"g4g6","936":"g4h2","937":"g5d8","938":"g5e4","939":"g5e6","940":"g5f3","941":"g6f8","942":"g7a1","943":"g7g2","944":"g7g4","945":"g8g1","946":"h1b1","947":"h1f1","948":"h2c7","949":"h2e5","950":"h2h4","951":"h2h5","952":"h3f1","953":"h3h6","954":"h4d4","955":"h4g6","956":"h5c5","957":"h5g7","958":"h5h2","959":"h7h2","960":"h8g6","961":"a1c3","962":"a1e5","963":"a1g1","964":"a2a6","965":"a2a7","966":"a2d2","967":"a2h2","968":"a3c3","969":"a3d3","970":"a3e7","971":"a4a1","972":"a4b5","973":"a4f4","974":"a5a1","975":"a5a3","976":"a5h5","977":"a6a7","978":"a6b8","979":"a6c4","980":"a6c8","981":"a7a1","982":"a7a3","983":"a7a4","984":"a7b8","985":"a8a5","986":"b1d1","987":"b2d3","988":"b2e2","989":"b2e5","990":"b2f2","991":"b2h2","992":"b3a4","993":"b3d4","994":"b3d5","995":"b4h4","996":"b5a3","997":"b5a6","998":"b5b8","999":"b5c3","1000":"b5d4","1001":"b6e6","1002":"b7d6","1003":"b8e5","1004":"b8g8","1005":"b8h8","1006":"c1f1","1007":"c2d4","1008":"c2g6","1009":"c2h2","1010":"c3a1","1011":"c3e1","1012":"c3e3","1013":"c3f6","1014":"c4b4","1015":"c4d6","1016":"c5a6","1017":"c5a7","1018":"c5b7","1019":"c5c8","1020":"c6a6","1021":"c6e8","1022":"c6g2","1023":"c7a7","1024":"c8e7","1025":"c8g8","1026":"c8h8","1027":"d1g4","1028":"d1h1","1029":"d2b4","1030":"d2f3","1031":"d2g2","1032":"d2h2","1033":"d3a3","1034":"d3b2","1035":"d3b5","1036":"d3c1","1037":"d3e1","1038":"d3e3","1039":"d3f1","1040":"d3f4","1041":"d3f5","1042":"d4a1","1043":"d4d5","1044":"d4d7","1045":"d4d8","1046":"d5g5","1047":"d5h1","1048":"d6b6","1049":"d6e8","1050":"d8e6","1051":"e1a5","1052":"e1c1","1053":"e1d1","1054":"e1d2","1055":"e1e5","1056":"e1e8","1057":"e2e1","1058":"e2f1","1059":"e2g3","1060":"e3b6","1061":"e3c5","1062":"e3g5","1063":"e4a4","1064":"e4e2","1065":"e4g4","1066":"e5a1","1067":"e5c6","1068":"e5e7","1069":"e5h2","1070":"e6b3","1071":"e6b6","1072":"e6e1","1073":"e6g7","1074":"e7c8","1075":"f1a6","1076":"f1c4","1077":"f2a2","1078":"f2b6","1079":"f2d3","1080":"f2g3","1081":"f2g4","1082":"f3g4","1083":"f4a4","1084":"f4e2","1085":"f4h3","1086":"f5c2","1087":"f5f7","1088":"f5h5","1089":"f6a1","1090":"f6b6","1091":"f6c6","1092":"f7b7","1093":"f7d7","1094":"f7f4","1095":"f7h7","1096":"g1a1","1097":"g1e3","1098":"g2a2","1099":"g2b2","1100":"g3e3","1101":"g3f1","1102":"g3h5","1103":"g4h6","1104":"g6g8","1105":"g7e8","1106":"h1a1","1107":"h1d1","1108":"h2f2","1109":"h3e3","1110":"h3f2","1111":"h3f4","1112":"h4d8","1113":"h4e1","1114":"h4e7","1115":"h6e6","1116":"h6f6","1117":"h6f8","1118":"h6g4","1119":"h6h2","1120":"h6h3","1121":"h7b1","1122":"h7d3","1123":"h7h1","1124":"a1a3","1125":"a1a5","1126":"a1a7","1127":"a3f3","1128":"a4a6","1129":"a4a7","1130":"a4c2","1131":"a4c6","1132":"a4g4","1133":"a5c6","1134":"a6a2","1135":"a6a3","1136":"a6a8","1137":"a6c6","1138":"a7b5","1139":"a7c7","1140":"a7d7","1141":"b1b5","1142":"b1e1","1143":"b1e4","1144":"b2a1","1145":"b2b7","1146":"b2b8","1147":"b2g7","1148":"b3a5","1149":"b3c5","1150":"b4b2","1151":"b4d5","1152":"b4e1","1153":"b5b3","1154":"b5d5","1155":"b5d6","1156":"b6d8","1157":"b7b4","1158":"b7d5","1159":"b7e7","1160":"b7g2","1161":"b8b6","1162":"b8h2","1163":"c1b2","1164":"c1c4","1165":"c1g5","1166":"c2a1","1167":"c2a3","1168":"c2b3","1169":"c2c4","1170":"c2c5","1171":"c2c6","1172":"c3a3","1173":"c3a5","1174":"c3b5","1175":"c3c5","1176":"c3c6","1177":"c3e2","1178":"c3g7","1179":"c4a3","1180":"c4a4","1181":"c4e4","1182":"c4e5","1183":"c5c7","1184":"c5f2","1185":"c5h5","1186":"c6a7","1187":"c6e4","1188":"c6f3","1189":"c6f6","1190":"c7a6","1191":"c8d6","1192":"d1d7","1193":"d1e2","1194":"d1f3","1195":"d2c1","1196":"d2d5","1197":"d2d6","1198":"d2f1","1199":"d3d5","1200":"d3h7","1201":"d4b4","1202":"d4d6","1203":"d4e6","1204":"d5a2","1205":"d5a5","1206":"d5b3","1207":"d5b5","1208":"d5f5","1209":"d6a6","1210":"d6b5","1211":"d6d1","1212":"d6f7","1213":"d7b7","1214":"d8f7","1215":"e1a1","1216":"e1b1","1217":"e1e3","1218":"e1e4","1219":"e1e6","1220":"e1g3","1221":"e2b5","1222":"e2e4","1223":"e2f4","1224":"e2g4","1225":"e3c2","1226":"e3d2","1227":"e3e5","1228":"e4b1","1229":"e4c4","1230":"e4e6","1231":"e4h4","1232":"e4h7","1233":"e5b5","1234":"e5c5","1235":"e6c5","1236":"e6c8","1237":"e6e8","1238":"e7a7","1239":"e7e3","1240":"e8c6","1241":"f1a1","1242":"f1b1","1243":"f1d2","1244":"f1f3","1245":"f1f5","1246":"f1g1","1247":"f2d1","1248":"f2h3","1249":"f3e4","1250":"f3h3","1251":"f4c4","1252":"f4f1","1253":"f4h2","1254":"f4h5","1255":"f4h6","1256":"f6d6","1257":"f6f8","1258":"f6h8","1259":"f7c4","1260":"f7f1","1261":"g1b1","1262":"g1c5","1263":"g1d4","1264":"g1g3","1265":"g1g4","1266":"g1h2","1267":"g1h3","1268":"g2c2","1269":"g2d5","1270":"g2e4","1271":"g2f1","1272":"g2g4","1273":"g2g5","1274":"g3c7","1275":"g3e4","1276":"g3e5","1277":"g3g5","1278":"g4e4","1279":"g4g7","1280":"g5a5","1281":"g6h8","1282":"g7b7","1283":"g7d7","1284":"g7e7","1285":"g8b8","1286":"g8c8","1287":"h1c1","1288":"h1c6","1289":"h1e4","1290":"h2a2","1291":"h2g4","1292":"h3e6","1293":"h4c4","1294":"h4f3","1295":"h4g2","1296":"h5d1","1297":"h5d5","1298":"h5e5","1299":"h5f7","1300":"h5h7","1301":"h6b6","1302":"h6h1","1303":"h7e4","1304":"h7f7","1305":"h8b8","1306":"a1h1","1307":"a1h8","1308":"a2a8","1309":"a2b4","1310":"a2e6","1311":"a3c1","1312":"a3c2","1313":"a3c4","1314":"a3c5","1315":"a3g3","1316":"a4a8","1317":"a4c3","1318":"a4c4","1319":"a4d1","1320":"a4d4","1321":"a5b7","1322":"a5g5","1323":"a6a1","1324":"a6a4","1325":"a6b4","1326":"a6d3","1327":"a6d6","1328":"a6e2","1329":"a6f6","1330":"a7c5","1331":"a7c6","1332":"a7d4","1333":"a7e3","1334":"a7e7","1335":"a7f2","1336":"a7h7","1337":"a8a6","1338":"a8c6","1339":"a8c7","1340":"a8d5","1341":"a8f3","1342":"a8h1","1343":"b1b4","1344":"b1b7","1345":"b1d3","1346":"b2c1q","1347":"b2d1","1348":"b2h8","1349":"b3c1","1350":"b3c2","1351":"b3d3","1352":"b4a2","1353":"b4a6","1354":"b4b7","1355":"b4b8","1356":"b4d4","1357":"b4e4","1358":"b4f4","1359":"b4g4","1360":"b5b1","1361":"b5d3","1362":"b5d7","1363":"b5e2","1364":"b5e5","1365":"b6a4","1366":"b6b4","1367":"b6f6","1368":"b6h6","1369":"b7f7","1370":"b7g7","1371":"b7h1","1372":"c1a3","1373":"c1c3","1374":"c1e1","1375":"c1e2","1376":"c1f4","1377":"c1g1","1378":"c1h6","1379":"c2b1","1380":"c2c7","1381":"c2c8","1382":"c2d1","1383":"c2e4","1384":"c3c8","1385":"c3d1","1386":"c3f3","1387":"c4a6","1388":"c4c8","1389":"c4e6","1390":"c4f1","1391":"c4f4","1392":"c4f7","1393":"c5f5","1394":"c5g1","1395":"c5g5","1396":"c6b7","1397":"c6c2","1398":"c6c3","1399":"c6c4","1400":"c6c8","1401":"c6e6","1402":"c6g6","1403":"c7h7","1404":"c8a7","1405":"c8b6","1406":"d1b3","1407":"d1d6","1408":"d1d8","1409":"d1f1","1410":"d1g1","1411":"d2a5","1412":"d2b3","1413":"d2c4","1414":"d2d8","1415":"d2e1q","1416":"d2h6","1417":"d3a6","1418":"d3b1","1419":"d3c5","1420":"d3d8","1421":"d3e5","1422":"d3f3","1423":"d3g3","1424":"d3h3","1425":"d4a4","1426":"d4a7","1427":"d4b3","1428":"d4b5","1429":"d4g1","1430":"d4g7","1431":"d4h4","1432":"d5d3","1433":"d5f7","1434":"d5g2","1435":"d5g8","1436":"d6b7","1437":"d6c8","1438":"d6d3","1439":"d7g7","1440":"d8b7","1441":"e1c2","1442":"e1e7","1443":"e1f3","1444":"e1h4","1445":"e2c1","1446":"e2d1","1447":"e2e5","1448":"e2f1q","1449":"e2f2","1450":"e2f3","1451":"e2h2","1452":"e3b3","1453":"e3c4","1454":"e3d1","1455":"e3e7","1456":"e3e8","1457":"e4a8","1458":"e4c6","1459":"e4e8","1460":"e4h1","1461":"e5a5","1462":"e5b8","1463":"e5e8","1464":"e6e2","1465":"e6e3","1466":"e6f8","1467":"e6h6","1468":"e7g8","1469":"e8a4","1470":"f1b5","1471":"f1c1","1472":"f1f4","1473":"f1f7","1474":"f1f8","1475":"f1g2","1476":"f1g3","1477":"f1h1","1478":"f2c5","1479":"f2e4","1480":"f2f6","1481":"f2f7","1482":"f2f8","1483":"f3a3","1484":"f3b3","1485":"f3c6","1486":"f3d4","1487":"f3d5","1488":"f3e1","1489":"f3f7","1490":"f3g1","1491":"f3g5","1492":"f3h1","1493":"f3h2","1494":"f3h4","1495":"f3h5","1496":"f4b4","1497":"f4b8","1498":"f4c1","1499":"f5a5","1500":"f5g7","1501":"f5h6","1502":"f6a6","1503":"f7a2","1504":"f7b3","1505":"f7d5","1506":"f7d6","1507":"f7d8","1508":"f7e5","1509":"f7g5","1510":"g1c1","1511":"g2c6","1512":"g2e1","1513":"g2g8","1514":"g3c3","1515":"g3g6","1516":"g3g7","1517":"g4a4","1518":"g4c4","1519":"g4g1","1520":"g5e5","1521":"g5f7","1522":"g5g8","1523":"g5h7","1524":"g6c6","1525":"g6d6","1526":"g6g1","1527":"g7a7","1528":"g7e6","1529":"g7f5","1530":"g7h5","1531":"g8b3","1532":"g8e6","1533":"h1b7","1534":"h1d5","1535":"h1h5","1536":"h1h6","1537":"h2c2","1538":"h2f1","1539":"h2h8","1540":"h3c3","1541":"h3d7","1542":"h3g1","1543":"h3h8","1544":"h4e4","1545":"h4f5","1546":"h4h7","1547":"h4h8","1548":"h5e8","1549":"h6d2","1550":"h6h4","1551":"h7c7","1552":"h7d7","1553":"h7f8","1554":"h8a1","1555":"h8d4","1556":"h8f6"},"vocab_size":1557,"top_moves":[["c7c6",743],["g8f6",726],["d7d5",722],["e7e6",677],["e8g8",514],["c8g4",465],["b8d7",438],["f8d6",375],["h7h6",371],["b8c6",328],["d5e4",307],["f6e4",299],["c6d5",288],["g7g6",283],["g4f3",265],["f8e7",254],["a7a6",236],["c6c5",234],["d8c7",200],["h7h5",193],["a8c8",187],["f8e8",182],["e6e5",179],["f7f6",169],["f7f5",164],["e8c8",159],["f8g7",156],["d8e7",150],["b7b5",146],["g7g5",144],["c8f5",142],["e7f6",136],["h5h4",136],["d7f6",133],["e6d5",133],["g7f6",130],["a7a5",129],["d6e5",129],["d7e5",129],["f6d5",129],["c5d4",128],["b7b6",127],["b7c6",118],["h6h5",118],["g4h5",116],["a8b8",115],["c8d7",113],["d8d7",113],["g8g7",113],["g8h8",109],["g6g5",107],["h7g6",107],["e7d6",106],["d7d6",105],["f8d8",103],["g8h7",98],["a5a4",97],["g5g4",96],["h5g6",95],["g8f8",94],["h8g8",93],["f6f5",92],["e5e4",91],["d5d4",84],["a8e8",82],["d7b6",82],["f5g6",81],["b5b4",80],["f5e4",80],["f7g6",80],["c6e5",79],["a8d8",78],["d8d6",78],["f6e5",78],["d5c4",77],["e7e5",76],["f6d7",76],["e8e7",74],["f6g4",74],["c8b8",72],["d6f4",71],["h5g4",71],["f5f4",69],["c8b7",68],["d6e7",67],["f7e6",67],["d8c8",66],["e6f5",66],["f8f7",64],["h4h3",64],["c8c7",63],["d8e8",63],["a6a5",62],["e8f7",62],["c5c4",61],["f6h5",61],["g7h6",61],["e7g5",60],["c8e6",58],["d8b8",58]]}