{"move_to_index":{"d2d4":0,"g1f3":1,"e2e3":2,"c1f4":3,"c2c3":4,"f1d3":5,"b1d2":6,"f3e5":7,"e1g1":8,"e1c1":9,"h2h3":10,"f4g3":11,"d4e5":12,"e3d4":13,"e3e4":14,"a2a3":15,"f4e5":16,"f2f4":17,"d1e2":18,"g2g4":19,"h2h4":20,"b1c3":21,"d2e4":22,"d2f3":23,"g2g3":24,"f2f3":25,"h4h5":26,"f1e2":27,"c3c4":28,"d1c2":29,"h2g3":30,"b2b3":31,"d1f3":32,"f1e1":33,"g4g5":34,"c1b1":35,"a2a4":36,"a1b1":37,"d1d2":38,"d3c2":39,"c2c4":40,"d3e4":41,"f3d4":42,"b2b4":43,"h3h4":44,"d4c5":45,"f1d1":46,"d4d5":47,"g3g4":48,"a4a5":49,"f4g5":50,"a1c1":51,"g1g2":52,"h1g1":53,"c1c2":54,"e2f3":55,"e5f6":56,"g2f3":57,"e4e5":58,"a1d1":59,"b4b5":60,"e2d3":61,"f3e4":62,"b2c3":63,"f3f4":64,"f4f5":65,"g1h2":66,"e1e2":67,"g3h4":68,"g5f6":69,"d1e1":70,"c4c5":71,"c4d5":72,"h5h6":73,"d3e2":74,"h5g6":75,"e4d5":76,"g1f1":77,"c1d2":78,"c3d4":79,"d1d3":80,"d3c4":81,"a3a4":82,"e3f4":83,"a5a6":84,"d3f5":85,"f3d2":86,"e2e4":87,"d1c1":88,"e2d2":89,"d3g6":90,"b3b4":91,"c1b2":92,"c1g5":93,"d2c4":94,"f3g4":95,"g3f4":96,"g4f5":97,"c2d3":98,"f3g5":99,"a6a7":100,"b5b6":101,"c2d2":102,"d1f1":103,"d2d3":104,"e5e6":105,"f2e3":106,"f1g2":107,"c2e4":108,"e1d1":109,"f2g3":110,"g1h1":111,"h4g5":112,"d1d8":113,"g5g6":114,"a1e1":115,"d1d4":116,"c2b3":117,"c5c6":118,"e5c6":119,"e5d6":120,"d1h1":121,"e2f2":122,"c3e4":123,"d2e2":124,"f4d6":125,"f3e2":126,"g1f2":127,"b5c6":128,"c3b4":129,"e5g7":130,"a3b4":131,"d2c2":132,"b2a3":133,"g3e5":134,"b1a1":135,"d1g1":136,"d2b3":137,"h1d1":138,"b6b7":139,"e6e7":140,"g5h4":141,"h6h7":142,"d2c3":143,"h1e1":144,"c1e3":145,"f1c1":146,"g6g7":147,"e5d7":148,"h1f1":149,"h4g3":150,"e2g4":151,"f1b5":152,"f5f6":153,"b1c1":154,"c4b5":155,"d5d6":156,"e1d2":157,"d1b3":158,"d1h5":159,"h1h2":160,"h3g4":161,"a7a8q":162,"d1d5":163,"f1g1":164,"c1d1":165,"d3b5":166,"d3h7":167,"h1h7":168,"b1a3":169,"d6d7":170,"f6f7":171,"c6c7":172,"d1g4":173,"f1f2":174,"g5h6":175,"d1d7":176,"d3d4":177,"f3g3":178,"g3d6":179,"c3d5":180,"e2c4":181,"e2h5":182,"f3e3":183,"g4h5":184,"e2f1":185,"f2e2":186,"f3h4":187,"b1c2":188,"b3a4":189,"b3c4":190,"b4c5":191,"c3b5":192,"d2e3":193,"d5e6":194,"f1c4":195,"h2g1":196,"h2g2":197,"a2b3":198,"c2b2":199,"c2f5":200,"e1e8":201,"e2e5":202,"a4b5":203,"c3b3":204,"e4d3":205,"e4f5":206,"e4f6":207,"f4e3":208,"g2f2":209,"g2h3":210,"g3f2":211,"b1b2":212,"c4b3":213,"c1c3":214,"e5g3":215,"e5g6":216,"e7e8q":217,"h1h6":218,"c2d1":219,"c5d6":220,"d1d6":221,"d2e1":222,"d3a6":223,"d3d2":224,"e3d2":225,"e4d6":226,"g2h2":227,"h1h5":228,"h6g7":229,"a7a8":230,"b3c2":231,"c1c7":232,"d2f1":233,"d4c6":234,"b7a7":235,"b7b8q":236,"c1c6":237,"c2c1":238,"d1b1":239,"e1e6":240,"e1e7":241,"e1f1":242,"e2b5":243,"e3e2":244,"f2g2":245,"f3d5":246,"f4h6":247,"g2f1":248,"h4f6":249,"c3e2":250,"c4d3":251,"d3c3":252,"e4f3":253,"e5f3":254,"f3e1":255,"g3h2":256,"g4f3":257,"h7g6":258,"d3e3":259,"e1e3":260,"e1e5":261,"e2d1":262,"f1f3":263,"f3h2":264,"g4f4":265,"h7h8":266,"a1f1":267,"b1b7":268,"b1d1":269,"b3c3":270,"c1c8":271,"d5c6":272,"e3f3":273,"f3h5":274,"a3b5":275,"b4c3":276,"e2c2":277,"f1f8":278,"f7f8q":279,"g3f3":280,"h4e7":281,"b5c7":282,"b5d7":283,"c2b1":284,"c2g6":285,"c5b6":286,"d2c1":287,"d2f4":288,"d7b7":289,"e1f2":290,"e2e1":291,"f3h3":292,"f5e6":293,"g2g1":294,"g5f7":295,"h1h8":296,"h2h1":297,"h5g4":298,"h5h7":299,"a8a7":300,"b2c2":301,"b3d4":302,"c2a4":303,"c2e2":304,"c3d3":305,"c7b7":306,"d1a1":307,"d5c5":308,"d5e5":309,"f1f7":310,"f3g2":311,"f5e4":312,"f5g4":313,"f5g6":314,"g3h3":315,"g4h4":316,"h1c1":317,"h3g3":318,"h6g5":319,"a5b6":320,"b5a5":321,"b7b8":322,"c3a4":323,"c4b4":324,"e1e4":325,"e3d3":326,"e4b7":327,"e4f4":328,"e5f7":329,"f1h1":330,"f6e6":331,"g1g6":332,"g5e7":333,"g7h7":334,"h1h3":335,"h5g5":336,"h7h6":337,"a1g1":338,"b4c4":339,"c4e5":340,"c6b7":341,"c7c8q":342,"d1a4":343,"d4c3":344,"d4f3":345,"d4f5":346,"d6d5":347,"d7c7":348,"e2a6":349,"e2e6":350,"e2h2":351,"e5g4":352,"f1e3":353,"f1f4":354,"f4c7":355,"f4f3":356,"g1e1":357,"g1g7":358,"g4h3":359,"g6f6":360,"g6f7":361,"h5h4":362,"a3c2":363,"a6b7":364,"b1e1":365,"b7b6":366,"c1c4":367,"c3d2":368,"c7a7":369,"c8c7":370,"d5d7":371,"d6c6":372,"d7d6":373,"e4c6":374,"e4d4":375,"e4e2":376,"e6d6":377,"e6d7":378,"f3f6":379,"f5e5":380,"g3c7":381,"g5d8":382,"g6h7":383,"g7f6":384,"h3g2":385,"h4h3":386,"h6h5":387,"h7h8q":388,"a1a2":389,"a4b4":390,"a7a6":391,"a8h8":392,"b3d2":393,"b4a4":394,"b5a4":395,"b7c7":396,"c2h7":397,"d4b5":398,"d4e6":399,"d5c4":400,"e2f4":401,"e4a8":402,"e4c5":403,"e5c7":404,"e5d4":405,"f2g1":406,"f3b7":407,"f3f7":408,"f4g4":409,"f5f4":410,"f5f7":411,"f6d8":412,"f7e6":413,"f7g7":414,"g1g5":415,"g2e4":416,"g2g6":417,"g5e6":418,"g5f4":419,"g5h5":420,"g6h6":421,"g7g8q":422,"h7d3":423,"a4a3":424,"a4b3":425,"b2d4":426,"b3a3":427,"b3b6":428,"b4a5":429,"b7a6":430,"c4c3":431,"c4d6":432,"c6d6":433,"d4e4":434,"d7d8":435,"d7d8q":436,"e1d3":437,"e1h1":438,"e2d4":439,"e2g2":440,"e3d5":441,"e4g6":442,"e5d5":443,"e5e7":444,"e5f4":445,"e6d5":446,"f1b1":447,"f3f2":448,"f7f6":449,"g4e6":450,"h1h4":451,"h3f3":452,"h6g6":453,"a1a6":454,"a1a7":455,"a7a5":456,"a7b7":457,"b1a2":458,"b1f1":459,"b2c1":460,"b2e5":461,"b3d5":462,"b8b7":463,"c6a6":464,"c7c8":465,"d2d1":466,"d2d5":467,"d2d8":468,"d4c4":469,"d4d1":470,"d4e3":471,"d4f6":472,"d8d7":473,"e4e3":474,"e4e7":475,"e5g5":476,"e6f7":477,"f1f6":478,"f3c6":479,"f4d2":480,"f5d3":481,"f5g5":482,"f7e7":483,"f8e8":484,"g1g3":485,"g2b7":486,"g7f7":487,"h4f4":488,"h4g4":489,"h8g7":490,"h8h7":491,"a4a7":492,"a5b5":493,"a6b5":494,"b1b3":495,"b1b6":496,"b3c5":497,"b5a3":498,"b5c4":499,"b5d6":500,"b6a6":501,"c1a1":502,"c3b2":503,"c4d4":504,"c5b5":505,"c5d5":506,"c6c8":507,"c7c6":508,"c7g3":509,"c8b8":510,"d2b2":511,"d4b3":512,"d8e8":513,"e1b1":514,"e2e7":515,"e4g5":516,"e5c4":517,"e5e4":518,"e6e5":519,"e7g7":520,"e8e7":521,"e8f7":522,"f1d2":523,"f1f5":524,"f2f1":525,"f4e4":526,"f4f6":527,"f5c8":528,"f5e7":529,"f6e7":530,"f7f8":531,"g1d1":532,"g4c8":533,"g4g7":534,"g5f3":535,"g5f5":536,"g6h5":537,"g7e5":538,"g7g8":539,"h3h2":540,"h3h6":541,"h4h7":542,"h5e2":543,"h5h8":544,"h6h8":545,"h7f5":546,"a1a8":547,"a5a7":548,"a6a5":549,"a8d8":550,"b2a2":551,"b4a3":552,"b5b7":553,"b5e8":554,"b7f7":555,"b8e5":556,"c1c5":557,"c2c6":558,"c2c7":559,"c2e3":560,"c3c2":561,"c4e2":562,"c4e3":563,"c5d4":564,"c7a8":565,"c7f7":566,"d2d6":567,"d3f3":568,"d4e2":569,"d5e4":570,"d6e5":571,"d7a7":572,"e1f3":573,"e2g3":574,"e3b6":575,"e3c5":576,"e3g5":577,"e3h6":578,"e4g2":579,"e5f5":580,"e6c6":581,"e6f5":582,"e7e8":583,"e7f7":584,"e8f8":585,"f3f5":586,"f4f7":587,"f4h4":588,"f6e5":589,"f6f5":590,"f6g5":591,"g1e2":592,"g1g4":593,"g3f5":594,"g3g2":595,"g3g6":596,"g4g3":597,"g4g6":598,"g5g4":599,"g6d3":600,"g6g5":601,"h8f6":602,"a3b3":603,"a4c6":604,"a6b4":605,"a7d7":606,"a8b7":607,"a8b8":608,"b2f6":609,"b5a6":610,"b5b4":611,"b5d3":612,"b7f3":613,"c1e1":614,"c2c8":615,"c3e5":616,"c4c6":617,"c4c7":618,"c5b4":619,"c5c4":620,"c5d7":621,"c6c5":622,"c6e5":623,"c7d6":624,"c8a8":625,"d2d7":626,"d2g5":627,"d6b4":628,"d6c7":629,"d6e6":630,"d6e7":631,"d6g3":632,"e4c2":633,"e4d2":634,"e4e6":635,"e4h7":636,"e5c3":637,"e5c5":638,"e6f6":639,"e8e6":640,"f1a1":641,"f2e1":642,"f7e8":643,"f7f5":644,"g3b8":645,"g4e2":646,"g4e4":647,"g6e5":648,"g6f5":649,"h1a1":650,"h1g2":651,"h4d8":652,"h5f5":653,"h7f7":654,"h7g7":655,"h7h5":656,"h8f8":657,"h8h6":658,"a1a3":659,"a2b2":660,"a3c4":661,"a5c5":662,"a7c5":663,"a7c7":664,"a8a5":665,"a8e4":666,"b1b4":667,"b1b8":668,"b3e6":669,"b4b3":670,"b5c3":671,"b6b5":672,"b6c6":673,"b6e6":674,"b7b5":675,"b7c8":676,"b8c8":677,"c2c5":678,"c3c8":679,"c4e6":680,"c6b5":681,"c6d5":682,"c6d7":683,"c8d7":684,"d2b1":685,"d3d5":686,"d3e5":687,"d3f1":688,"d3g3":689,"d4d6":690,"d4d7":691,"d5d4":692,"d5e3":693,"d5f6":694,"d6a6":695,"d6d8":696,"d6e4":697,"d6f8":698,"d7f7":699,"d7g7":700,"d7h7":701,"d8d4":702,"e2b2":703,"e2e8":704,"e3g3":705,"e3h3":706,"e4b4":707,"e4c4":708,"e4g3":709,"e5d3":710,"e5e2":711,"e6g6":712,"e7a7":713,"e7c7":714,"e7d6":715,"e7d8":716,"e7e6":717,"e8a8":718,"e8d7":719,"e8e5":720,"f2d4":721,"f2f6":722,"f3d3":723,"f3g1":724,"f4h2":725,"f5d5":726,"f5e3":727,"f6d4":728,"f6g7":729,"f8h8":730,"g1b1":731,"g1c1":732,"g5e4":733,"g6g4":734,"g7d7":735,"g7g6":736,"h2f2":737,"h2h7":738,"h3h7":739,"h4f5":740,"h5f7":741,"h6d6":742,"h8d8":743,"h8g8":744,"a1h1":745,"a2a1":746,"a3a7":747,"a3b2":748,"a4c5":749,"a4d7":750,"a5a4":751,"a5b4":752,"a6a1":753,"a6c4":754,"a6c6":755,"a6e6":756,"a7a4":757,"a7b6":758,"a8c8":759,"a8d5":760,"a8e8":761,"b2b1":762,"b2d3":763,"b3a2":764,"b3b7":765,"b4d4":766,"b4e7":767,"b6c5":768,"b7c6":769,"b7d5":770,"b7d7":771,"b8a8":772,"b8b6":773,"c2f2":774,"c3c1":775,"c4b6":776,"c4c2":777,"c4d2":778,"c4f7":779,"c5c8":780,"c6b6":781,"c6c4":782,"c6e6":783,"c7b5":784,"c7b8":785,"c7d7":786,"c8d8":787,"c8f5":788,"c8h8":789,"d2b4":790,"d2g2":791,"d2h6":792,"d3d1":793,"d5b5":794,"d5b7":795,"d5f5":796,"d5f7":797,"d5h5":798,"d6b6":799,"d6b7":800,"d8a8":801,"d8d6":802,"e3e5":803,"e3e6":804,"e3f2":805,"e3f5":806,"e4e1":807,"e4e8":808,"e5e3":809,"e6e8":810,"e7d7":811,"e7f5":812,"f1g3":813,"f3a8":814,"f4f2":815,"f5f3":816,"f6g6":817,"f7d7":818,"f8b4":819,"f8g8":820,"g2g5":821,"g3e1":822,"g3e3":823,"g4d7":824,"g4g2":825,"g5g7":826,"g6c2":827,"g6e8":828,"g7f8":829,"g7h6":830,"g7h8":831,"g8f7":832,"g8f8":833,"g8g6":834,"g8h8":835,"h1b1":836,"h2e5":837,"h2f1":838,"h2g4":839,"h2h5":840,"h4g6":841,"h5e8":842,"h5f3":843,"h6f6":844,"h6h4":845,"h8e8":846,"a1a5":847,"a2b1":848,"a3a2":849,"a3d6":850,"a4a8":851,"a4b6":852,"a5c3":853,"a6b6":854,"a6c8":855,"a7a3":856,"a8f8":857,"a8g8":858,"b2d2":859,"b3b2":860,"b3d3":861,"b4c6":862,"b4d3":863,"b4f4":864,"b5e2":865,"b6a7":866,"b6b8":867,"b6c7":868,"b7a8":869,"b7c5":870,"b7e4":871,"c1a3":872,"c1f1":873,"c1g1":874,"c2a2":875,"c2d4":876,"c3b1":877,"c3c6":878,"c3c7":879,"c3d1":880,"c4a3":881,"c4a6":882,"c4h4":883,"c5b3":884,"c5b7":885,"c6a7":886,"c6b4":887,"c6d4":888,"c6d8":889,"c6e7":890,"c7b6":891,"c7d5":892,"c7e5":893,"c7e7":894,"c7f4":895,"c7h7":896,"c8c6":897,"c8e8":898,"c8f8":899,"c8g4":900,"c8g8":901,"d2a5":902,"d2f2":903,"d2h2":904,"d3b4":905,"d3d8":906,"d4a7":907,"d4b2":908,"d4b4":909,"d4c2":910,"d4d3":911,"d4d8":912,"d4g7":913,"d4h4":914,"d5f4":915,"d6d2":916,"d6f5":917,"d6f6":918,"d7d5":919,"d7h3":920,"d8b8":921,"d8c7":922,"d8c8":923,"d8d5":924,"d8f8":925,"e4h4":926,"e5e8":927,"e5h8":928,"e6b6":929,"e6c7":930,"e6c8":931,"e6g4":932,"e7b7":933,"e7d5":934,"e7e2":935,"f1h2":936,"f1h3":937,"f2c2":938,"f2f7":939,"f2h2":940,"f2h4":941,"f3c3":942,"f4d5":943,"f5d6":944,"f5g3":945,"f5g7":946,"f6d5":947,"f6d6":948,"f6f8":949,"f7a7":950,"f7d5":951,"f7d8":952,"f7h7":953,"f7h8":954,"f8e7":955,"f8f7":956,"g2c2":957,"g2d2":958,"g2d5":959,"g2h1":960,"g3f1":961,"g3g5":962,"g3g7":963,"g4e5":964,"g5g3":965,"g6d6":966,"g6f8":967,"g6g8":968,"g7c7":969,"g7g2":970,"g8d8":971,"h2f3":972,"h2h8":973,"h3e6":974,"h4h6":975,"h6e6":976,"h6f4":977,"h6f8":978,"a3a5":979,"a3c3":980,"a4c2":981,"a4c3":982,"a4d4":983,"a4g4":984,"a4h4":985,"a5a8":986,"a5d5":987,"a6a4":988,"a6a8":989,"a6d3":990,"a6f1":991,"a7b5":992,"a7c6":993,"a7e7":994,"a7f7":995,"a7h7":996,"a8a6":997,"a8b6":998,"a8c7":999,"b1b5":1000,"b1d3":1001,"b1e4":1002,"b1f5":1003,"b2a1":1004,"b3d1":1005,"b3f7":1006,"b4a6":1007,"b4b6":1008,"b4d6":1009,"b4g4":1010,"b5a7":1011,"b5b8":1012,"b5c5":1013,"b5d4":1014,"b5d5":1015,"b6a5":1016,"b6b3":1017,"b6d6":1018,"b6e3":1019,"b7b4":1020,"b8b1":1021,"b8d6":1022,"b8d8":1023,"b8g3":1024,"b8h8":1025,"c1h6":1026,"c2g2":1027,"c3a3":1028,"c3g7":1029,"c4a4":1030,"c4a5":1031,"c4c8":1032,"c4e4":1033,"c5a6":1034,"c5c7":1035,"c5e3":1036,"c5e4":1037,"c5e6":1038,"c5f5":1039,"c6c2":1040,"c6c3":1041,"c6e8":1042,"c7d8":1043,"c8a6":1044,"c8c5":1045,"d3c5":1046,"d5a5":1047,"d5a8":1048,"d5b4":1049,"d5d1":1050,"d5d3":1051,"d5g2":1052,"d6b8":1053,"d6c8":1054,"d6d4":1055,"d7c5":1056,"d7c6":1057,"d7c8":1058,"d7e6":1059,"d7f5":1060,"d8b6":1061,"d8f6":1062,"d8g5":1063,"d8h4":1064,"e1c2":1065,"e2c3":1066,"e3c1":1067,"e3c2":1068,"e3c3":1069,"e3c4":1070,"e3g2":1071,"e4f2":1072,"e4g4":1073,"e5b5":1074,"e5b8":1075,"e5h5":1076,"e6d4":1077,"e6e4":1078,"e6g5":1079,"e6h6":1080,"e7f6":1081,"e7h7":1082,"e8c6":1083,"e8e2":1084,"e8g6":1085,"e8h5":1086,"f2b2":1087,"f2c5":1088,"f2f5":1089,"f3d1":1090,"f4e6":1091,"f5c2":1092,"f5f1":1093,"f5h7":1094,"f7b7":1095,"f7f4":1096,"f7g5":1097,"f8f6":1098,"g2c6":1099,"g2e2":1100,"g2g7":1101,"g3c3":1102,"g3e2":1103,"g3h1":1104,"g4d1":1105,"g4g8":1106,"g5e3":1107,"g5g2":1108,"g6e6":1109,"g7b7":1110,"g7c3":1111,"g7g4":1112,"g8g7":1113,"h2h6":1114,"h3e3":1115,"h3f5":1116,"h3h5":1117,"h4a4":1118,"h4f2":1119,"h4f3":1120,"h4h2":1121,"h5d5":1122,"h5h3":1123,"h6h3":1124,"h7b7":1125,"h7c7":1126,"h7d7":1127,"h7h3":1128,"h8c8":1129,"h8e5":1130,"a1b2":1131,"a1f6":1132,"a1g7":1133,"a2c2":1134,"a2d2":1135,"a3a8":1136,"a3b1":1137,"a3c1":1138,"a3c5":1139,"a4a6":1140,"a4b2":1141,"a4c4":1142,"a4e4":1143,"a5c4":1144,"a5f5":1145,"a5g5":1146,"a6a2":1147,"a6c7":1148,"a6d6":1149,"a6e2":1150,"a6f6":1151,"a7a1":1152,"a7b8":1153,"a8a1":1154,"a8a2":1155,"a8c6":1156,"a8h1":1157,"b1h1":1158,"b2b6":1159,"b2b7":1160,"b2g7":1161,"b3b1":1162,"b3c1":1163,"b4b7":1164,"b4d5":1165,"b4f8":1166,"b5b2":1167,"b5b3":1168,"b5f1":1169,"b5f5":1170,"b6a8":1171,"b6b2":1172,"b6b4":1173,"b6d4":1174,"b6d5":1175,"b6d7":1176,"b6h6":1177,"b7b1":1178,"b7g7":1179,"b7h7":1180,"b8a6":1181,"b8b3":1182,"b8b4":1183,"b8b5":1184,"b8c7":1185,"b8f4":1186,"b8f8":1187,"b8g8":1188,"c1b3":1189,"c1e2":1190,"c2b4":1191,"c3a1":1192,"c3a5":1193,"c3e1":1194,"c3e3":1195,"c3f3":1196,"c3f6":1197,"c3h3":1198,"c4a2":1199,"c4f1":1200,"c4g4":1201,"c4g8":1202,"c5a4":1203,"c5a5":1204,"c5a7":1205,"c5c2":1206,"c5c3":1207,"c5e5":1208,"c6a5":1209,"c6b8":1210,"c6c1":1211,"c6e4":1212,"c6f6":1213,"c6g6":1214,"c7c3":1215,"c7e8":1216,"c7g7":1217,"c8c1":1218,"c8c3":1219,"c8c4":1220,"c8h3":1221,"d1c3":1222,"d1e3":1223,"d3b1":1224,"d3b2":1225,"d3b3":1226,"d3d6":1227,"d3d7":1228,"d3f4":1229,"d3h3":1230,"d4a4":1231,"d4b6":1232,"d4d2":1233,"d4f4":1234,"d4g4":1235,"d4h8":1236,"d5b3":1237,"d5b6":1238,"d5c3":1239,"d5c7":1240,"d5d2":1241,"d5d8":1242,"d5f3":1243,"d6a3":1244,"d6c4":1245,"d6c5":1246,"d6f7":1247,"d7b5":1248,"d7d2":1249,"d7e5":1250,"d7e7":1251,"d7f6":1252,"d7g4":1253,"d8d1":1254,"d8d3":1255,"d8e6":1256,"d8e7":1257,"d8h8":1258,"e1a1":1259,"e1c3":1260,"e1g3":1261,"e1h4":1262,"e2c1":1263,"e3a7":1264,"e3e8":1265,"e3f1":1266,"e3g4":1267,"e4c3":1268,"e5b2":1269,"e5h2":1270,"e6a6":1271,"e6b3":1272,"e6c4":1273,"e6f8":1274,"e7e5":1275,"e7h4":1276,"e8b5":1277,"e8b8":1278,"e8c8":1279,"e8d8":1280,"e8f6":1281,"e8g8":1282,"e8h8":1283,"f1a6":1284,"f2d2":1285,"f2d3":1286,"f2e4":1287,"f3a3":1288,"f3b3":1289,"f4c1":1290,"f4c4":1291,"f4f1":1292,"f5b5":1293,"f5c5":1294,"f5d4":1295,"f5h5":1296,"f6b6":1297,"f6f2":1298,"f6f3":1299,"f6g8":1300,"f6h4":1301,"f6h7":1302,"f7b3":1303,"f7c7":1304,"f7f1":1305,"f7h5":1306,"f8c5":1307,"f8d6":1308,"f8f2":1309,"f8f3":1310,"f8f4":1311,"f8f5":1312,"g1d4":1313,"g1g8":1314,"g2b2":1315,"g2e3":1316,"g2g8":1317,"g3e4":1318,"g3g1":1319,"g4f2":1320,"g4f6":1321,"g4g1":1322,"g5b5":1323,"g5e5":1324,"g5g8":1325,"g5h7":1326,"g6e4":1327,"g6e7":1328,"g6g2":1329,"g7a7":1330,"g7e8":1331,"g7f5":1332,"g7g3":1333,"g7g5":1334,"g8b3":1335,"g8c8":1336,"g8g1":1337,"g8h7":1338,"h1b7":1339,"h1f2":1340,"h2b2":1341,"h2c7":1342,"h2f4":1343,"h3h8":1344,"h4e1":1345,"h4g2":1346,"h4h8":1347,"h5b5":1348,"h5e5":1349,"h5h2":1350,"h6b6":1351,"h6e3":1352,"h6f5":1353,"h6h2":1354,"h7a7":1355,"h7c2":1356,"h7e7":1357,"h7h4":1358,"h8b8":1359,"h8h2":1360,"h8h4":1361,"a1a4":1362,"a1b3":1363,"a1c2":1364,"a2a6":1365,"a2a7":1366,"a2a8":1367,"a2d5":1368,"a2f7":1369,"a2g2":1370,"a3a6":1371,"a3d3":1372,"a3e7":1373,"a3g3":1374,"a4a2":1375,"a4d1":1376,"a5a1":1377,"a5a3":1378,"a5c6":1379,"a6a3":1380,"a6g6":1381,"a7c8":1382,"a7d4":1383,"a7e3":1384,"a7f2":1385,"a7g7":1386,"a8a3":1387,"a8a4":1388,"a8f3":1389,"a8g2":1390,"b1g1":1391,"b1g6":1392,"b2b5":1393,"b2b8":1394,"b2c4":1395,"b2e2":1396,"b3a5":1397,"b3b8":1398,"b3e3":1399,"b3f3":1400,"b3g3":1401,"b3g8":1402,"b4b2":1403,"b4b8":1404,"b4d2":1405,"b4e1":1406,"b5b1":1407,"b5e5":1408,"b5h5":1409,"b6c4":1410,"b6d8":1411,"b6g6":1412,"b7a8q":1413,"b7b2":1414,"b7b3":1415,"b7d6":1416,"b7e7":1417,"b7g2":1418,"b7h1":1419,"b8b2":1420,"b8h2":1421,"c1a2":1422,"c1h1":1423,"c2a3":1424,"c2e1":1425,"c3c5":1426,"c3g3":1427,"c4b2":1428,"c4c1":1429,"c4f4":1430,"c5a3":1431,"c5d3":1432,"c5e7":1433,"c5f2":1434,"c5f8":1435,"c5g5":1436,"c6f3":1437,"c6h6":1438,"c7a5":1439,"c7a6":1440,"c7c1":1441,"c7c5":1442,"c8a7":1443,"c8b6":1444,"c8b7":1445,"c8d6":1446,"c8e6":1447,"d1b2":1448,"d1f2":1449,"d2a2":1450,"d3c1":1451,"d3e1":1452,"d3f2":1453,"d4a1":1454,"d4f2":1455,"d5e7":1456,"d5g5":1457,"d5g8":1458,"d6d1":1459,"d6d3":1460,"d6e8":1461,"d6f4":1462,"d6g6":1463,"d6h2":1464,"d6h6":1465,"d7b8":1466,"d7d3":1467,"d7e8":1468,"d7f8":1469,"e1a5":1470,"e1b4":1471,"e2g1":1472,"e3a3":1473,"e3e1":1474,"e3g1":1475,"e4a4":1476,"e4b1":1477,"e4h1":1478,"e6c5":1479,"e6d8":1480,"e6e1":1481,"e6e2":1482,"e6f4":1483,"e6g8":1484,"e7b4":1485,"e7c5":1486,"e7c8":1487,"e7d8q":1488,"e7e1":1489,"e7e3":1490,"e7e4":1491,"e7f8":1492,"e7f8q":1493,"e7g6":1494,"e7g8":1495,"e8c7":1496,"e8e1":1497,"e8e3":1498,"e8e4":1499,"f2a2":1500,"f2f8":1501,"f2g4":1502,"f3f8":1503,"f3h1":1504,"f4a4":1505,"f4b4":1506,"f4b8":1507,"f4e2":1508,"f4f8":1509,"f4g6":1510,"f4h5":1511,"f5d7":1512,"f5f2":1513,"f5h4":1514,"f5h6":1515,"f6a6":1516,"f6b2":1517,"f6c3":1518,"f6c6":1519,"f6e4":1520,"f6e8":1521,"f6f4":1522,"f6g4":1523,"f6h5":1524,"f6h6":1525,"f7c4":1526,"f7d6":1527,"f7f2":1528,"f7f3":1529,"f7g6":1530,"f7g8":1531,"f8a3":1532,"f8a8":1533,"f8b8":1534,"f8c8":1535,"f8d8":1536,"f8f1":1537,"f8g6":1538,"f8g7":1539,"g1a1":1540,"g1a7":1541,"g1c5":1542,"g1e3":1543,"g2a2":1544,"g2a8":1545,"g2e1":1546,"g2h4":1547,"g3b3":1548,"g3d3":1549,"g3g8":1550,"g3h5":1551,"g4b4":1552,"g4e3":1553,"g4h2":1554,"g5d2":1555,"g5h3":1556,"g6c6":1557,"g6f4":1558,"g6h4":1559,"g7b2":1560,"g7e7":1561,"g7f8q":1562,"g7g1":1563,"g8a8":1564,"g8b8":1565,"g8c4":1566,"g8d5":1567,"g8e6":1568,"g8f6":1569,"g8g2":1570,"g8g5":1571,"g8h6":1572,"h1a8":1573,"h1g3":1574,"h2b8":1575,"h2d2":1576,"h2d6":1577,"h2e2":1578,"h3d7":1579,"h3f1":1580,"h3f4":1581,"h4c4":1582,"h4h1":1583,"h5g3":1584,"h6d2":1585,"h7e4":1586,"h7f6":1587,"h7f8":1588,"h7g8":1589,"h8a8":1590,"h8c3":1591,"h8d4":1592,"h8h1":1593,"h8h3":1594},"index_to_move":{"0":"d2d4","1":"g1f3","2":"e2e3","3":"c1f4","4":"c2c3","5":"f1d3","6":"b1d2","7":"f3e5","8":"e1g1","9":"e1c1","10":"h2h3","11":"f4g3","12":"d4e5","13":"e3d4","14":"e3e4","15":"a2a3","16":"f4e5","17":"f2f4","18":"d1e2","19":"g2g4","20":"h2h4","21":"b1c3","22":"d2e4","23":"d2f3","24":"g2g3","25":"f2f3","26":"h4h5","27":"f1e2","28":"c3c4","29":"d1c2","30":"h2g3","31":"b2b3","32":"d1f3","33":"f1e1","34":"g4g5","35":"c1b1","36":"a2a4","37":"a1b1","38":"d1d2","39":"d3c2","40":"c2c4","41":"d3e4","42":"f3d4","43":"b2b4","44":"h3h4","45":"d4c5","46":"f1d1","47":"d4d5","48":"g3g4","49":"a4a5","50":"f4g5","51":"a1c1","52":"g1g2","53":"h1g1","54":"c1c2","55":"e2f3","56":"e5f6","57":"g2f3","58":"e4e5","59":"a1d1","60":"b4b5","61":"e2d3","62":"f3e4","63":"b2c3","64":"f3f4","65":"f4f5","66":"g1h2","67":"e1e2","68":"g3h4","69":"g5f6","70":"d1e1","71":"c4c5","72":"c4d5","73":"h5h6","74":"d3e2","75":"h5g6","76":"e4d5","77":"g1f1","78":"c1d2","79":"c3d4","80":"d1d3","81":"d3c4","82":"a3a4","83":"e3f4","84":"a5a6","85":"d3f5","86":"f3d2","87":"e2e4","88":"d1c1","89":"e2d2","90":"d3g6","91":"b3b4","92":"c1b2","93":"c1g5","94":"d2c4","95":"f3g4","96":"g3f4","97":"g4f5","98":"c2d3","99":"f3g5","100":"a6a7","101":"b5b6","102":"c2d2","103":"d1f1","104":"d2d3","105":"e5e6","106":"f2e3","107":"f1g2","108":"c2e4","109":"e1d1","110":"f2g3","111":"g1h1","112":"h4g5","113":"d1d8","114":"g5g6","115":"a1e1","116":"d1d4","117":"c2b3","118":"c5c6","119":"e5c6","120":"e5d6","121":"d1h1","122":"e2f2","123":"c3e4","124":"d2e2","125":"f4d6","126":"f3e2","127":"g1f2","128":"b5c6","129":"c3b4","130":"e5g7","131":"a3b4","132":"d2c2","133":"b2a3","134":"g3e5","135":"b1a1","136":"d1g1","137":"d2b3","138":"h1d1","139":"b6b7","140":"e6e7","141":"g5h4","142":"h6h7","143":"d2c3","144":"h1e1","145":"c1e3","146":"f1c1","147":"g6g7","148":"e5d7","149":"h1f1","150":"h4g3","151":"e2g4","152":"f1b5","153":"f5f6","154":"b1c1","155":"c4b5","156":"d5d6","157":"e1d2","158":"d1b3","159":"d1h5","160":"h1h2","161":"h3g4","162":"a7a8q","163":"d1d5","164":"f1g1","165":"c1d1","166":"d3b5","167":"d3h7","168":"h1h7","169":"b1a3","170":"d6d7","171":"f6f7","172":"c6c7","173":"d1g4","174":"f1f2","175":"g5h6","176":"d1d7","177":"d3d4","178":"f3g3","179":"g3d6","180":"c3d5","181":"e2c4","182":"e2h5","183":"f3e3","184":"g4h5","185":"e2f1","186":"f2e2","187":"f3h4","188":"b1c2","189":"b3a4","190":"b3c4","191":"b4c5","192":"c3b5","193":"d2e3","194":"d5e6","195":"f1c4","196":"h2g1","197":"h2g2","198":"a2b3","199":"c2b2","200":"c2f5","201":"e1e8","202":"e2e5","203":"a4b5","204":"c3b3","205":"e4d3","206":"e4f5","207":"e4f6","208":"f4e3","209":"g2f2","210":"g2h3","211":"g3f2","212":"b1b2","213":"c4b3","214":"c1c3","215":"e5g3","216":"e5g6","217":"e7e8q","218":"h1h6","219":"c2d1","220":"c5d6","221":"d1d6","222":"d2e1","223":"d3a6","224":"d3d2","225":"e3d2","226":"e4d6","227":"g2h2","228":"h1h5","229":"h6g7","230":"a7a8","231":"b3c2","232":"c1c7","233":"d2f1","234":"d4c6","235":"b7a7","236":"b7b8q","237":"c1c6","238":"c2c1","239":"d1b1","240":"e1e6","241":"e1e7","242":"e1f1","243":"e2b5","244":"e3e2","245":"f2g2","246":"f3d5","247":"f4h6","248":"g2f1","249":"h4f6","250":"c3e2","251":"c4d3","252":"d3c3","253":"e4f3","254":"e5f3","255":"f3e1","256":"g3h2","257":"g4f3","258":"h7g6","259":"d3e3","260":"e1e3","261":"e1e5","262":"e2d1","263":"f1f3","264":"f3h2","265":"g4f4","266":"h7h8","267":"a1f1","268":"b1b7","269":"b1d1","270":"b3c3","271":"c1c8","272":"d5c6","273":"e3f3","274":"f3h5","275":"a3b5","276":"b4c3","277":"e2c2","278":"f1f8","279":"f7f8q","280":"g3f3","281":"h4e7","282":"b5c7","283":"b5d7","284":"c2b1","285":"c2g6","286":"c5b6","287":"d2c1","288":"d2f4","289":"d7b7","290":"e1f2","291":"e2e1","292":"f3h3","293":"f5e6","294":"g2g1","295":"g5f7","296":"h1h8","297":"h2h1","298":"h5g4","299":"h5h7","300":"a8a7","301":"b2c2","302":"b3d4","303":"c2a4","304":"c2e2","305":"c3d3","306":"c7b7","307":"d1a1","308":"d5c5","309":"d5e5","310":"f1f7","311":"f3g2","312":"f5e4","313":"f5g4","314":"f5g6","315":"g3h3","316":"g4h4","317":"h1c1","318":"h3g3","319":"h6g5","320":"a5b6","321":"b5a5","322":"b7b8","323":"c3a4","324":"c4b4","325":"e1e4","326":"e3d3","327":"e4b7","328":"e4f4","329":"e5f7","330":"f1h1","331":"f6e6","332":"g1g6","333":"g5e7","334":"g7h7","335":"h1h3","336":"h5g5","337":"h7h6","338":"a1g1","339":"b4c4","340":"c4e5","341":"c6b7","342":"c7c8q","343":"d1a4","344":"d4c3","345":"d4f3","346":"d4f5","347":"d6d5","348":"d7c7","349":"e2a6","350":"e2e6","351":"e2h2","352":"e5g4","353":"f1e3","354":"f1f4","355":"f4c7","356":"f4f3","357":"g1e1","358":"g1g7","359":"g4h3","360":"g6f6","361":"g6f7","362":"h5h4","363":"a3c2","364":"a6b7","365":"b1e1","366":"b7b6","367":"c1c4","368":"c3d2","369":"c7a7","370":"c8c7","371":"d5d7","372":"d6c6","373":"d7d6","374":"e4c6","375":"e4d4","376":"e4e2","377":"e6d6","378":"e6d7","379":"f3f6","380":"f5e5","381":"g3c7","382":"g5d8","383":"g6h7","384":"g7f6","385":"h3g2","386":"h4h3","387":"h6h5","388":"h7h8q","389":"a1a2","390":"a4b4","391":"a7a6","392":"a8h8","393":"b3d2","394":"b4a4","395":"b5a4","396":"b7c7","397":"c2h7","398":"d4b5","399":"d4e6","400":"d5c4","401":"e2f4","402":"e4a8","403":"e4c5","404":"e5c7","405":"e5d4","406":"f2g1","407":"f3b7","408":"f3f7","409":"f4g4","410":"f5f4","411":"f5f7","412":"f6d8","413":"f7e6","414":"f7g7","415":"g1g5","416":"g2e4","417":"g2g6","418":"g5e6","419":"g5f4","420":"g5h5","421":"g6h6","422":"g7g8q","423":"h7d3","424":"a4a3","425":"a4b3","426":"b2d4","427":"b3a3","428":"b3b6","429":"b4a5","430":"b7a6","431":"c4c3","432":"c4d6","433":"c6d6","434":"d4e4","435":"d7d8","436":"d7d8q","437":"e1d3","438":"e1h1","439":"e2d4","440":"e2g2","441":"e3d5","442":"e4g6","443":"e5d5","444":"e5e7","445":"e5f4","446":"e6d5","447":"f1b1","448":"f3f2","449":"f7f6","450":"g4e6","451":"h1h4","452":"h3f3","453":"h6g6","454":"a1a6","455":"a1a7","456":"a7a5","457":"a7b7","458":"b1a2","459":"b1f1","460":"b2c1","461":"b2e5","462":"b3d5","463":"b8b7","464":"c6a6","465":"c7c8","466":"d2d1","467":"d2d5","468":"d2d8","469":"d4c4","470":"d4d1","471":"d4e3","472":"d4f6","473":"d8d7","474":"e4e3","475":"e4e7","476":"e5g5","477":"e6f7","478":"f1f6","479":"f3c6","480":"f4d2","481":"f5d3","482":"f5g5","483":"f7e7","484":"f8e8","485":"g1g3","486":"g2b7","487":"g7f7","488":"h4f4","489":"h4g4","490":"h8g7","491":"h8h7","492":"a4a7","493":"a5b5","494":"a6b5","495":"b1b3","496":"b1b6","497":"b3c5","498":"b5a3","499":"b5c4","500":"b5d6","501":"b6a6","502":"c1a1","503":"c3b2","504":"c4d4","505":"c5b5","506":"c5d5","507":"c6c8","508":"c7c6","509":"c7g3","510":"c8b8","511":"d2b2","512":"d4b3","513":"d8e8","514":"e1b1","515":"e2e7","516":"e4g5","517":"e5c4","518":"e5e4","519":"e6e5","520":"e7g7","521":"e8e7","522":"e8f7","523":"f1d2","524":"f1f5","525":"f2f1","526":"f4e4","527":"f4f6","528":"f5c8","529":"f5e7","530":"f6e7","531":"f7f8","532":"g1d1","533":"g4c8","534":"g4g7","535":"g5f3","536":"g5f5","537":"g6h5","538":"g7e5","539":"g7g8","540":"h3h2","541":"h3h6","542":"h4h7","543":"h5e2","544":"h5h8","545":"h6h8","546":"h7f5","547":"a1a8","548":"a5a7","549":"a6a5","550":"a8d8","551":"b2a2","552":"b4a3","553":"b5b7","554":"b5e8","555":"b7f7","556":"b8e5","557":"c1c5","558":"c2c6","559":"c2c7","560":"c2e3","561":"c3c2","562":"c4e2","563":"c4e3","564":"c5d4","565":"c7a8","566":"c7f7","567":"d2d6","568":"d3f3","569":"d4e2","570":"d5e4","571":"d6e5","572":"d7a7","573":"e1f3","574":"e2g3","575":"e3b6","576":"e3c5","577":"e3g5","578":"e3h6","579":"e4g2","580":"e5f5","581":"e6c6","582":"e6f5","583":"e7e8","584":"e7f7","585":"e8f8","586":"f3f5","587":"f4f7","588":"f4h4","589":"f6e5","590":"f6f5","591":"f6g5","592":"g1e2","593":"g1g4","594":"g3f5","595":"g3g2","596":"g3g6","597":"g4g3","598":"g4g6","599":"g5g4","600":"g6d3","601":"g6g5","602":"h8f6","603":"a3b3","604":"a4c6","605":"a6b4","606":"a7d7","607":"a8b7","608":"a8b8","609":"b2f6","610":"b5a6","611":"b5b4","612":"b5d3","613":"b7f3","614":"c1e1","615":"c2c8","616":"c3e5","617":"c4c6","618":"c4c7","619":"c5b4","620":"c5c4","621":"c5d7","622":"c6c5","623":"c6e5","624":"c7d6","625":"c8a8","626":"d2d7","627":"d2g5","628":"d6b4","629":"d6c7","630":"d6e6","631":"d6e7","632":"d6g3","633":"e4c2","634":"e4d2","635":"e4e6","636":"e4h7","637":"e5c3","638":"e5c5","639":"e6f6","640":"e8e6","641":"f1a1","642":"f2e1","643":"f7e8","644":"f7f5","645":"g3b8","646":"g4e2","647":"g4e4","648":"g6e5","649":"g6f5","650":"h1a1","651":"h1g2","652":"h4d8","653":"h5f5","654":"h7f7","655":"h7g7","656":"h7h5","657":"h8f8","658":"h8h6","659":"a1a3","660":"a2b2","661":"a3c4","662":"a5c5","663":"a7c5","664":"a7c7","665":"a8a5","666":"a8e4","667":"b1b4","668":"b1b8","669":"b3e6","670":"b4b3","671":"b5c3","672":"b6b5","673":"b6c6","674":"b6e6","675":"b7b5","676":"b7c8","677":"b8c8","678":"c2c5","679":"c3c8","680":"c4e6","681":"c6b5","682":"c6d5","683":"c6d7","684":"c8d7","685":"d2b1","686":"d3d5","687":"d3e5","688":"d3f1","689":"d3g3","690":"d4d6","691":"d4d7","692":"d5d4","693":"d5e3","694":"d5f6","695":"d6a6","696":"d6d8","697":"d6e4","698":"d6f8","699":"d7f7","700":"d7g7","701":"d7h7","702":"d8d4","703":"e2b2","704":"e2e8","705":"e3g3","706":"e3h3","707":"e4b4","708":"e4c4","709":"e4g3","710":"e5d3","711":"e5e2","712":"e6g6","713":"e7a7","714":"e7c7","715":"e7d6","716":"e7d8","717":"e7e6","718":"e8a8","719":"e8d7","720":"e8e5","721":"f2d4","722":"f2f6","723":"f3d3","724":"f3g1","725":"f4h2","726":"f5d5","727":"f5e3","728":"f6d4","729":"f6g7","730":"f8h8","731":"g1b1","732":"g1c1","733":"g5e4","734":"g6g4","735":"g7d7","736":"g7g6","737":"h2f2","738":"h2h7","739":"h3h7","740":"h4f5","741":"h5f7","742":"h6d6","743":"h8d8","744":"h8g8","745":"a1h1","746":"a2a1","747":"a3a7","748":"a3b2","749":"a4c5","750":"a4d7","751":"a5a4","752":"a5b4","753":"a6a1","754":"a6c4","755":"a6c6","756":"a6e6","757":"a7a4","758":"a7b6","759":"a8c8","760":"a8d5","761":"a8e8","762":"b2b1","763":"b2d3","764":"b3a2","765":"b3b7","766":"b4d4","767":"b4e7","768":"b6c5","769":"b7c6","770":"b7d5","771":"b7d7","772":"b8a8","773":"b8b6","774":"c2f2","775":"c3c1","776":"c4b6","777":"c4c2","778":"c4d2","779":"c4f7","780":"c5c8","781":"c6b6","782":"c6c4","783":"c6e6","784":"c7b5","785":"c7b8","786":"c7d7","787":"c8d8","788":"c8f5","789":"c8h8","790":"d2b4","791":"d2g2","792":"d2h6","793":"d3d1","794":"d5b5","795":"d5b7","796":"d5f5","797":"d5f7","798":"d5h5","799":"d6b6","800":"d6b7","801":"d8a8","802":"d8d6","803":"e3e5","804":"e3e6","805":"e3f2","806":"e3f5","807":"e4e1","808":"e4e8","809":"e5e3","810":"e6e8","811":"e7d7","812":"e7f5","813":"f1g3","814":"f3a8","815":"f4f2","816":"f5f3","817":"f6g6","818":"f7d7","819":"f8b4","820":"f8g8","821":"g2g5","822":"g3e1","823":"g3e3","824":"g4d7","825":"g4g2","826":"g5g7","827":"g6c2","828":"g6e8","829":"g7f8","830":"g7h6","831":"g7h8","832":"g8f7","833":"g8f8","834":"g8g6","835":"g8h8","836":"h1b1","837":"h2e5","838":"h2f1","839":"h2g4","840":"h2h5","841":"h4g6","842":"h5e8","843":"h5f3","844":"h6f6","845":"h6h4","846":"h8e8","847":"a1a5","848":"a2b1","849":"a3a2","850":"a3d6","851":"a4a8","852":"a4b6","853":"a5c3","854":"a6b6","855":"a6c8","856":"a7a3","857":"a8f8","858":"a8g8","859":"b2d2","860":"b3b2","861":"b3d3","862":"b4c6","863":"b4d3","864":"b4f4","865":"b5e2","866":"b6a7","867":"b6b8","868":"b6c7","869":"b7a8","870":"b7c5","871":"b7e4","872":"c1a3","873":"c1f1","874":"c1g1","875":"c2a2","876":"c2d4","877":"c3b1","878":"c3c6","879":"c3c7","880":"c3d1","881":"c4a3","882":"c4a6","883":"c4h4","884":"c5b3","885":"c5b7","886":"c6a7","887":"c6b4","888":"c6d4","889":"c6d8","890":"c6e7","891":"c7b6","892":"c7d5","893":"c7e5","894":"c7e7","895":"c7f4","896":"c7h7","897":"c8c6","898":"c8e8","899":"c8f8","900":"c8g4","901":"c8g8","902":"d2a5","903":"d2f2","904":"d2h2","905":"d3b4","906":"d3d8","907":"d4a7","908":"d4b2","909":"d4b4","910":"d4c2","911":"d4d3","912":"d4d8","913":"d4g7","914":"d4h4","915":"d5f4","916":"d6d2","917":"d6f5","918":"d6f6","919":"d7d5","920":"d7h3","921":"d8b8","922":"d8c7","923":"d8c8","924":"d8d5","925":"d8f8","926":"e4h4","927":"e5e8","928":"e5h8","929":"e6b6","930":"e6c7","931":"e6c8","932":"e6g4","933":"e7b7","934":"e7d5","935":"e7e2","936":"f1h2","937":"f1h3","938":"f2c2","939":"f2f7","940":"f2h2","941":"f2h4","942":"f3c3","943":"f4d5","944":"f5d6","945":"f5g3","946":"f5g7","947":"f6d5","948":"f6d6","949":"f6f8","950":"f7a7","951":"f7d5","952":"f7d8","953":"f7h7","954":"f7h8","955":"f8e7","956":"f8f7","957":"g2c2","958":"g2d2","959":"g2d5","960":"g2h1","961":"g3f1","962":"g3g5","963":"g3g7","964":"g4e5","965":"g5g3","966":"g6d6","967":"g6f8","968":"g6g8","969":"g7c7","970":"g7g2","971":"g8d8","972":"h2f3","973":"h2h8","974":"h3e6","975":"h4h6","976":"h6e6","977":"h6f4","978":"h6f8","979":"a3a5","980":"a3c3","981":"a4c2","982":"a4c3","983":"a4d4","984":"a4g4","985":"a4h4","986":"a5a8","987":"a5d5","988":"a6a4","989":"a6a8","990":"a6d3","991":"a6f1","992":"a7b5","993":"a7c6","994":"a7e7","995":"a7f7","996":"a7h7","997":"a8a6","998":"a8b6","999":"a8c7","1000":"b1b5","1001":"b1d3","1002":"b1e4","1003":"b1f5","1004":"b2a1","1005":"b3d1","1006":"b3f7","1007":"b4a6","1008":"b4b6","1009":"b4d6","1010":"b4g4","1011":"b5a7","1012":"b5b8","1013":"b5c5","1014":"b5d4","1015":"b5d5","1016":"b6a5","1017":"b6b3","1018":"b6d6","1019":"b6e3","1020":"b7b4","1021":"b8b1","1022":"b8d6","1023":"b8d8","1024":"b8g3","1025":"b8h8","1026":"c1h6","1027":"c2g2","1028":"c3a3","1029":"c3g7","1030":"c4a4","1031":"c4a5","1032":"c4c8","1033":"c4e4","1034":"c5a6","1035":"c5c7","1036":"c5e3","1037":"c5e4","1038":"c5e6","1039":"c5f5","1040":"c6c2","1041":"c6c3","1042":"c6e8","1043":"c7d8","1044":"c8a6","1045":"c8c5","1046":"d3c5","1047":"d5a5","1048":"d5a8","1049":"d5b4","1050":"d5d1","1051":"d5d3","1052":"d5g2","1053":"d6b8","1054":"d6c8","1055":"d6d4","1056":"d7c5","1057":"d7c6","1058":"d7c8","1059":"d7e6","1060":"d7f5","1061":"d8b6","1062":"d8f6","1063":"d8g5","1064":"d8h4","1065":"e1c2","1066":"e2c3","1067":"e3c1","1068":"e3c2","1069":"e3c3","1070":"e3c4","1071":"e3g2","1072":"e4f2","1073":"e4g4","1074":"e5b5","1075":"e5b8","1076":"e5h5","1077":"e6d4","1078":"e6e4","1079":"e6g5","1080":"e6h6","1081":"e7f6","1082":"e7h7","1083":"e8c6","1084":"e8e2","1085":"e8g6","1086":"e8h5","1087":"f2b2","1088":"f2c5","1089":"f2f5","1090":"f3d1","1091":"f4e6","1092":"f5c2","1093":"f5f1","1094":"f5h7","1095":"f7b7","1096":"f7f4","1097":"f7g5","1098":"f8f6","1099":"g2c6","1100":"g2e2","1101":"g2g7","1102":"g3c3","1103":"g3e2","1104":"g3h1","1105":"g4d1","1106":"g4g8","1107":"g5e3","1108":"g5g2","1109":"g6e6","1110":"g7b7","1111":"g7c3","1112":"g7g4","1113":"g8g7","1114":"h2h6","1115":"h3e3","1116":"h3f5","1117":"h3h5","1118":"h4a4","1119":"h4f2","1120":"h4f3","1121":"h4h2","1122":"h5d5","1123":"h5h3","1124":"h6h3","1125":"h7b7","1126":"h7c7","1127":"h7d7","1128":"h7h3","1129":"h8c8","1130":"h8e5","1131":"a1b2","1132":"a1f6","1133":"a1g7","1134":"a2c2","1135":"a2d2","1136":"a3a8","1137":"a3b1","1138":"a3c1","1139":"a3c5","1140":"a4a6","1141":"a4b2","1142":"a4c4","1143":"a4e4","1144":"a5c4","1145":"a5f5","1146":"a5g5","1147":"a6a2","1148":"a6c7","1149":"a6d6","1150":"a6e2","1151":"a6f6","1152":"a7a1","1153":"a7b8","1154":"a8a1","1155":"a8a2","1156":"a8c6","1157":"a8h1","1158":"b1h1","1159":"b2b6","1160":"b2b7","1161":"b2g7","1162":"b3b1","1163":"b3c1","1164":"b4b7","1165":"b4d5","1166":"b4f8","1167":"b5b2","1168":"b5b3","1169":"b5f1","1170":"b5f5","1171":"b6a8","1172":"b6b2","1173":"b6b4","1174":"b6d4","1175":"b6d5","1176":"b6d7","1177":"b6h6","1178":"b7b1","1179":"b7g7","1180":"b7h7","1181":"b8a6","1182":"b8b3","1183":"b8b4","1184":"b8b5","1185":"b8c7","1186":"b8f4","1187":"b8f8","1188":"b8g8","1189":"c1b3","1190":"c1e2","1191":"c2b4","1192":"c3a1","1193":"c3a5","1194":"c3e1","1195":"c3e3","1196":"c3f3","1197":"c3f6","1198":"c3h3","1199":"c4a2","1200":"c4f1","1201":"c4g4","1202":"c4g8","1203":"c5a4","1204":"c5a5","1205":"c5a7","1206":"c5c2","1207":"c5c3","1208":"c5e5","1209":"c6a5","1210":"c6b8","1211":"c6c1","1212":"c6e4","1213":"c6f6","1214":"c6g6","1215":"c7c3","1216":"c7e8","1217":"c7g7","1218":"c8c1","1219":"c8c3","1220":"c8c4","1221":"c8h3","1222":"d1c3","1223":"d1e3","1224":"d3b1","1225":"d3b2","1226":"d3b3","1227":"d3d6","1228":"d3d7","1229":"d3f4","1230":"d3h3","1231":"d4a4","1232":"d4b6","1233":"d4d2","1234":"d4f4","1235":"d4g4","1236":"d4h8","1237":"d5b3","1238":"d5b6","1239":"d5c3","1240":"d5c7","1241":"d5d2","1242":"d5d8","1243":"d5f3","1244":"d6a3","1245":"d6c4","1246":"d6c5","1247":"d6f7","1248":"d7b5","1249":"d7d2","1250":"d7e5","1251":"d7e7","1252":"d7f6","1253":"d7g4","1254":"d8d1","1255":"d8d3","1256":"d8e6","1257":"d8e7","1258":"d8h8","1259":"e1a1","1260":"e1c3","1261":"e1g3","1262":"e1h4","1263":"e2c1","1264":"e3a7","1265":"e3e8","1266":"e3f1","1267":"e3g4","1268":"e4c3","1269":"e5b2","1270":"e5h2","1271":"e6a6","1272":"e6b3","1273":"e6c4","1274":"e6f8","1275":"e7e5","1276":"e7h4","1277":"e8b5","1278":"e8b8","1279":"e8c8","1280":"e8d8","1281":"e8f6","1282":"e8g8","1283":"e8h8","1284":"f1a6","1285":"f2d2","1286":"f2d3","1287":"f2e4","1288":"f3a3","1289":"f3b3","1290":"f4c1","1291":"f4c4","1292":"f4f1","1293":"f5b5","1294":"f5c5","1295":"f5d4","1296":"f5h5","1297":"f6b6","1298":"f6f2","1299":"f6f3","1300":"f6g8","1301":"f6h4","1302":"f6h7","1303":"f7b3","1304":"f7c7","1305":"f7f1","1306":"f7h5","1307":"f8c5","1308":"f8d6","1309":"f8f2","1310":"f8f3","1311":"f8f4","1312":"f8f5","1313":"g1d4","1314":"g1g8","1315":"g2b2","1316":"g2e3","1317":"g2g8","1318":"g3e4","1319":"g3g1","1320":"g4f2","1321":"g4f6","1322":"g4g1","1323":"g5b5","1324":"g5e5","1325":"g5g8","1326":"g5h7","1327":"g6e4","1328":"g6e7","1329":"g6g2","1330":"g7a7","1331":"g7e8","1332":"g7f5","1333":"g7g3","1334":"g7g5","1335":"g8b3","1336":"g8c8","1337":"g8g1","1338":"g8h7","1339":"h1b7","1340":"h1f2","1341":"h2b2","1342":"h2c7","1343":"h2f4","1344":"h3h8","1345":"h4e1","1346":"h4g2","1347":"h4h8","1348":"h5b5","1349":"h5e5","1350":"h5h2","1351":"h6b6","1352":"h6e3","1353":"h6f5","1354":"h6h2","1355":"h7a7","1356":"h7c2","1357":"h7e7","1358":"h7h4","1359":"h8b8","1360":"h8h2","1361":"h8h4","1362":"a1a4","1363":"a1b3","1364":"a1c2","1365":"a2a6","1366":"a2a7","1367":"a2a8","1368":"a2d5","1369":"a2f7","1370":"a2g2","1371":"a3a6","1372":"a3d3","1373":"a3e7","1374":"a3g3","1375":"a4a2","1376":"a4d1","1377":"a5a1","1378":"a5a3","1379":"a5c6","1380":"a6a3","1381":"a6g6","1382":"a7c8","1383":"a7d4","1384":"a7e3","1385":"a7f2","1386":"a7g7","1387":"a8a3","1388":"a8a4","1389":"a8f3","1390":"a8g2","1391":"b1g1","1392":"b1g6","1393":"b2b5","1394":"b2b8","1395":"b2c4","1396":"b2e2","1397":"b3a5","1398":"b3b8","1399":"b3e3","1400":"b3f3","1401":"b3g3","1402":"b3g8","1403":"b4b2","1404":"b4b8","1405":"b4d2","1406":"b4e1","1407":"b5b1","1408":"b5e5","1409":"b5h5","1410":"b6c4","1411":"b6d8","1412":"b6g6","1413":"b7a8q","1414":"b7b2","1415":"b7b3","1416":"b7d6","1417":"b7e7","1418":"b7g2","1419":"b7h1","1420":"b8b2","1421":"b8h2","1422":"c1a2","1423":"c1h1","1424":"c2a3","1425":"c2e1","1426":"c3c5","1427":"c3g3","1428":"c4b2","1429":"c4c1","1430":"c4f4","1431":"c5a3","1432":"c5d3","1433":"c5e7","1434":"c5f2","1435":"c5f8","1436":"c5g5","1437":"c6f3","1438":"c6h6","1439":"c7a5","1440":"c7a6","1441":"c7c1","1442":"c7c5","1443":"c8a7","1444":"c8b6","1445":"c8b7","1446":"c8d6","1447":"c8e6","1448":"d1b2","1449":"d1f2","1450":"d2a2","1451":"d3c1","1452":"d3e1","1453":"d3f2","1454":"d4a1","1455":"d4f2","1456":"d5e7","1457":"d5g5","1458":"d5g8","1459":"d6d1","1460":"d6d3","1461":"d6e8","1462":"d6f4","1463":"d6g6","1464":"d6h2","1465":"d6h6","1466":"d7b8","1467":"d7d3","1468":"d7e8","1469":"d7f8","1470":"e1a5","1471":"e1b4","1472":"e2g1","1473":"e3a3","1474":"e3e1","1475":"e3g1","1476":"e4a4","1477":"e4b1","1478":"e4h1","1479":"e6c5","1480":"e6d8","1481":"e6e1","1482":"e6e2","1483":"e6f4","1484":"e6g8","1485":"e7b4","1486":"e7c5","1487":"e7c8","1488":"e7d8q","1489":"e7e1","1490":"e7e3","1491":"e7e4","1492":"e7f8","1493":"e7f8q","1494":"e7g6","1495":"e7g8","1496":"e8c7","1497":"e8e1","1498":"e8e3","1499":"e8e4","1500":"f2a2","1501":"f2f8","1502":"f2g4","1503":"f3f8","1504":"f3h1","1505":"f4a4","1506":"f4b4","1507":"f4b8","1508":"f4e2","1509":"f4f8","1510":"f4g6","1511":"f4h5","1512":"f5d7","1513":"f5f2","1514":"f5h4","1515":"f5h6","1516":"f6a6","1517":"f6b2","1518":"f6c3","1519":"f6c6","1520":"f6e4","1521":"f6e8","1522":"f6f4","1523":"f6g4","1524":"f6h5","1525":"f6h6","1526":"f7c4","1527":"f7d6","1528":"f7f2","1529":"f7f3","1530":"f7g6","1531":"f7g8","1532":"f8a3","1533":"f8a8","1534":"f8b8","1535":"f8c8","1536":"f8d8","1537":"f8f1","1538":"f8g6","1539":"f8g7","1540":"g1a1","1541":"g1a7","1542":"g1c5","1543":"g1e3","1544":"g2a2","1545":"g2a8","1546":"g2e1","1547":"g2h4","1548":"g3b3","1549":"g3d3","1550":"g3g8","1551":"g3h5","1552":"g4b4","1553":"g4e3","1554":"g4h2","1555":"g5d2","1556":"g5h3","1557":"g6c6","1558":"g6f4","1559":"g6h4","1560":"g7b2","1561":"g7e7","1562":"g7f8q","1563":"g7g1","1564":"g8a8","1565":"g8b8","1566":"g8c4","1567":"g8d5","1568":"g8e6","1569":"g8f6","1570":"g8g2","1571":"g8g5","1572":"g8h6","1573":"h1a8","1574":"h1g3","1575":"h2b8","1576":"h2d2","1577":"h2d6","1578":"h2e2","1579":"h3d7","1580":"h3f1","1581":"h3f4","1582":"h4c4","1583":"h4h1","1584":"h5g3","1585":"h6d2","1586":"h7e4","1587":"h7f6","1588":"h7f8","1589":"h7g8","1590":"h8a8","1591":"h8c3","1592":"h8d4","1593":"h8h1","1594":"h8h3"},"vocab_size":1595,"top_moves":[["d2d4",788],["g1f3",772],["e2e3",760],["c1f4",624],["c2c3",612],["f1d3",551],["b1d2",538],["f3e5",517],["e1g1",365],["e1c1",312],["h2h3",306],["f4g3",295],["d4e5",291],["e3d4",256],["e3e4",247],["a2a3",243],["f4e5",237],["f2f4",236],["d1e2",218],["g2g4",208],["h2h4",199],["b1c3",197],["d2e4",193],["d2f3",192],["g2g3",192],["f2f3",184],["h4h5",171],["f1e2",168],["c3c4",164],["d1c2",163],["h2g3",161],["b2b3",159],["d1f3",137],["f1e1",137],["g4g5",137],["c1b1",131],["a2a4",126],["a1b1",122],["d1d2",119],["d3c2",116],["c2c4",115],["d3e4",112],["f3d4",111],["b2b4",110],["h3h4",110],["d4c5",105],["f1d1",105],["d4d5",104],["g3g4",104],["a4a5",102],["f4g5",102],["a1c1",101],["g1g2",100],["h1g1",100],["c1c2",97],["e2f3",97],["e5f6",94],["g2f3",94],["e4e5",93],["a1d1",90],["b4b5",89],["e2d3",89],["f3e4",89],["b2c3",87],["f3f4",87],["f4f5",87],["g1h2",85],["e1e2",84],["g3h4",84],["g5f6",81],["d1e1",78],["c4c5",77],["c4d5",76],["h5h6",76],["d3e2",75],["h5g6",75],["e4d5",74],["g1f1",74],["c1d2",73],["c3d4",72],["d1d3",72],["d3c4",71],["a3a4",70],["e3f4",70],["a5a6",68],["d3f5",68],["f3d2",68],["e2e4",66],["d1c1",65],["e2d2",65],["d3g6",63],["b3b4",62],["c1b2",61],["c1g5",61],["d2c4",61],["f3g4",61],["g3f4",61],["g4f5",61],["c2d3",60],["f3g5",60]]}