{"move_to_index":{"g8f6":0,"d7d6":1,"g7g6":2,"c7c5":3,"e8g8":4,"f8g7":5,"b8c6":6,"c5d4":7,"e7e6":8,"h7h6":9,"b8d7":10,"c8d7":11,"e7e5":12,"g6g5":13,"a7a5":14,"a8b8":15,"a8c8":16,"c6d4":17,"c7c6":18,"c8g4":19,"d6e5":20,"f6d5":21,"f6e4":22,"c8e6":23,"c8f5":24,"d7d5":25,"d7e5":26,"d8d7":27,"f7f5":28,"f8e8":29,"g5g4":30,"h6g5":31,"h7h5":32,"a7a6":33,"b2a2":34,"b4b3":35,"b7c6":36,"c5c4":37,"d4c3":38,"d4h4":39,"d5d4":40,"d6d5":41,"d7c6":42,"d8a5":43,"d8d4":44,"d8h4":45,"e5d4":46,"e5f4":47,"f5d3":48,"f5f4":49,"f6d7":50,"f6f5":51,"f7f6":52,"f8d8":53,"f8f7":54,"g4g3":55,"g7c3":56,"g7d4":57,"g7e5":58,"g8f7":59,"h4h3":60,"h5h4":61,"a1a2":62,"a1f1":63,"a2a1":64,"a2c2":65,"a2h2":66,"a3a2":67,"a3c2":68,"a4a3":69,"a5a4":70,"a5c3":71,"a6c7":72,"a8e8":73,"a8f8":74,"b2d1":75,"b3g3":76,"b4b2":77,"b5b4":78,"b5d4":79,"b6d4":80,"b7b6":81,"b8a6":82,"b8b6":83,"b8d8":84,"b8e8":85,"c1a1":86,"c1d3":87,"c2a2":88,"c2b4":89,"c2c1":90,"c2c5":91,"c2d4":92,"c3d4":93,"c3e1":94,"c3e5":95,"c4a3":96,"c4b2":97,"c4c2":98,"c4c3":99,"c4f4":100,"c5d3":101,"c6b5":102,"c6e4":103,"c6e5":104,"c6f3":105,"c7c2":106,"c7e5":107,"c7e6":108,"c7e8":109,"c8c2":110,"c8c3":111,"c8c4":112,"c8c7":113,"c8d8":114,"d1e3":115,"d2d4":116,"d3b1":117,"d3c1":118,"d3e1":119,"d3e4":120,"d4b4":121,"d4b5":122,"d4c2":123,"d4d3":124,"d4e2":125,"d4e3":126,"d4e4":127,"d4f3":128,"d4f6":129,"d5c3":130,"d5d2":131,"d5e4":132,"d5e7":133,"d5f6":134,"d6c7":135,"d7c5":136,"d7e6":137,"d7e7":138,"d7f6":139,"d7f8":140,"d8b6":141,"d8d1":142,"d8d3":143,"d8d5":144,"d8d6":145,"d8e7":146,"e1d3":147,"e2b2":148,"e3c4":149,"e3e2":150,"e3f3":151,"e4c3":152,"e4e3":153,"e4e5":154,"e4g5":155,"e5c4":156,"e5d3":157,"e5f6":158,"e5g4":159,"e5h5":160,"e6c7":161,"e6d5":162,"e6e3":163,"e6e5":164,"e7c7":165,"e7d5":166,"e7f6":167,"e8b8":168,"e8c7":169,"e8c8":170,"e8e3":171,"f1f4":172,"f2f4":173,"f3e1":174,"f3g1":175,"f3g4":176,"f3h4":177,"f4b4":178,"f4e3":179,"f4f3":180,"f4g4":181,"f5f2":182,"f6e5":183,"f6e8":184,"f6g4":185,"f6g5":186,"f6h5":187,"f6h7":188,"f7g6":189,"f7g8":190,"f8c8":191,"f8d6":192,"f8e6":193,"f8f1":194,"g1f3":195,"g2g1q":196,"g3g2":197,"g3h3":198,"g4d1":199,"g4e3":200,"g4e5":201,"g4f3":202,"g4f5":203,"g4g5":204,"g5f4":205,"g5g1":206,"g5h6":207,"g7f6":208,"g8f8":209,"g8g7":210,"g8h7":211,"h2h1q":212,"h3h2":213,"h3h4":214,"h4e4":215,"h4f2":216,"h4f3":217,"h5g3":218,"h5g4":219,"h6h5":220,"h6h7":221,"h7f6":222,"h7g6":223},"index_to_move":{"0":"g8f6","1":"d7d6","2":"g7g6","3":"c7c5","4":"e8g8","5":"f8g7","6":"b8c6","7":"c5d4","8":"e7e6","9":"h7h6","10":"b8d7","11":"c8d7","12":"e7e5","13":"g6g5","14":"a7a5","15":"a8b8","16":"a8c8","17":"c6d4","18":"c7c6","19":"c8g4","20":"d6e5","21":"f6d5","22":"f6e4","23":"c8e6","24":"c8f5","25":"d7d5","26":"d7e5","27":"d8d7","28":"f7f5","29":"f8e8","30":"g5g4","31":"h6g5","32":"h7h5","33":"a7a6","34":"b2a2","35":"b4b3","36":"b7c6","37":"c5c4","38":"d4c3","39":"d4h4","40":"d5d4","41":"d6d5","42":"d7c6","43":"d8a5","44":"d8d4","45":"d8h4","46":"e5d4","47":"e5f4","48":"f5d3","49":"f5f4","50":"f6d7","51":"f6f5","52":"f7f6","53":"f8d8","54":"f8f7","55":"g4g3","56":"g7c3","57":"g7d4","58":"g7e5","59":"g8f7","60":"h4h3","61":"h5h4","62":"a1a2","63":"a1f1","64":"a2a1","65":"a2c2","66":"a2h2","67":"a3a2","68":"a3c2","69":"a4a3","70":"a5a4","71":"a5c3","72":"a6c7","73":"a8e8","74":"a8f8","75":"b2d1","76":"b3g3","77":"b4b2","78":"b5b4","79":"b5d4","80":"b6d4","81":"b7b6","82":"b8a6","83":"b8b6","84":"b8d8","85":"b8e8","86":"c1a1","87":"c1d3","88":"c2a2","89":"c2b4","90":"c2c1","91":"c2c5","92":"c2d4","93":"c3d4","94":"c3e1","95":"c3e5","96":"c4a3","97":"c4b2","98":"c4c2","99":"c4c3","100":"c4f4","101":"c5d3","102":"c6b5","103":"c6e4","104":"c6e5","105":"c6f3","106":"c7c2","107":"c7e5","108":"c7e6","109":"c7e8","110":"c8c2","111":"c8c3","112":"c8c4","113":"c8c7","114":"c8d8","115":"d1e3","116":"d2d4","117":"d3b1","118":"d3c1","119":"d3e1","120":"d3e4","121":"d4b4","122":"d4b5","123":"d4c2","124":"d4d3","125":"d4e2","126":"d4e3","127":"d4e4","128":"d4f3","129":"d4f6","130":"d5c3","131":"d5d2","132":"d5e4","133":"d5e7","134":"d5f6","135":"d6c7","136":"d7c5","137":"d7e6","138":"d7e7","139":"d7f6","140":"d7f8","141":"d8b6","142":"d8d1","143":"d8d3","144":"d8d5","145":"d8d6","146":"d8e7","147":"e1d3","148":"e2b2","149":"e3c4","150":"e3e2","151":"e3f3","152":"e4c3","153":"e4e3","154":"e4e5","155":"e4g5","156":"e5c4","157":"e5d3","158":"e5f6","159":"e5g4","160":"e5h5","161":"e6c7","162":"e6d5","163":"e6e3","164":"e6e5","165":"e7c7","166":"e7d5","167":"e7f6","168":"e8b8","169":"e8c7","170":"e8c8","171":"e8e3","172":"f1f4","173":"f2f4","174":"f3e1","175":"f3g1","176":"f3g4","177":"f3h4","178":"f4b4","179":"f4e3","180":"f4f3","181":"f4g4","182":"f5f2","183":"f6e5","184":"f6e8","185":"f6g4","186":"f6g5","187":"f6h5","188":"f6h7","189":"f7g6","190":"f7g8","191":"f8c8","192":"f8d6","193":"f8e6","194":"f8f1","195":"g1f3","196":"g2g1q","197":"g3g2","198":"g3h3","199":"g4d1","200":"g4e3","201":"g4e5","202":"g4f3","203":"g4f5","204":"g4g5","205":"g5f4","206":"g5g1","207":"g5h6","208":"g7f6","209":"g8f8","210":"g8g7","211":"g8h7","212":"h2h1q","213":"h3h2","214":"h3h4","215":"h4e4","216":"h4f2","217":"h4f3","218":"h5g3","219":"h5g4","220":"h6h5","221":"h6h7","222":"h7f6","223":"h7g6"},"vocab_size":224,"top_moves":[["g8f6",20],["d7d6",18],["g7g6",17],["c7c5",16],["e8g8",16],["f8g7",15],["b8c6",13],["c5d4",9],["e7e6",7],["h7h6",7],["b8d7",5],["c8d7",5],["e7e5",5],["g6g5",5],["a7a5",4],["a8b8",4],["a8c8",4],["c6d4",4],["c7c6",4],["c8g4",4],["d6e5",4],["f6d5",4],["f6e4",4],["c8e6",3],["c8f5",3],["d7d5",3],["d7e5",3],["d8d7",3],["f7f5",3],["f8e8",3],["g5g4",3],["h6g5",3],["h7h5",3],["a7a6",2],["b2a2",2],["b4b3",2],["b7c6",2],["c5c4",2],["d4c3",2],["d4h4",2],["d5d4",2],["d6d5",2],["d7c6",2],["d8a5",2],["d8d4",2],["d8h4",2],["e5d4",2],["e5f4",2],["f5d3",2],["f5f4",2],["f6d7",2],["f6f5",2],["f7f6",2],["f8d8",2],["f8f7",2],["g4g3",2],["g7c3",2],["g7d4",2],["g7e5",2],["g8f7",2],["h4h3",2],["h5h4",2],["a1a2",1],["a1f1",1],["a2a1",1],["a2c2",1],["a2h2",1],["a3a2",1],["a3c2",1],["a4a3",1],["a5a4",1],["a5c3",1],["a6c7",1],["a8e8",1],["a8f8",1],["b2d1",1],["b3g3",1],["b4b2",1],["b5b4",1],["b5d4",1],["b6d4",1],["b7b6",1],["b8a6",1],["b8b6",1],["b8d8",1],["b8e8",1],["c1a1",1],["c1d3",1],["c2a2",1],["c2b4",1],["c2c1",1],["c2c5",1],["c2d4",1],["c3d4",1],["c3e1",1],["c3e5",1],["c4a3",1],["c4b2",1],["c4c2",1],["c4c3",1]]}