{"move_to_index":{"g8f6":0,"c7c6":1,"d7d5":2,"e7e6":3,"e8g8":4,"b8c6":5,"c8g4":6,"b8d7":7,"h7h6":8,"g7g6":9,"f8d6":10,"f6e4":11,"c6d5":12,"a7a6":13,"f8e7":14,"d5e4":15,"d7d6":16,"c8f5":17,"f8g7":18,"f7f5":19,"a8c8":20,"h7h5":21,"f8e8":22,"c6c5":23,"e7f6":24,"f7f6":25,"e6e5":26,"c5d4":27,"e6d5":28,"g4f3":29,"g8h8":30,"c7c5":31,"b7b6":32,"g7f6":33,"b7b5":34,"d8e7":35,"g7g5":36,"d8c7":37,"h5h4":38,"e7e5":39,"a8b8":40,"c8d7":41,"e7d6":42,"a7a5":43,"e8c8":44,"g6g5":45,"f5e4":46,"f6f5":47,"g5g4":48,"d8d7":49,"d7f6":50,"d6e5":51,"g8g7":52,"h6h5":53,"h7g6":54,"f5f4":55,"f6d5":56,"f7e6":57,"g8h7":58,"g4h5":59,"c6e5":60,"d7e5":61,"h8g8":62,"b7c6":63,"d8b6":64,"a8d8":65,"e5e4":66,"b5b4":67,"d5d4":68,"d7b6":69,"f6d7":70,"d8d6":71,"c6d4":72,"e5d4":73,"d6e7":74,"h4h3":75,"f8d8":76,"a8e8":77,"d5c4":78,"e6f5":79,"a6a5":80,"c8b8":81,"e8e7":82,"f8g8":83,"a5a4":84,"f6g5":85,"c8b7":86,"d8c8":87,"f6e5":88,"g8f8":89,"c8c7":90,"d8e8":91,"f5g6":92,"f7g6":93,"d8f6":94,"g6f5":95,"h5g4":96,"f6g4":97,"d6d5":98,"f4f3":99,"f8c8":100,"g8f7":101,"h5g6":102,"d6f4":103,"f6h5":104,"c8e6":105,"e8f8":106,"d7c6":107,"b4c3":108,"b6b5":109,"c4c3":110,"e8d8":111,"g5f4":112,"d8h4":113,"f8f7":114,"c5c4":115,"e4f3":116,"h6g5":117,"d4d3":118,"e4e3":119,"g8e7":120,"h8h7":121,"d6c7":122,"f5d3":123,"e7h4":124,"g4g3":125,"g7h6":126,"a5b4":127,"a6b5":128,"d7c5":129,"f5g4":130,"f6e7":131,"g4e2":132,"g6h5":133,"d8d4":134,"d8d5":135,"c6b5":136,"c8c2":137,"d8d1":138,"e8d7":139,"a4a3":140,"b6c5":141,"b6d5":142,"e5f4":143,"e7g5":144,"f8b4":145,"f8f6":146,"h3h2":147,"h4g3":148,"b8a8":149,"c6e7":150,"d8g5":151,"e8f7":152,"g5h4":153,"g7f8":154,"h8d8":155,"c6b4":156,"d6c5":157,"d8a5":158,"f6g6":159,"a3a2":160,"a8a7":161,"a8f8":162,"c7d7":163,"d6g3":164,"f6e8":165,"g4f5":166,"b4b3":167,"b5c4":168,"d7e6":169,"e8e6":170,"h7g8":171,"h8g7":172,"c7d6":173,"c8d8":174,"d7c7":175,"d7f8":176,"e3e2":177,"e7d7":178,"f3f2":179,"g4h3":180,"b6c7":181,"c6a5":182,"c7b6":183,"e7g6":184,"h7h8":185,"b7a6":186,"f8c5":187,"c3c2":188,"d4e5":189,"f4g3":190,"f6d4":191,"a7b6":192,"b8c8":193,"d4c3":194,"d6h2":195,"e4c3":196,"e8e5":197,"f8b8":198,"g5f5":199,"d3d2":200,"d8h8":201,"e4g3":202,"e7f5":203,"f4e3":204,"f6h7":205,"d7e7":206,"f5e6":207,"f6e6":208,"g7e5":209,"h3g2":210,"h8f8":211,"a5b6":212,"b6d4":213,"c7b7":214,"c8c1":215,"c8c4":216,"c8c6":217,"e4d3":218,"e5c4":219,"e5f3":220,"e7b4":221,"e7d8":222,"e8e2":223,"b2a2":224,"b8a6":225,"d6b4":226,"d6d7":227,"d7e8":228,"d8f8":229,"g6e4":230,"g7d4":231,"h5g5":232,"b8b7":233,"c7e5":234,"c8e8":235,"e7f8":236,"f6g7":237,"f7f8":238,"g3g2":239,"g4e6":240,"g8g2":241,"h7g7":242,"b4a5":243,"c5d3":244,"c7f4":245,"c8c3":246,"d5e5":247,"e6d6":248,"e8e4":249,"f8a8":250,"g5f6":251,"h8h3":252,"a5c4":253,"b7b8":254,"d4e2":255,"d7f5":256,"d8d2":257,"e5f6":258,"e6d7":259,"e6f6":260,"e7c5":261,"e8e1":262,"g5h5":263,"h4g4":264,"h5e2":265,"h5f4":266,"h8h2":267,"a4b3":268,"a7a8":269,"b5a4":270,"b8b1":271,"c3c4":272,"c3d3":273,"c6d7":274,"d5c3":275,"d7a4":276,"e4f2":277,"e6f7":278,"f4c1":279,"f6h4":280,"f8e6":281,"g5g6":282,"g6e5":283,"g6f6":284,"g7h7":285,"h2h1":286,"h2h1q":287,"h6h7":288,"b3b2":289,"b7a7":290,"d5f4":291,"d8b8":292,"d8g8":293,"e4g2":294,"f2f3":295,"f2g2":296,"f5g5":297,"f8f1":298,"g6h6":299,"h4f6":300,"h4g5":301,"a2a1q":302,"a8g8":303,"b4c4":304,"b4c6":305,"b6c4":306,"b6c6":307,"b8b2":308,"c2b2":309,"c3b4":310,"d5e3":311,"d7h3":312,"e5g4":313,"f3f4":314,"f5e5":315,"f5h7":316,"f8f3":317,"g4e3":318,"g6g7":319,"g6h7":320,"h4e7":321,"h5f3":322,"h6g7":323,"h8h5":324,"a2b2":325,"a8a1":326,"a8h8":327,"b2b1":328,"b2b3":329,"b7d5":330,"b8a7":331,"b8d8":332,"c2c1":333,"c3d4":334,"c5b4":335,"c5b6":336,"c5f2":337,"c7d8":338,"c7g3":339,"c8f8":340,"d5b4":341,"d6b8":342,"d7d8":343,"d7g4":344,"e4f6":345,"e5c7":346,"e5d5":347,"e7f7":348,"e8c7":349,"e8d6":350,"e8e3":351,"f6b2":352,"f7g8":353,"g3h4":354,"g4f2":355,"g6d3":356,"g7f7":357,"g8g5":358,"h3h1":359,"h8e8":360,"a2a3":361,"a3b3":362,"b6b2":363,"b6d7":364,"b8c7":365,"b8e8":366,"c6d8":367,"c7b8":368,"c7e7":369,"d4e3":370,"d4e4":371,"d5f6":372,"d6c6":373,"d6e6":374,"d7c8":375,"e3e4":376,"e4d5":377,"e4g6":378,"e5f5":379,"e7c7":380,"e7d5":381,"f2f1q":382,"f4e4":383,"f4g5":384,"f6f2":385,"f6f7":386,"f7g7":387,"g3h3":388,"g4d7":389,"g7g8":390,"h8h1":391,"a5a6":392,"a6a7":393,"a6c7":394,"b4a3":395,"b4d3":396,"b4d6":397,"c4b3":398,"c4d3":399,"c6c7":400,"c7c8":401,"c8a6":402,"c8a8":403,"d6e4":404,"e1f2":405,"e4d2":406,"e5c5":407,"e6c4":408,"e7e8":409,"f5c2":410,"f7e7":411,"f7e8":412,"f8f2":413,"f8f4":414,"g1h1":415,"g5e4":416,"h2d6":417,"h4e4":418,"h6g6":419,"h7f6":420,"h7g5":421,"h8c8":422,"a8a2":423,"a8a3":424,"b1b2":425,"b5a5":426,"b5a6":427,"c1d1":428,"c4b5":429,"c5b5":430,"c5d6":431,"c5e3":432,"c5e4":433,"c7c2":434,"c7c4":435,"d1e1":436,"d3b2":437,"d4c4":438,"d4c5":439,"d4f3":440,"d4g7":441,"d5d6":442,"d5h5":443,"d8a8":444,"d8d3":445,"e2e1q":446,"e4f4":447,"e4g5":448,"e5d3":449,"e5d6":450,"e5g3":451,"e6h3":452,"f1e1":453,"f2e3":454,"f4d3":455,"f4e5":456,"g2g3":457,"g3f4":458,"h1f1":459,"h4f2":460,"h5e5":461,"h8h4":462,"a2a1":463,"a5b3":464,"a7b7":465,"b2c2":466,"b2c3":467,"b6a5":468,"b7a8":469,"b8b6":470,"b8d6":471,"c2d3":472,"c4d4":473,"c4e3":474,"c5d5":475,"c5e6":476,"c6b7":477,"c7a5":478,"c7d5":479,"d3d4":480,"d3f5":481,"d4h4":482,"d5c5":483,"d7b5":484,"d7d1":485,"d7f7":486,"d8c6":487,"e2f4":488,"e3f2":489,"e3f4":490,"e4d4":491,"e4d6":492,"e5c3":493,"e5c6":494,"e5g6":495,"e6c5":496,"e6c7":497,"e6g5":498,"e7e3":499,"f2g3":500,"f3g3":501,"f4f5":502,"f4f6":503,"f4h4":504,"f5d6":505,"f5d7":506,"f5f3":507,"f5f6":508,"f8h8":509,"g2f2":510,"g3f3":511,"g4d1":512,"g4f6":513,"g5h6":514,"g8e8":515,"g8h6":516,"h3e3":517,"h3g3":518,"h3h5":519,"h4h2":520,"h5g3":521,"h6f6":522,"a3b4":523,"a3c3":524,"a4b4":525,"a5b5":526,"a5c7":527,"a6b4":528,"b6b3":529,"b6d6":530,"c1c3":531,"c1f4":532,"c7e6":533,"c7g7":534,"d2a2":535,"d2d1q":536,"d2f2":537,"d3c3":538,"d3c4":539,"d3e5":540,"d4d6":541,"d4f6":542,"d5b6":543,"d5f3":544,"d6c4":545,"d6d4":546,"d6f6":547,"e2e1":548,"e2e3":549,"e4c2":550,"e5h5":551,"e7a3":552,"e7c6":553,"e7e4":554,"e7g7":555,"e8f6":556,"f1g1":557,"f3g2":558,"f5d4":559,"f5f8":560,"f5h3":561,"f5h4":562,"f6h6":563,"f8f5":564,"g2g1":565,"g2h2":566,"g3e1":567,"g3h2":568,"g6f7":569,"g6g2":570,"g7b2":571,"g8g3":572,"h1d1":573,"h1g1":574,"h2f4":575,"h3f3":576,"h3f5":577,"h4h5":578,"h6g4":579,"a2a4":580,"a5c5":581,"a5f5":582,"a6d6":583,"a8b6":584,"b4b2":585,"b4c5":586,"b5b6":587,"b5d6":588,"b5d7":589,"b6a4":590,"b6a6":591,"b6d8":592,"b6e3":593,"b7e7":594,"b8b3":595,"b8b4":596,"b8f8":597,"c2f2":598,"c2f5":599,"c3b2":600,"c3e4":601,"c4b2":602,"c4b4":603,"c4c2":604,"c4d2":605,"c6c2":606,"c6d6":607,"c6e6":608,"c7a7":609,"c7b5":610,"c8c5":611,"d1f1":612,"d1h5":613,"d2b2":614,"d2d1":615,"d3c2":616,"d4b3":617,"d4c6":618,"d5d1":619,"d5e6":620,"d7b7":621,"e3c1":622,"e3e6":623,"e4e5":624,"e5e6":625,"e5g5":626,"e6e7":627,"e6g4":628,"e6h6":629,"e8b8":630,"e8g6":631,"e8h5":632,"f2e2":633,"f3e4":634,"f5e3":635,"f5h5":636,"f6a6":637,"f6f3":638,"f6f8":639,"f8d7":640,"g2g1q":641,"g3f2":642,"g4e5":643,"g4h2":644,"g4h4":645,"g4h6":646,"g5e3":647,"g5f3":648,"g6d6":649,"g7h8":650,"g8d8":651,"h1h2":652,"h2g3":653,"h2h3":654,"h3g4":655,"h3h4":656,"h5h3":657,"h8h6":658,"a1a2":659,"a1b1":660,"a1f1":661,"a2e6":662,"a4c2":663,"a5d5":664,"a6c4":665,"a6c5":666,"a6e6":667,"a7b8":668,"a8a5":669,"a8a6":670,"b1c2":671,"b2a3":672,"b2c1":673,"b2c4":674,"b2e2":675,"b2f6":676,"b2g7":677,"b3a3":678,"b3b5":679,"b3c3":680,"b3e3":681,"b5c6":682,"b6b4":683,"b6b7":684,"b6c8":685,"b7c8":686,"b8e5":687,"c1b1":688,"c2c1q":689,"c3c1":690,"c3h3":691,"c4a4":692,"c4d5":693,"c4e4":694,"c4e5":695,"c5c3":696,"c5d7":697,"c6a6":698,"c6b6":699,"c6e8":700,"c7a6":701,"c7c1":702,"c7h2":703,"c8d6":704,"c8g8":705,"c8h3":706,"d2d3":707,"d2e1":708,"d2f3":709,"d3b3":710,"d3e3":711,"d3e4":712,"d3f2":713,"d4d2":714,"d4d5":715,"d4f5":716,"d5a5":717,"d5c6":718,"d5d8":719,"d6f5":720,"d7b8":721,"e1c3":722,"e1d1":723,"e1f1":724,"e3e1":725,"e4c4":726,"e4c5":727,"e4e1":728,"e5d7":729,"e6e2":730,"e6f4":731,"e6g6":732,"e8a8":733,"e8g7":734,"f2f4":735,"f4d2":736,"f4e6":737,"f4g4":738,"f7h5":739,"f8a3":740,"f8g6":741,"g1f2":742,"g1g5":743,"g3f5":744,"g4c8":745,"g4g6":746,"g5g3":747,"g6h4":748,"g8c8":749,"g8g6":750,"h5d1":751,"h5f6":752,"h5h2":753,"h7d3":754,"h8a8":755,"a1a8":756,"a2d2":757,"a2e2":758,"a3a4":759,"a4a1":760,"a4a2":761,"a4c6":762,"a5d2":763,"a5g5":764,"a6b7":765,"a6d3":766,"a7a3":767,"a8f3":768,"b1c1":769,"b2b4":770,"b3b4":771,"b4c2":772,"b4d2":773,"b5b7":774,"b5c5":775,"b6a7":776,"b7b2":777,"b7b3":778,"b7f3":779,"b7g2":780,"b8b5":781,"b8g3":782,"c1c2":783,"c1g1":784,"c2a2":785,"c2c3":786,"c2d2":787,"c2g2":788,"c3a3":789,"c3b3":790,"c3c5":791,"c3e5":792,"c4b6":793,"c4d6":794,"c5a6":795,"c5c6":796,"c6c4":797,"c6e4":798,"c7e8":799,"d1g1":800,"d1h1":801,"d2c2":802,"d3a6":803,"d3b1":804,"d3c1":805,"d3d5":806,"d4b4":807,"d4f2":808,"d5a2":809,"d5b5":810,"d5g5":811,"d6a3":812,"d6b5":813,"d6g6":814,"d7a7":815,"d7d3":816,"d7g7":817,"e1a1":818,"e2c1":819,"e2d3":820,"e2d4":821,"e2e6":822,"e2f2":823,"e3b6":824,"e3d1":825,"e3d3":826,"e3g3":827,"e4e2":828,"e5b2":829,"e5b8":830,"e5e3":831,"e6a2":832,"e6d4":833,"e6e8":834,"e7h7":835,"e8c6":836,"e8h8":837,"f1d1":838,"f1f4":839,"f2a2":840,"f2d4":841,"f2f1":842,"f2g1":843,"f2g4":844,"f2h2":845,"f3e2":846,"f3e5":847,"f3f1":848,"f3g4":849,"f3h1":850,"f3h3":851,"f4d6":852,"f4e2":853,"f4h3":854,"f5c8":855,"f5f2":856,"f6c3":857,"f7d5":858,"f7f4":859,"f8h6":860,"g1f1":861,"g2d2":862,"g2e4":863,"g3e2":864,"g3g1":865,"g3g4":866,"g3g5":867,"g5d2":868,"g5e7":869,"g5g1":870,"g5g2":871,"g5g7":872,"g6c6":873,"g6e6":874,"g6f4":875,"g6f8":876,"g6g4":877,"g7c3":878,"g7g3":879,"g8g1":880,"g8g4":881,"h1g2":882,"h2b2":883,"h2f2":884,"h2g2":885,"h4d4":886,"h4d8":887,"h4e1":888,"h4f3":889,"h4f4":890,"h4h1":891,"h5f5":892,"h5h6":893,"h6d2":894,"h7d7":895,"h7e4":896,"a1a4":897,"a1e1":898,"a2b1":899,"a2c2":900,"a2f2":901,"a3c2":902,"a3c5":903,"a3e3":904,"a3e7":905,"a4a6":906,"a4b5":907,"a4c5":908,"a4d1":909,"a4d4":910,"a5a2":911,"a5c3":912,"a6b6":913,"a7c7":914,"b1d1":915,"b1e1":916,"b1g6":917,"b2b1q":918,"b2d3":919,"b2h2":920,"b3a4":921,"b3b1":922,"b3b6":923,"b3c4":924,"b3d4":925,"b3h3":926,"b4a4":927,"b4d4":928,"b4d5":929,"b4e7":930,"b5b2":931,"b5b3":932,"b5d5":933,"b6f2":934,"b7c7":935,"b7e4":936,"b7h1":937,"b8h8":938,"c1a1":939,"c1a3":940,"c1b2":941,"c1d2":942,"c2a1":943,"c2a3":944,"c2a4":945,"c2c5":946,"c2d1":947,"c3d2":948,"c3f6":949,"c4a2":950,"c4c5":951,"c4c6":952,"c4c8":953,"c4f1":954,"c4h4":955,"c5c2":956,"c5c8":957,"c5e7":958,"c6a7":959,"c6f3":960,"c6g2":961,"c7c3":962,"d1c1":963,"d1d2":964,"d2e3":965,"d2h2":966,"d3c5":967,"d3e2":968,"d3f4":969,"d4b5":970,"d4b6":971,"d4c2":972,"d4d8":973,"d4g4":974,"d5a8":975,"d5c7":976,"d5e7":977,"d5h1":978,"d6b6":979,"d6d2":980,"d6d3":981,"d6d8":982,"d6f8":983,"d7d4":984,"e1e6":985,"e1g1":986,"e1h4":987,"e2a2":988,"e2b2":989,"e2c4":990,"e2e4":991,"e2g3":992,"e3b3":993,"e3c2":994,"e3d4":995,"e3f1":996,"e3h3":997,"e3h6":998,"e4e8":999,"e4g4":1000,"e4h4":1001,"e5e1":1002,"e5f7":1003,"e5g7":1004,"e6a6":1005,"e6b3":1006,"e6c6":1007,"e6e3":1008,"e7b7":1009,"e7c8":1010,"f1f5":1011,"f1f7":1012,"f1f8":1013,"f2b6":1014,"f2d1":1015,"f2e4":1016,"f2f5":1017,"f2h1":1018,"f3b3":1019,"f3d2":1020,"f3d4":1021,"f3d5":1022,"f3f5":1023,"f3f7":1024,"f4c7":1025,"f4d5":1026,"f4h6":1027,"f5b1":1028,"f6f4":1029,"f6h8":1030,"f7c7":1031,"f7d7":1032,"f7e5":1033,"f7f2":1034,"g1a1":1035,"g1e1":1036,"g1g2":1037,"g2f1":1038,"g2f3":1039,"g2g5":1040,"g2h1":1041,"g3c3":1042,"g3e4":1043,"g3g7":1044,"g3h1":1045,"g4f4":1046,"g5d5":1047,"g6b1":1048,"g6c2":1049,"g6e8":1050,"g6g1":1051,"g7f5":1052,"g8b8":1053,"h1a1":1054,"h1e4":1055,"h1f3":1056,"h1h3":1057,"h3f1":1058,"h4c4":1059,"h4f5":1060,"h4g2":1061,"h5a5":1062,"h5f7":1063,"h5h7":1064,"h5h8":1065,"h6f4":1066,"h6f5":1067,"h6h3":1068,"h7f5":1069,"h7f7":1070,"h7f8":1071,"h7h1":1072,"h8e5":1073,"h8g6":1074,"a1a6":1075,"a1b2":1076,"a1g1":1077,"a1h1":1078,"a2a6":1079,"a2b3":1080,"a2c4":1081,"a2d5":1082,"a2h2":1083,"a3a8":1084,"a3b2":1085,"a3c4":1086,"a3d3":1087,"a3g3":1088,"a3h3":1089,"a4a5":1090,"a4c3":1091,"a4c4":1092,"a5c6":1093,"a5d8":1094,"a5e5":1095,"a5h5":1096,"a6a4":1097,"a6c6":1098,"a6c8":1099,"a6e2":1100,"a7a1":1101,"a7a2":1102,"a7b5":1103,"a7c6":1104,"a7d7":1105,"a7e3":1106,"a7e7":1107,"a7f7":1108,"a7h7":1109,"a8b7":1110,"b1a1":1111,"b1b4":1112,"b1b5":1113,"b1b8":1114,"b1f1":1115,"b1f5":1116,"b2a4":1117,"b2b8":1118,"b2d4":1119,"b2f2":1120,"b3a2":1121,"b3b7":1122,"b3c2":1123,"b3c5":1124,"b4a2":1125,"b4a6":1126,"b4b1":1127,"b4b5":1128,"b4b6":1129,"b4e4":1130,"b5c7":1131,"b5d3":1132,"b5d4":1133,"b5f5":1134,"b6e6":1135,"b7f7":1136,"c1b3":1137,"c1c6":1138,"c1e1":1139,"c1e3":1140,"c1h1":1141,"c2b3":1142,"c2c4":1143,"c2d4":1144,"c2e1":1145,"c2e2":1146,"c3a4":1147,"c3b5":1148,"c3c6":1149,"c3c7":1150,"c3e2":1151,"c3e3":1152,"c3g7":1153,"c4a3":1154,"c4a6":1155,"c4c1":1156,"c4e2":1157,"c4e6":1158,"c4f4":1159,"c5a4":1160,"c5a7":1161,"c5b7":1162,"c5c1":1163,"c5c7":1164,"c6b8":1165,"c6c1":1166,"c6c3":1167,"c6g6":1168,"c7f7":1169,"c8a7":1170,"c8b6":1171,"d1a1":1172,"d1c2":1173,"d1d6":1174,"d1d7":1175,"d1f3":1176,"d2c4":1177,"d2e4":1178,"d2g5":1179,"d3b5":1180,"d3d1":1181,"d3d7":1182,"d3e1":1183,"d3f1":1184,"d3g3":1185,"d3h3":1186,"d4a1":1187,"d4b2":1188,"d4d1":1189,"d4e6":1190,"d4g1":1191,"d5d3":1192,"d5d7":1193,"d6e8":1194,"d6f7":1195,"d8e6":1196,"d8f7":1197,"e1b1":1198,"e1c1":1199,"e1e2":1200,"e1g3":1201,"e1h1":1202,"e2c2":1203,"e2d1":1204,"e2e5":1205,"e2f1":1206,"e2f1q":1207,"e2f3":1208,"e2g2":1209,"e3c3":1210,"e3f3":1211,"e3f5":1212,"e3g2":1213,"e3g4":1214,"e4c6":1215,"e4f5":1216,"e4h1":1217,"e5a5":1218,"e5b5":1219,"e5e7":1220,"e5e8":1221,"e6e4":1222,"e6f8":1223,"e6g7":1224,"e7e1":1225,"e7e2":1226,"e8b5":1227,"f1b5":1228,"f1c1":1229,"f1d3":1230,"f1e2":1231,"f1f2":1232,"f1f3":1233,"f1g2":1234,"f1g3":1235,"f2b2":1236,"f2d2":1237,"f2e1":1238,"f2f7":1239,"f2h4":1240,"f3a3":1241,"f3c3":1242,"f3e1":1243,"f3e3":1244,"f3f8":1245,"f4f1":1246,"f4f2":1247,"f4g2":1248,"f5a5":1249,"f5f1":1250,"f5f7":1251,"f5g3":1252,"f6d6":1253,"f6f1":1254,"f6g8":1255,"f7f3":1256,"f7g5":1257,"f8h7":1258,"g1b1":1259,"g1d1":1260,"g2e3":1261,"g2g8":1262,"g3e5":1263,"g3f1":1264,"g4a4":1265,"g4c4":1266,"g4g2":1267,"g5a5":1268,"g5c1":1269,"g5c5":1270,"g5e5":1271,"g5f7":1272,"g5h3":1273,"g6e7":1274,"g6g3":1275,"g7c7":1276,"g7d7":1277,"g7e6":1278,"g7g1":1279,"g7g4":1280,"g8c4":1281,"h1b1":1282,"h1c6":1283,"h1e1":1284,"h1f2":1285,"h1h4":1286,"h1h8":1287,"h2a2":1288,"h2d2":1289,"h2e2":1290,"h2f1":1291,"h2g1":1292,"h2g4":1293,"h3c8":1294,"h3d3":1295,"h3e6":1296,"h3f4":1297,"h4h6":1298,"h5g7":1299,"h6c1":1300,"h6h2":1301,"h7h2":1302,"h7h4":1303,"h8b8":1304,"a1c3":1305,"a1d1":1306,"a1e5":1307,"a1f6":1308,"a1h8":1309,"a2c1":1310,"a2g2":1311,"a3a1":1312,"a3a5":1313,"a3a7":1314,"a3b5":1315,"a3d6":1316,"a3f3":1317,"a4a8":1318,"a4d7":1319,"a4e4":1320,"a4e8":1321,"a4f4":1322,"a4g4":1323,"a5a1":1324,"a5a7":1325,"a6a2":1326,"a6a3":1327,"a6f1":1328,"a6f6":1329,"a7c8":1330,"a7g7":1331,"a8c6":1332,"a8c7":1333,"a8e4":1334,"b1b7":1335,"b1d2":1336,"b1d3":1337,"b1e4":1338,"b1g1":1339,"b1h1":1340,"b2a1":1341,"b2b1n":1342,"b2b5":1343,"b2b7":1344,"b2e5":1345,"b2g2":1346,"b3a5":1347,"b3d1":1348,"b3d3":1349,"b4b7":1350,"b4b8":1351,"b4e1":1352,"b4f8":1353,"b5a3":1354,"b5a7":1355,"b5b8":1356,"b5c3":1357,"b5e5":1358,"b5e8":1359,"b5f1":1360,"b6b1":1361,"b6b8":1362,"b6f6":1363,"b6g1":1364,"b6g6":1365,"b7b1":1366,"b7b4":1367,"b7c5":1368,"b7d7":1369,"b7d8":1370,"b8g8":1371,"c1a2":1372,"c1c5":1373,"c1c8":1374,"c1d3":1375,"c1e2":1376,"c1f1":1377,"c2b1":1378,"c2c7":1379,"c2c8":1380,"c2e3":1381,"c2e4":1382,"c3a1":1383,"c3a2":1384,"c3a5":1385,"c3c8":1386,"c3d1":1387,"c3e1":1388,"c4f7":1389,"c5a3":1390,"c5a5":1391,"c5b3":1392,"c5e5":1393,"c5f8":1394,"c5g5":1395,"c5h5":1396,"c6a4":1397,"c6a8":1398,"c6c8":1399,"c6f6":1400,"c6h1":1401,"c7h7":1402,"c8e7":1403,"c8h8":1404,"d1b1":1405,"d1d3":1406,"d1d5":1407,"d1d8":1408,"d1e3":1409,"d2b3":1410,"d2c1":1411,"d2c3":1412,"d2d7":1413,"d2d8":1414,"d2f1":1415,"d2f4":1416,"d2h6":1417,"d3a3":1418,"d3b4":1419,"d3d6":1420,"d3f3":1421,"d3g6":1422,"d3h7":1423,"d4a4":1424,"d4a7":1425,"d4d7":1426,"d4f4":1427,"d4h8":1428,"d5b3":1429,"d5b7":1430,"d5d2":1431,"d5f5":1432,"d6a6":1433,"d6c8":1434,"d6d1":1435,"d6h6":1436,"d7h7":1437,"d8b7":1438,"e1c2":1439,"e1d2":1440,"e1e7":1441,"e2c3":1442,"e2e1n":1443,"e2e7":1444,"e2g4":1445,"e2h2":1446,"e3a3":1447,"e3a7":1448,"e3c4":1449,"e3d2":1450,"e3d5":1451,"e3e7":1452,"e3g1":1453,"e4a4":1454,"e4b1":1455,"e4b4":1456,"e4e6":1457,"e4e7":1458,"e4h7":1459,"e5a1":1460,"e5e2":1461,"e5h2":1462,"e6b6":1463,"f1c4":1464,"f1e3":1465,"f1h2":1466,"f2c5":1467,"f2d3":1468,"f2e1q":1469,"f2f8":1470,"f2h3":1471,"f3b7":1472,"f3c6":1473,"f3d1":1474,"f3d3":1475,"f3f6":1476,"f3h2":1477,"f4a4":1478,"f4b8":1479,"f4c4":1480,"f4d4":1481,"f4f7":1482,"f4g6":1483,"f4h2":1484,"f4h5":1485,"f5b5":1486,"f5d5":1487,"f5e7":1488,"f6b6":1489,"f6c6":1490,"f7a2":1491,"f7b7":1492,"f7f1":1493,"f7h7":1494,"g1c1":1495,"g1g3":1496,"g1g6":1497,"g1g7":1498,"g1h2":1499,"g2a2":1500,"g2b2":1501,"g2b7":1502,"g2c2":1503,"g2e1":1504,"g2e2":1505,"g2g4":1506,"g2h1q":1507,"g2h3":1508,"g3b3":1509,"g3b8":1510,"g3c7":1511,"g3d3":1512,"g3d6":1513,"g3e3":1514,"g4d4":1515,"g4g8":1516,"g5b5":1517,"g5d8":1518,"g5e6":1519,"g5g8":1520,"g7a1":1521,"g7a7":1522,"g7e7":1523,"g7e8":1524,"g8a8":1525,"g8b3":1526,"g8e6":1527,"h1c1":1528,"h1d5":1529,"h1h5":1530,"h1h7":1531,"h2c2":1532,"h2c7":1533,"h2e5":1534,"h2f3":1535,"h2h1n":1536,"h2h8":1537,"h3c3":1538,"h3f2":1539,"h3h6":1540,"h3h7":1541,"h3h8":1542,"h4a4":1543,"h4h7":1544,"h5c5":1545,"h5d5":1546,"h5h1":1547,"h6e3":1548,"h6e6":1549,"h6f8":1550,"h6g8":1551,"h6h1":1552,"h6h4":1553,"h7c7":1554,"h7h3":1555,"h8d4":1556,"h8f6":1557},"index_to_move":{"0":"g8f6","1":"c7c6","2":"d7d5","3":"e7e6","4":"e8g8","5":"b8c6","6":"c8g4","7":"b8d7","8":"h7h6","9":"g7g6","10":"f8d6","11":"f6e4","12":"c6d5","13":"a7a6","14":"f8e7","15":"d5e4","16":"d7d6","17":"c8f5","18":"f8g7","19":"f7f5","20":"a8c8","21":"h7h5","22":"f8e8","23":"c6c5","24":"e7f6","25":"f7f6","26":"e6e5","27":"c5d4","28":"e6d5","29":"g4f3","30":"g8h8","31":"c7c5","32":"b7b6","33":"g7f6","34":"b7b5","35":"d8e7","36":"g7g5","37":"d8c7","38":"h5h4","39":"e7e5","40":"a8b8","41":"c8d7","42":"e7d6","43":"a7a5","44":"e8c8","45":"g6g5","46":"f5e4","47":"f6f5","48":"g5g4","49":"d8d7","50":"d7f6","51":"d6e5","52":"g8g7","53":"h6h5","54":"h7g6","55":"f5f4","56":"f6d5","57":"f7e6","58":"g8h7","59":"g4h5","60":"c6e5","61":"d7e5","62":"h8g8","63":"b7c6","64":"d8b6","65":"a8d8","66":"e5e4","67":"b5b4","68":"d5d4","69":"d7b6","70":"f6d7","71":"d8d6","72":"c6d4","73":"e5d4","74":"d6e7","75":"h4h3","76":"f8d8","77":"a8e8","78":"d5c4","79":"e6f5","80":"a6a5","81":"c8b8","82":"e8e7","83":"f8g8","84":"a5a4","85":"f6g5","86":"c8b7","87":"d8c8","88":"f6e5","89":"g8f8","90":"c8c7","91":"d8e8","92":"f5g6","93":"f7g6","94":"d8f6","95":"g6f5","96":"h5g4","97":"f6g4","98":"d6d5","99":"f4f3","100":"f8c8","101":"g8f7","102":"h5g6","103":"d6f4","104":"f6h5","105":"c8e6","106":"e8f8","107":"d7c6","108":"b4c3","109":"b6b5","110":"c4c3","111":"e8d8","112":"g5f4","113":"d8h4","114":"f8f7","115":"c5c4","116":"e4f3","117":"h6g5","118":"d4d3","119":"e4e3","120":"g8e7","121":"h8h7","122":"d6c7","123":"f5d3","124":"e7h4","125":"g4g3","126":"g7h6","127":"a5b4","128":"a6b5","129":"d7c5","130":"f5g4","131":"f6e7","132":"g4e2","133":"g6h5","134":"d8d4","135":"d8d5","136":"c6b5","137":"c8c2","138":"d8d1","139":"e8d7","140":"a4a3","141":"b6c5","142":"b6d5","143":"e5f4","144":"e7g5","145":"f8b4","146":"f8f6","147":"h3h2","148":"h4g3","149":"b8a8","150":"c6e7","151":"d8g5","152":"e8f7","153":"g5h4","154":"g7f8","155":"h8d8","156":"c6b4","157":"d6c5","158":"d8a5","159":"f6g6","160":"a3a2","161":"a8a7","162":"a8f8","163":"c7d7","164":"d6g3","165":"f6e8","166":"g4f5","167":"b4b3","168":"b5c4","169":"d7e6","170":"e8e6","171":"h7g8","172":"h8g7","173":"c7d6","174":"c8d8","175":"d7c7","176":"d7f8","177":"e3e2","178":"e7d7","179":"f3f2","180":"g4h3","181":"b6c7","182":"c6a5","183":"c7b6","184":"e7g6","185":"h7h8","186":"b7a6","187":"f8c5","188":"c3c2","189":"d4e5","190":"f4g3","191":"f6d4","192":"a7b6","193":"b8c8","194":"d4c3","195":"d6h2","196":"e4c3","197":"e8e5","198":"f8b8","199":"g5f5","200":"d3d2","201":"d8h8","202":"e4g3","203":"e7f5","204":"f4e3","205":"f6h7","206":"d7e7","207":"f5e6","208":"f6e6","209":"g7e5","210":"h3g2","211":"h8f8","212":"a5b6","213":"b6d4","214":"c7b7","215":"c8c1","216":"c8c4","217":"c8c6","218":"e4d3","219":"e5c4","220":"e5f3","221":"e7b4","222":"e7d8","223":"e8e2","224":"b2a2","225":"b8a6","226":"d6b4","227":"d6d7","228":"d7e8","229":"d8f8","230":"g6e4","231":"g7d4","232":"h5g5","233":"b8b7","234":"c7e5","235":"c8e8","236":"e7f8","237":"f6g7","238":"f7f8","239":"g3g2","240":"g4e6","241":"g8g2","242":"h7g7","243":"b4a5","244":"c5d3","245":"c7f4","246":"c8c3","247":"d5e5","248":"e6d6","249":"e8e4","250":"f8a8","251":"g5f6","252":"h8h3","253":"a5c4","254":"b7b8","255":"d4e2","256":"d7f5","257":"d8d2","258":"e5f6","259":"e6d7","260":"e6f6","261":"e7c5","262":"e8e1","263":"g5h5","264":"h4g4","265":"h5e2","266":"h5f4","267":"h8h2","268":"a4b3","269":"a7a8","270":"b5a4","271":"b8b1","272":"c3c4","273":"c3d3","274":"c6d7","275":"d5c3","276":"d7a4","277":"e4f2","278":"e6f7","279":"f4c1","280":"f6h4","281":"f8e6","282":"g5g6","283":"g6e5","284":"g6f6","285":"g7h7","286":"h2h1","287":"h2h1q","288":"h6h7","289":"b3b2","290":"b7a7","291":"d5f4","292":"d8b8","293":"d8g8","294":"e4g2","295":"f2f3","296":"f2g2","297":"f5g5","298":"f8f1","299":"g6h6","300":"h4f6","301":"h4g5","302":"a2a1q","303":"a8g8","304":"b4c4","305":"b4c6","306":"b6c4","307":"b6c6","308":"b8b2","309":"c2b2","310":"c3b4","311":"d5e3","312":"d7h3","313":"e5g4","314":"f3f4","315":"f5e5","316":"f5h7","317":"f8f3","318":"g4e3","319":"g6g7","320":"g6h7","321":"h4e7","322":"h5f3","323":"h6g7","324":"h8h5","325":"a2b2","326":"a8a1","327":"a8h8","328":"b2b1","329":"b2b3","330":"b7d5","331":"b8a7","332":"b8d8","333":"c2c1","334":"c3d4","335":"c5b4","336":"c5b6","337":"c5f2","338":"c7d8","339":"c7g3","340":"c8f8","341":"d5b4","342":"d6b8","343":"d7d8","344":"d7g4","345":"e4f6","346":"e5c7","347":"e5d5","348":"e7f7","349":"e8c7","350":"e8d6","351":"e8e3","352":"f6b2","353":"f7g8","354":"g3h4","355":"g4f2","356":"g6d3","357":"g7f7","358":"g8g5","359":"h3h1","360":"h8e8","361":"a2a3","362":"a3b3","363":"b6b2","364":"b6d7","365":"b8c7","366":"b8e8","367":"c6d8","368":"c7b8","369":"c7e7","370":"d4e3","371":"d4e4","372":"d5f6","373":"d6c6","374":"d6e6","375":"d7c8","376":"e3e4","377":"e4d5","378":"e4g6","379":"e5f5","380":"e7c7","381":"e7d5","382":"f2f1q","383":"f4e4","384":"f4g5","385":"f6f2","386":"f6f7","387":"f7g7","388":"g3h3","389":"g4d7","390":"g7g8","391":"h8h1","392":"a5a6","393":"a6a7","394":"a6c7","395":"b4a3","396":"b4d3","397":"b4d6","398":"c4b3","399":"c4d3","400":"c6c7","401":"c7c8","402":"c8a6","403":"c8a8","404":"d6e4","405":"e1f2","406":"e4d2","407":"e5c5","408":"e6c4","409":"e7e8","410":"f5c2","411":"f7e7","412":"f7e8","413":"f8f2","414":"f8f4","415":"g1h1","416":"g5e4","417":"h2d6","418":"h4e4","419":"h6g6","420":"h7f6","421":"h7g5","422":"h8c8","423":"a8a2","424":"a8a3","425":"b1b2","426":"b5a5","427":"b5a6","428":"c1d1","429":"c4b5","430":"c5b5","431":"c5d6","432":"c5e3","433":"c5e4","434":"c7c2","435":"c7c4","436":"d1e1","437":"d3b2","438":"d4c4","439":"d4c5","440":"d4f3","441":"d4g7","442":"d5d6","443":"d5h5","444":"d8a8","445":"d8d3","446":"e2e1q","447":"e4f4","448":"e4g5","449":"e5d3","450":"e5d6","451":"e5g3","452":"e6h3","453":"f1e1","454":"f2e3","455":"f4d3","456":"f4e5","457":"g2g3","458":"g3f4","459":"h1f1","460":"h4f2","461":"h5e5","462":"h8h4","463":"a2a1","464":"a5b3","465":"a7b7","466":"b2c2","467":"b2c3","468":"b6a5","469":"b7a8","470":"b8b6","471":"b8d6","472":"c2d3","473":"c4d4","474":"c4e3","475":"c5d5","476":"c5e6","477":"c6b7","478":"c7a5","479":"c7d5","480":"d3d4","481":"d3f5","482":"d4h4","483":"d5c5","484":"d7b5","485":"d7d1","486":"d7f7","487":"d8c6","488":"e2f4","489":"e3f2","490":"e3f4","491":"e4d4","492":"e4d6","493":"e5c3","494":"e5c6","495":"e5g6","496":"e6c5","497":"e6c7","498":"e6g5","499":"e7e3","500":"f2g3","501":"f3g3","502":"f4f5","503":"f4f6","504":"f4h4","505":"f5d6","506":"f5d7","507":"f5f3","508":"f5f6","509":"f8h8","510":"g2f2","511":"g3f3","512":"g4d1","513":"g4f6","514":"g5h6","515":"g8e8","516":"g8h6","517":"h3e3","518":"h3g3","519":"h3h5","520":"h4h2","521":"h5g3","522":"h6f6","523":"a3b4","524":"a3c3","525":"a4b4","526":"a5b5","527":"a5c7","528":"a6b4","529":"b6b3","530":"b6d6","531":"c1c3","532":"c1f4","533":"c7e6","534":"c7g7","535":"d2a2","536":"d2d1q","537":"d2f2","538":"d3c3","539":"d3c4","540":"d3e5","541":"d4d6","542":"d4f6","543":"d5b6","544":"d5f3","545":"d6c4","546":"d6d4","547":"d6f6","548":"e2e1","549":"e2e3","550":"e4c2","551":"e5h5","552":"e7a3","553":"e7c6","554":"e7e4","555":"e7g7","556":"e8f6","557":"f1g1","558":"f3g2","559":"f5d4","560":"f5f8","561":"f5h3","562":"f5h4","563":"f6h6","564":"f8f5","565":"g2g1","566":"g2h2","567":"g3e1","568":"g3h2","569":"g6f7","570":"g6g2","571":"g7b2","572":"g8g3","573":"h1d1","574":"h1g1","575":"h2f4","576":"h3f3","577":"h3f5","578":"h4h5","579":"h6g4","580":"a2a4","581":"a5c5","582":"a5f5","583":"a6d6","584":"a8b6","585":"b4b2","586":"b4c5","587":"b5b6","588":"b5d6","589":"b5d7","590":"b6a4","591":"b6a6","592":"b6d8","593":"b6e3","594":"b7e7","595":"b8b3","596":"b8b4","597":"b8f8","598":"c2f2","599":"c2f5","600":"c3b2","601":"c3e4","602":"c4b2","603":"c4b4","604":"c4c2","605":"c4d2","606":"c6c2","607":"c6d6","608":"c6e6","609":"c7a7","610":"c7b5","611":"c8c5","612":"d1f1","613":"d1h5","614":"d2b2","615":"d2d1","616":"d3c2","617":"d4b3","618":"d4c6","619":"d5d1","620":"d5e6","621":"d7b7","622":"e3c1","623":"e3e6","624":"e4e5","625":"e5e6","626":"e5g5","627":"e6e7","628":"e6g4","629":"e6h6","630":"e8b8","631":"e8g6","632":"e8h5","633":"f2e2","634":"f3e4","635":"f5e3","636":"f5h5","637":"f6a6","638":"f6f3","639":"f6f8","640":"f8d7","641":"g2g1q","642":"g3f2","643":"g4e5","644":"g4h2","645":"g4h4","646":"g4h6","647":"g5e3","648":"g5f3","649":"g6d6","650":"g7h8","651":"g8d8","652":"h1h2","653":"h2g3","654":"h2h3","655":"h3g4","656":"h3h4","657":"h5h3","658":"h8h6","659":"a1a2","660":"a1b1","661":"a1f1","662":"a2e6","663":"a4c2","664":"a5d5","665":"a6c4","666":"a6c5","667":"a6e6","668":"a7b8","669":"a8a5","670":"a8a6","671":"b1c2","672":"b2a3","673":"b2c1","674":"b2c4","675":"b2e2","676":"b2f6","677":"b2g7","678":"b3a3","679":"b3b5","680":"b3c3","681":"b3e3","682":"b5c6","683":"b6b4","684":"b6b7","685":"b6c8","686":"b7c8","687":"b8e5","688":"c1b1","689":"c2c1q","690":"c3c1","691":"c3h3","692":"c4a4","693":"c4d5","694":"c4e4","695":"c4e5","696":"c5c3","697":"c5d7","698":"c6a6","699":"c6b6","700":"c6e8","701":"c7a6","702":"c7c1","703":"c7h2","704":"c8d6","705":"c8g8","706":"c8h3","707":"d2d3","708":"d2e1","709":"d2f3","710":"d3b3","711":"d3e3","712":"d3e4","713":"d3f2","714":"d4d2","715":"d4d5","716":"d4f5","717":"d5a5","718":"d5c6","719":"d5d8","720":"d6f5","721":"d7b8","722":"e1c3","723":"e1d1","724":"e1f1","725":"e3e1","726":"e4c4","727":"e4c5","728":"e4e1","729":"e5d7","730":"e6e2","731":"e6f4","732":"e6g6","733":"e8a8","734":"e8g7","735":"f2f4","736":"f4d2","737":"f4e6","738":"f4g4","739":"f7h5","740":"f8a3","741":"f8g6","742":"g1f2","743":"g1g5","744":"g3f5","745":"g4c8","746":"g4g6","747":"g5g3","748":"g6h4","749":"g8c8","750":"g8g6","751":"h5d1","752":"h5f6","753":"h5h2","754":"h7d3","755":"h8a8","756":"a1a8","757":"a2d2","758":"a2e2","759":"a3a4","760":"a4a1","761":"a4a2","762":"a4c6","763":"a5d2","764":"a5g5","765":"a6b7","766":"a6d3","767":"a7a3","768":"a8f3","769":"b1c1","770":"b2b4","771":"b3b4","772":"b4c2","773":"b4d2","774":"b5b7","775":"b5c5","776":"b6a7","777":"b7b2","778":"b7b3","779":"b7f3","780":"b7g2","781":"b8b5","782":"b8g3","783":"c1c2","784":"c1g1","785":"c2a2","786":"c2c3","787":"c2d2","788":"c2g2","789":"c3a3","790":"c3b3","791":"c3c5","792":"c3e5","793":"c4b6","794":"c4d6","795":"c5a6","796":"c5c6","797":"c6c4","798":"c6e4","799":"c7e8","800":"d1g1","801":"d1h1","802":"d2c2","803":"d3a6","804":"d3b1","805":"d3c1","806":"d3d5","807":"d4b4","808":"d4f2","809":"d5a2","810":"d5b5","811":"d5g5","812":"d6a3","813":"d6b5","814":"d6g6","815":"d7a7","816":"d7d3","817":"d7g7","818":"e1a1","819":"e2c1","820":"e2d3","821":"e2d4","822":"e2e6","823":"e2f2","824":"e3b6","825":"e3d1","826":"e3d3","827":"e3g3","828":"e4e2","829":"e5b2","830":"e5b8","831":"e5e3","832":"e6a2","833":"e6d4","834":"e6e8","835":"e7h7","836":"e8c6","837":"e8h8","838":"f1d1","839":"f1f4","840":"f2a2","841":"f2d4","842":"f2f1","843":"f2g1","844":"f2g4","845":"f2h2","846":"f3e2","847":"f3e5","848":"f3f1","849":"f3g4","850":"f3h1","851":"f3h3","852":"f4d6","853":"f4e2","854":"f4h3","855":"f5c8","856":"f5f2","857":"f6c3","858":"f7d5","859":"f7f4","860":"f8h6","861":"g1f1","862":"g2d2","863":"g2e4","864":"g3e2","865":"g3g1","866":"g3g4","867":"g3g5","868":"g5d2","869":"g5e7","870":"g5g1","871":"g5g2","872":"g5g7","873":"g6c6","874":"g6e6","875":"g6f4","876":"g6f8","877":"g6g4","878":"g7c3","879":"g7g3","880":"g8g1","881":"g8g4","882":"h1g2","883":"h2b2","884":"h2f2","885":"h2g2","886":"h4d4","887":"h4d8","888":"h4e1","889":"h4f3","890":"h4f4","891":"h4h1","892":"h5f5","893":"h5h6","894":"h6d2","895":"h7d7","896":"h7e4","897":"a1a4","898":"a1e1","899":"a2b1","900":"a2c2","901":"a2f2","902":"a3c2","903":"a3c5","904":"a3e3","905":"a3e7","906":"a4a6","907":"a4b5","908":"a4c5","909":"a4d1","910":"a4d4","911":"a5a2","912":"a5c3","913":"a6b6","914":"a7c7","915":"b1d1","916":"b1e1","917":"b1g6","918":"b2b1q","919":"b2d3","920":"b2h2","921":"b3a4","922":"b3b1","923":"b3b6","924":"b3c4","925":"b3d4","926":"b3h3","927":"b4a4","928":"b4d4","929":"b4d5","930":"b4e7","931":"b5b2","932":"b5b3","933":"b5d5","934":"b6f2","935":"b7c7","936":"b7e4","937":"b7h1","938":"b8h8","939":"c1a1","940":"c1a3","941":"c1b2","942":"c1d2","943":"c2a1","944":"c2a3","945":"c2a4","946":"c2c5","947":"c2d1","948":"c3d2","949":"c3f6","950":"c4a2","951":"c4c5","952":"c4c6","953":"c4c8","954":"c4f1","955":"c4h4","956":"c5c2","957":"c5c8","958":"c5e7","959":"c6a7","960":"c6f3","961":"c6g2","962":"c7c3","963":"d1c1","964":"d1d2","965":"d2e3","966":"d2h2","967":"d3c5","968":"d3e2","969":"d3f4","970":"d4b5","971":"d4b6","972":"d4c2","973":"d4d8","974":"d4g4","975":"d5a8","976":"d5c7","977":"d5e7","978":"d5h1","979":"d6b6","980":"d6d2","981":"d6d3","982":"d6d8","983":"d6f8","984":"d7d4","985":"e1e6","986":"e1g1","987":"e1h4","988":"e2a2","989":"e2b2","990":"e2c4","991":"e2e4","992":"e2g3","993":"e3b3","994":"e3c2","995":"e3d4","996":"e3f1","997":"e3h3","998":"e3h6","999":"e4e8","1000":"e4g4","1001":"e4h4","1002":"e5e1","1003":"e5f7","1004":"e5g7","1005":"e6a6","1006":"e6b3","1007":"e6c6","1008":"e6e3","1009":"e7b7","1010":"e7c8","1011":"f1f5","1012":"f1f7","1013":"f1f8","1014":"f2b6","1015":"f2d1","1016":"f2e4","1017":"f2f5","1018":"f2h1","1019":"f3b3","1020":"f3d2","1021":"f3d4","1022":"f3d5","1023":"f3f5","1024":"f3f7","1025":"f4c7","1026":"f4d5","1027":"f4h6","1028":"f5b1","1029":"f6f4","1030":"f6h8","1031":"f7c7","1032":"f7d7","1033":"f7e5","1034":"f7f2","1035":"g1a1","1036":"g1e1","1037":"g1g2","1038":"g2f1","1039":"g2f3","1040":"g2g5","1041":"g2h1","1042":"g3c3","1043":"g3e4","1044":"g3g7","1045":"g3h1","1046":"g4f4","1047":"g5d5","1048":"g6b1","1049":"g6c2","1050":"g6e8","1051":"g6g1","1052":"g7f5","1053":"g8b8","1054":"h1a1","1055":"h1e4","1056":"h1f3","1057":"h1h3","1058":"h3f1","1059":"h4c4","1060":"h4f5","1061":"h4g2","1062":"h5a5","1063":"h5f7","1064":"h5h7","1065":"h5h8","1066":"h6f4","1067":"h6f5","1068":"h6h3","1069":"h7f5","1070":"h7f7","1071":"h7f8","1072":"h7h1","1073":"h8e5","1074":"h8g6","1075":"a1a6","1076":"a1b2","1077":"a1g1","1078":"a1h1","1079":"a2a6","1080":"a2b3","1081":"a2c4","1082":"a2d5","1083":"a2h2","1084":"a3a8","1085":"a3b2","1086":"a3c4","1087":"a3d3","1088":"a3g3","1089":"a3h3","1090":"a4a5","1091":"a4c3","1092":"a4c4","1093":"a5c6","1094":"a5d8","1095":"a5e5","1096":"a5h5","1097":"a6a4","1098":"a6c6","1099":"a6c8","1100":"a6e2","1101":"a7a1","1102":"a7a2","1103":"a7b5","1104":"a7c6","1105":"a7d7","1106":"a7e3","1107":"a7e7","1108":"a7f7","1109":"a7h7","1110":"a8b7","1111":"b1a1","1112":"b1b4","1113":"b1b5","1114":"b1b8","1115":"b1f1","1116":"b1f5","1117":"b2a4","1118":"b2b8","1119":"b2d4","1120":"b2f2","1121":"b3a2","1122":"b3b7","1123":"b3c2","1124":"b3c5","1125":"b4a2","1126":"b4a6","1127":"b4b1","1128":"b4b5","1129":"b4b6","1130":"b4e4","1131":"b5c7","1132":"b5d3","1133":"b5d4","1134":"b5f5","1135":"b6e6","1136":"b7f7","1137":"c1b3","1138":"c1c6","1139":"c1e1","1140":"c1e3","1141":"c1h1","1142":"c2b3","1143":"c2c4","1144":"c2d4","1145":"c2e1","1146":"c2e2","1147":"c3a4","1148":"c3b5","1149":"c3c6","1150":"c3c7","1151":"c3e2","1152":"c3e3","1153":"c3g7","1154":"c4a3","1155":"c4a6","1156":"c4c1","1157":"c4e2","1158":"c4e6","1159":"c4f4","1160":"c5a4","1161":"c5a7","1162":"c5b7","1163":"c5c1","1164":"c5c7","1165":"c6b8","1166":"c6c1","1167":"c6c3","1168":"c6g6","1169":"c7f7","1170":"c8a7","1171":"c8b6","1172":"d1a1","1173":"d1c2","1174":"d1d6","1175":"d1d7","1176":"d1f3","1177":"d2c4","1178":"d2e4","1179":"d2g5","1180":"d3b5","1181":"d3d1","1182":"d3d7","1183":"d3e1","1184":"d3f1","1185":"d3g3","1186":"d3h3","1187":"d4a1","1188":"d4b2","1189":"d4d1","1190":"d4e6","1191":"d4g1","1192":"d5d3","1193":"d5d7","1194":"d6e8","1195":"d6f7","1196":"d8e6","1197":"d8f7","1198":"e1b1","1199":"e1c1","1200":"e1e2","1201":"e1g3","1202":"e1h1","1203":"e2c2","1204":"e2d1","1205":"e2e5","1206":"e2f1","1207":"e2f1q","1208":"e2f3","1209":"e2g2","1210":"e3c3","1211":"e3f3","1212":"e3f5","1213":"e3g2","1214":"e3g4","1215":"e4c6","1216":"e4f5","1217":"e4h1","1218":"e5a5","1219":"e5b5","1220":"e5e7","1221":"e5e8","1222":"e6e4","1223":"e6f8","1224":"e6g7","1225":"e7e1","1226":"e7e2","1227":"e8b5","1228":"f1b5","1229":"f1c1","1230":"f1d3","1231":"f1e2","1232":"f1f2","1233":"f1f3","1234":"f1g2","1235":"f1g3","1236":"f2b2","1237":"f2d2","1238":"f2e1","1239":"f2f7","1240":"f2h4","1241":"f3a3","1242":"f3c3","1243":"f3e1","1244":"f3e3","1245":"f3f8","1246":"f4f1","1247":"f4f2","1248":"f4g2","1249":"f5a5","1250":"f5f1","1251":"f5f7","1252":"f5g3","1253":"f6d6","1254":"f6f1","1255":"f6g8","1256":"f7f3","1257":"f7g5","1258":"f8h7","1259":"g1b1","1260":"g1d1","1261":"g2e3","1262":"g2g8","1263":"g3e5","1264":"g3f1","1265":"g4a4","1266":"g4c4","1267":"g4g2","1268":"g5a5","1269":"g5c1","1270":"g5c5","1271":"g5e5","1272":"g5f7","1273":"g5h3","1274":"g6e7","1275":"g6g3","1276":"g7c7","1277":"g7d7","1278":"g7e6","1279":"g7g1","1280":"g7g4","1281":"g8c4","1282":"h1b1","1283":"h1c6","1284":"h1e1","1285":"h1f2","1286":"h1h4","1287":"h1h8","1288":"h2a2","1289":"h2d2","1290":"h2e2","1291":"h2f1","1292":"h2g1","1293":"h2g4","1294":"h3c8","1295":"h3d3","1296":"h3e6","1297":"h3f4","1298":"h4h6","1299":"h5g7","1300":"h6c1","1301":"h6h2","1302":"h7h2","1303":"h7h4","1304":"h8b8","1305":"a1c3","1306":"a1d1","1307":"a1e5","1308":"a1f6","1309":"a1h8","1310":"a2c1","1311":"a2g2","1312":"a3a1","1313":"a3a5","1314":"a3a7","1315":"a3b5","1316":"a3d6","1317":"a3f3","1318":"a4a8","1319":"a4d7","1320":"a4e4","1321":"a4e8","1322":"a4f4","1323":"a4g4","1324":"a5a1","1325":"a5a7","1326":"a6a2","1327":"a6a3","1328":"a6f1","1329":"a6f6","1330":"a7c8","1331":"a7g7","1332":"a8c6","1333":"a8c7","1334":"a8e4","1335":"b1b7","1336":"b1d2","1337":"b1d3","1338":"b1e4","1339":"b1g1","1340":"b1h1","1341":"b2a1","1342":"b2b1n","1343":"b2b5","1344":"b2b7","1345":"b2e5","1346":"b2g2","1347":"b3a5","1348":"b3d1","1349":"b3d3","1350":"b4b7","1351":"b4b8","1352":"b4e1","1353":"b4f8","1354":"b5a3","1355":"b5a7","1356":"b5b8","1357":"b5c3","1358":"b5e5","1359":"b5e8","1360":"b5f1","1361":"b6b1","1362":"b6b8","1363":"b6f6","1364":"b6g1","1365":"b6g6","1366":"b7b1","1367":"b7b4","1368":"b7c5","1369":"b7d7","1370":"b7d8","1371":"b8g8","1372":"c1a2","1373":"c1c5","1374":"c1c8","1375":"c1d3","1376":"c1e2","1377":"c1f1","1378":"c2b1","1379":"c2c7","1380":"c2c8","1381":"c2e3","1382":"c2e4","1383":"c3a1","1384":"c3a2","1385":"c3a5","1386":"c3c8","1387":"c3d1","1388":"c3e1","1389":"c4f7","1390":"c5a3","1391":"c5a5","1392":"c5b3","1393":"c5e5","1394":"c5f8","1395":"c5g5","1396":"c5h5","1397":"c6a4","1398":"c6a8","1399":"c6c8","1400":"c6f6","1401":"c6h1","1402":"c7h7","1403":"c8e7","1404":"c8h8","1405":"d1b1","1406":"d1d3","1407":"d1d5","1408":"d1d8","1409":"d1e3","1410":"d2b3","1411":"d2c1","1412":"d2c3","1413":"d2d7","1414":"d2d8","1415":"d2f1","1416":"d2f4","1417":"d2h6","1418":"d3a3","1419":"d3b4","1420":"d3d6","1421":"d3f3","1422":"d3g6","1423":"d3h7","1424":"d4a4","1425":"d4a7","1426":"d4d7","1427":"d4f4","1428":"d4h8","1429":"d5b3","1430":"d5b7","1431":"d5d2","1432":"d5f5","1433":"d6a6","1434":"d6c8","1435":"d6d1","1436":"d6h6","1437":"d7h7","1438":"d8b7","1439":"e1c2","1440":"e1d2","1441":"e1e7","1442":"e2c3","1443":"e2e1n","1444":"e2e7","1445":"e2g4","1446":"e2h2","1447":"e3a3","1448":"e3a7","1449":"e3c4","1450":"e3d2","1451":"e3d5","1452":"e3e7","1453":"e3g1","1454":"e4a4","1455":"e4b1","1456":"e4b4","1457":"e4e6","1458":"e4e7","1459":"e4h7","1460":"e5a1","1461":"e5e2","1462":"e5h2","1463":"e6b6","1464":"f1c4","1465":"f1e3","1466":"f1h2","1467":"f2c5","1468":"f2d3","1469":"f2e1q","1470":"f2f8","1471":"f2h3","1472":"f3b7","1473":"f3c6","1474":"f3d1","1475":"f3d3","1476":"f3f6","1477":"f3h2","1478":"f4a4","1479":"f4b8","1480":"f4c4","1481":"f4d4","1482":"f4f7","1483":"f4g6","1484":"f4h2","1485":"f4h5","1486":"f5b5","1487":"f5d5","1488":"f5e7","1489":"f6b6","1490":"f6c6","1491":"f7a2","1492":"f7b7","1493":"f7f1","1494":"f7h7","1495":"g1c1","1496":"g1g3","1497":"g1g6","1498":"g1g7","1499":"g1h2","1500":"g2a2","1501":"g2b2","1502":"g2b7","1503":"g2c2","1504":"g2e1","1505":"g2e2","1506":"g2g4","1507":"g2h1q","1508":"g2h3","1509":"g3b3","1510":"g3b8","1511":"g3c7","1512":"g3d3","1513":"g3d6","1514":"g3e3","1515":"g4d4","1516":"g4g8","1517":"g5b5","1518":"g5d8","1519":"g5e6","1520":"g5g8","1521":"g7a1","1522":"g7a7","1523":"g7e7","1524":"g7e8","1525":"g8a8","1526":"g8b3","1527":"g8e6","1528":"h1c1","1529":"h1d5","1530":"h1h5","1531":"h1h7","1532":"h2c2","1533":"h2c7","1534":"h2e5","1535":"h2f3","1536":"h2h1n","1537":"h2h8","1538":"h3c3","1539":"h3f2","1540":"h3h6","1541":"h3h7","1542":"h3h8","1543":"h4a4","1544":"h4h7","1545":"h5c5","1546":"h5d5","1547":"h5h1","1548":"h6e3","1549":"h6e6","1550":"h6f8","1551":"h6g8","1552":"h6h1","1553":"h6h4","1554":"h7c7","1555":"h7h3","1556":"h8d4","1557":"h8f6"},"vocab_size":1558,"top_moves":[["g8f6",570],["c7c6",510],["d7d5",503],["e7e6",478],["e8g8",416],["b8c6",306],["c8g4",290],["b8d7",283],["h7h6",280],["g7g6",258],["f8d6",240],["f6e4",223],["c6d5",208],["a7a6",206],["f8e7",203],["d5e4",198],["d7d6",164],["c8f5",162],["f8g7",160],["f7f5",158],["a8c8",153],["h7h5",146],["f8e8",145],["c6c5",144],["e7f6",140],["f7f6",140],["e6e5",139],["c5d4",128],["e6d5",128],["g4f3",125],["g8h8",125],["c7c5",120],["b7b6",117],["g7f6",114],["b7b5",110],["d8e7",110],["g7g5",107],["d8c7",106],["h5h4",100],["e7e5",99],["a8b8",97],["c8d7",97],["e7d6",97],["a7a5",94],["e8c8",94],["g6g5",92],["f5e4",91],["f6f5",90],["g5g4",89],["d8d7",88],["d7f6",87],["d6e5",86],["g8g7",86],["h6h5",86],["h7g6",86],["f5f4",85],["f6d5",85],["f7e6",82],["g8h7",81],["g4h5",78],["c6e5",77],["d7e5",77],["h8g8",77],["b7c6",75],["d8b6",72],["a8d8",71],["e5e4",71],["b5b4",69],["d5d4",69],["d7b6",68],["f6d7",67],["d8d6",66],["c6d4",65],["e5d4",64],["d6e7",63],["h4h3",63],["f8d8",62],["a8e8",60],["d5c4",60],["e6f5",60],["a6a5",59],["c8b8",59],["e8e7",59],["f8g8",59],["a5a4",58],["f6g5",58],["c8b7",56],["d8c8",56],["f6e5",56],["g8f8",56],["c8c7",55],["d8e8",55],["f5g6",55],["f7g6",55],["d8f6",54],["g6f5",53],["h5g4",53],["f6g4",52],["d6d5",51],["f4f3",51]]}