{"move_to_index":{"d2d4":0,"e2e3":1,"c1f4":2,"g1f3":3,"c2c3":4,"b1d2":5,"f1d3":6,"e1g1":7,"f3e5":8,"d4e5":9,"f1e2":10,"d1d3":11,"f4e5":12,"f4g3":13,"h2h3":14,"e3e4":15,"a1c1":16,"a2a3":17,"d2e4":18,"d3f5":19,"e1c1":20,"e2h5":21,"f1e1":22,"a2a4":23,"b2b4":24,"b6c6":25,"c1c2":26,"c2c4":27,"c4c5":28,"d1b3":29,"d1d2":30,"d1f3":31,"d2d3":32,"d2d5":33,"d2f1":34,"d2f3":35,"e2f3":36,"e4d5":37,"e5g6":38,"e5g7":39,"f2f3":40,"f2f4":41,"f3d2":42,"f3e2":43,"f4d6":44,"f4g5":45,"g1e2":46,"g1g2":47,"g2g3":48,"h1h7":49,"h2h4":50,"a1b1":51,"a1e1":52,"a4a5":53,"a4b3":54,"b1b6":55,"b1c1":56,"b1c3":57,"b2b3":58,"b2c3":59,"b3b4":60,"b3b6":61,"b3c5":62,"b4b5":63,"b5a6":64,"c1b2":65,"c1c4":66,"c1e1":67,"c2e4":68,"c2g2":69,"c3c4":70,"c3d4":71,"c5c6":72,"c5e4":73,"c5e7":74,"c6b6":75,"c6c1":76,"c6c7":77,"c7d6":78,"d1a4":79,"d1e2":80,"d1h1":81,"d1h5":82,"d2b3":83,"d2e2":84,"d3b5":85,"d3c2":86,"d3d4":87,"d3e5":88,"d3h7":89,"d4c5":90,"d4d5":91,"d5d6":92,"d5f5":93,"d5f7":94,"d6e5":95,"d6g3":96,"d8c7":97,"e1d2":98,"e1e4":99,"e1e5":100,"e2c4":101,"e2d3":102,"e2e4":103,"e2f4":104,"e3d4":105,"e3f4":106,"e4d2":107,"e4d6":108,"e4e5":109,"e5c6":110,"e5f6":111,"f1c1":112,"f1d1":113,"f1g3":114,"f2f1":115,"f2h4":116,"f3f5":117,"f3g5":118,"f4d3":119,"f5f6":120,"f6f8":121,"f7d6":122,"g1f2":123,"g2g4":124,"g3c7":125,"g3d6":126,"g3e5":127,"g3f2":128,"g3f5":129,"g4g5":130,"g5d8":131,"g5g6":132,"g6g7":133,"g6h8":134,"g7d4":135,"g7e5":136,"g7g8q":137,"g8g7":138,"h1b1":139,"h1g1":140,"h3g4":141,"h4g3":142,"h4h5":143,"h4h7":144,"h5e2":145,"h5h7":146,"h7f7":147,"h7g7":148,"h7h1":149,"h7h4":150,"h7h8":151,"h8e5":152,"h8f7":153},"index_to_move":{"0":"d2d4","1":"e2e3","2":"c1f4","3":"g1f3","4":"c2c3","5":"b1d2","6":"f1d3","7":"e1g1","8":"f3e5","9":"d4e5","10":"f1e2","11":"d1d3","12":"f4e5","13":"f4g3","14":"h2h3","15":"e3e4","16":"a1c1","17":"a2a3","18":"d2e4","19":"d3f5","20":"e1c1","21":"e2h5","22":"f1e1","23":"a2a4","24":"b2b4","25":"b6c6","26":"c1c2","27":"c2c4","28":"c4c5","29":"d1b3","30":"d1d2","31":"d1f3","32":"d2d3","33":"d2d5","34":"d2f1","35":"d2f3","36":"e2f3","37":"e4d5","38":"e5g6","39":"e5g7","40":"f2f3","41":"f2f4","42":"f3d2","43":"f3e2","44":"f4d6","45":"f4g5","46":"g1e2","47":"g1g2","48":"g2g3","49":"h1h7","50":"h2h4","51":"a1b1","52":"a1e1","53":"a4a5","54":"a4b3","55":"b1b6","56":"b1c1","57":"b1c3","58":"b2b3","59":"b2c3","60":"b3b4","61":"b3b6","62":"b3c5","63":"b4b5","64":"b5a6","65":"c1b2","66":"c1c4","67":"c1e1","68":"c2e4","69":"c2g2","70":"c3c4","71":"c3d4","72":"c5c6","73":"c5e4","74":"c5e7","75":"c6b6","76":"c6c1","77":"c6c7","78":"c7d6","79":"d1a4","80":"d1e2","81":"d1h1","82":"d1h5","83":"d2b3","84":"d2e2","85":"d3b5","86":"d3c2","87":"d3d4","88":"d3e5","89":"d3h7","90":"d4c5","91":"d4d5","92":"d5d6","93":"d5f5","94":"d5f7","95":"d6e5","96":"d6g3","97":"d8c7","98":"e1d2","99":"e1e4","100":"e1e5","101":"e2c4","102":"e2d3","103":"e2e4","104":"e2f4","105":"e3d4","106":"e3f4","107":"e4d2","108":"e4d6","109":"e4e5","110":"e5c6","111":"e5f6","112":"f1c1","113":"f1d1","114":"f1g3","115":"f2f1","116":"f2h4","117":"f3f5","118":"f3g5","119":"f4d3","120":"f5f6","121":"f6f8","122":"f7d6","123":"g1f2","124":"g2g4","125":"g3c7","126":"g3d6","127":"g3e5","128":"g3f2","129":"g3f5","130":"g4g5","131":"g5d8","132":"g5g6","133":"g6g7","134":"g6h8","135":"g7d4","136":"g7e5","137":"g7g8q","138":"g8g7","139":"h1b1","140":"h1g1","141":"h3g4","142":"h4g3","143":"h4h5","144":"h4h7","145":"h5e2","146":"h5h7","147":"h7f7","148":"h7g7","149":"h7h1","150":"h7h4","151":"h7h8","152":"h8e5","153":"h8f7"},"vocab_size":154,"top_moves":[["d2d4",22],["e2e3",21],["c1f4",20],["g1f3",15],["c2c3",13],["b1d2",12],["f1d3",11],["e1g1",7],["f3e5",7],["d4e5",6],["f1e2",6],["d1d3",5],["f4e5",5],["f4g3",5],["h2h3",5],["e3e4",4],["a1c1",3],["a2a3",3],["d2e4",3],["d3f5",3],["e1c1",3],["e2h5",3],["f1e1",3],["a2a4",2],["b2b4",2],["b6c6",2],["c1c2",2],["c2c4",2],["c4c5",2],["d1b3",2],["d1d2",2],["d1f3",2],["d2d3",2],["d2d5",2],["d2f1",2],["d2f3",2],["e2f3",2],["e4d5",2],["e5g6",2],["e5g7",2],["f2f3",2],["f2f4",2],["f3d2",2],["f3e2",2],["f4d6",2],["f4g5",2],["g1e2",2],["g1g2",2],["g2g3",2],["h1h7",2],["h2h4",2],["a1b1",1],["a1e1",1],["a4a5",1],["a4b3",1],["b1b6",1],["b1c1",1],["b1c3",1],["b2b3",1],["b2c3",1],["b3b4",1],["b3b6",1],["b3c5",1],["b4b5",1],["b5a6",1],["c1b2",1],["c1c4",1],["c1e1",1],["c2e4",1],["c2g2",1],["c3c4",1],["c3d4",1],["c5c6",1],["c5e4",1],["c5e7",1],["c6b6",1],["c6c1",1],["c6c7",1],["c7d6",1],["d1a4",1],["d1e2",1],["d1h1",1],["d1h5",1],["d2b3",1],["d2e2",1],["d3b5",1],["d3c2",1],["d3d4",1],["d3e5",1],["d3h7",1],["d4c5",1],["d4d5",1],["d5d6",1],["d5f5",1],["d5f7",1],["d6e5",1],["d6g3",1],["d8c7",1],["e1d2",1],["e1e4",1]]}