{"move_to_index":{"e2e3":0,"d2d4":1,"g1f3":2,"c1f4":3,"c2c3":4,"b1d2":5,"f3e5":6,"f1d3":7,"e1g1":8,"f4g3":9,"h2h3":10,"d4e5":11,"e1c1":12,"e3d4":13,"f2f4":14,"f4e5":15,"h2h4":16,"g2g4":17,"b1c3":18,"a2a3":19,"e3e4":20,"f1e2":21,"d2f3":22,"f2f3":23,"b2b3":24,"g2g3":25,"d2e4":26,"c2c4":27,"f1e1":28,"h4h5":29,"d1e2":30,"g4g5":31,"h2g3":32,"f4g5":33,"a1b1":34,"c3c4":35,"a2a4":36,"d1c2":37,"d4d5":38,"d1d2":39,"h3h4":40,"d3e4":41,"d1f3":42,"c1b1":43,"e5f6":44,"a1c1":45,"f3d4":46,"g3g4":47,"d1d3":48,"g1h1":49,"h1g1":50,"a4a5":51,"f3f4":52,"f3g5":53,"b2b4":54,"c4c5":55,"g3h4":56,"e2d3":57,"e2f3":58,"d3c2":59,"f4f5":60,"h5h6":61,"a1d1":62,"g2f3":63,"e4e5":64,"g1g2":65,"h5g6":66,"e1e2":67,"e2e4":68,"d4c5":69,"c1b2":70,"g1h2":71,"b4b5":72,"f1d1":73,"g3f4":74,"e3f4":75,"g5h4":76,"g5g6":77,"a1e1":78,"c3d4":79,"d2c4":80,"d3f5":81,"f3e4":82,"d2d3":83,"e4d5":84,"g5f6":85,"b3b4":86,"f2g3":87,"h4g3":88,"c3e4":89,"c3d5":90,"c4d5":91,"d1h5":92,"f1g2":93,"d1g1":94,"g1f2":95,"g3e5":96,"c1c2":97,"d3e2":98,"h4g5":99,"a5a6":100,"b2c3":101,"d3g6":102,"c1d2":103,"c1g5":104,"h1h2":105,"a3a4":106,"d1b3":107,"d1e1":108,"f3d2":109,"b1a1":110,"b1a3":111,"c5c6":112,"d5d6":113,"c2e4":114,"f2e3":115,"e2h5":116,"e3e2":117,"g1f1":118,"b5c6":119,"c2d3":120,"b5b6":121,"d1c1":122,"d3c4":123,"f3g4":124,"c6c7":125,"d1f1":126,"d2b3":127,"d3d4":128,"f3g3":129,"h1e1":130,"h6h7":131,"e5d6":132,"e5e6":133,"f3h4":134,"f5f6":135,"a6a7":136,"c3b4":137,"f1f2":138,"f3e3":139,"f4d6":140,"d1d4":141,"d1d5":142,"d1d8":143,"e2c4":144,"e5d7":145,"e1d2":146,"e2d2":147,"h1d1":148,"h3g4":149,"d2e2":150,"d6d7":151,"e1f1":152,"f1b5":153,"g4f5":154,"b3c4":155,"d1g4":156,"d2c3":157,"d3b5":158,"e4f5":159,"e5c6":160,"f3e2":161,"b6b7":162,"d2e3":163,"e5g7":164,"f1g1":165,"f3e1":166,"g2h3":167,"g3h3":168,"a1f1":169,"c3b5":170,"e4f6":171,"f1f3":172,"c1d1":173,"c2d2":174,"d1d7":175,"e1d1":176,"g5h6":177,"h1f1":178,"b1b2":179,"c1c7":180,"c2b3":181,"d1d6":182,"e2b5":183,"e5g6":184,"g3d6":185,"h2g2":186,"h3g3":187,"a4b5":188,"c4b5":189,"e3f3":190,"e4g5":191,"f1c1":192,"h2h1":193,"a3b4":194,"b1c1":195,"e2f2":196,"e2g4":197,"f6f7":198,"g4h5":199,"h1h7":200,"h6g7":201,"d1h1":202,"e1e5":203,"f4h6":204,"g3f2":205,"b7a7":206,"d3e3":207,"d3h7":208,"e1e8":209,"e4d6":210,"g3h2":211,"g5e7":212,"h1h6":213,"h4f6":214,"a3b5":215,"e4d3":216,"e5g3":217,"f2f1":218,"f3h2":219,"g5e6":220,"h1h3":221,"h2g1":222,"a2b3":223,"c4e5":224,"d3d2":225,"d5e6":226,"e5g4":227,"f1b1":228,"f3h3":229,"b4c5":230,"d1a4":231,"d2c2":232,"e1e3":233,"e2d1":234,"e3d3":235,"e4f3":236,"f3h5":237,"f4e3":238,"g2f1":239,"g4f4":240,"b2a3":241,"b5a4":242,"c2g6":243,"e1f2":244,"e5f7":245,"e6e7":246,"f1h1":247,"g2h2":248,"g6g7":249,"c1e3":250,"c5b5":251,"d3a6":252,"e1e4":253,"e3f2":254,"e5f3":255,"e8f8":256,"f3f2":257,"g3f3":258,"g5f7":259,"b3a4":260,"b4a5":261,"b5a6":262,"c2a4":263,"c2d1":264,"d2c1":265,"d4c6":266,"d4e6":267,"e2f1":268,"f1f7":269,"f2e2":270,"g6g5":271,"a4b3":272,"a5b6":273,"a7a8":274,"b1a2":275,"b1d1":276,"c2b1":277,"c3d3":278,"d4f5":279,"e1e6":280,"e2c2":281,"e2e1":282,"e4b7":283,"e4c2":284,"f1f6":285,"f2g2":286,"f3d5":287,"g1e2":288,"g1g4":289,"g2e4":290,"h1h4":291,"h1h5":292,"h4e7":293,"h6g5":294,"h7h8":295,"a1a2":296,"a1a6":297,"a3c2":298,"a7a8q":299,"b2e5":300,"c1e1":301,"c3e2":302,"d5c6":303,"d5c7":304,"e1e7":305,"f1c4":306,"f2e1":307,"g2f2":308,"g4f3":309,"g6h5":310,"h7g7":311,"a1b2":312,"a1g1":313,"a6b7":314,"a7b7":315,"b1b7":316,"b1c2":317,"b1e1":318,"b2a1":319,"b3d4":320,"b5c7":321,"b5d6":322,"b7b8q":323,"c1c5":324,"c2e3":325,"c2f5":326,"c4d6":327,"d2d1":328,"d4b5":329,"d4f3":330,"d5d7":331,"e1d3":332,"e2e5":333,"f1f4":334,"f1f5":335,"f3f7":336,"f5e6":337,"f5g6":338,"f6g7":339,"f7f6":340,"g4h3":341,"g5e4":342,"g6h6":343,"g6h7":344,"h2g4":345,"h4g6":346,"h5g4":347,"h5h8":348,"a4a3":349,"a6b5":350,"b3c2":351,"b3c3":352,"c1c3":353,"c2e2":354,"c4b3":355,"c7b7":356,"c7c6":357,"c7c8q":358,"d3c3":359,"d5d4":360,"d6c8":361,"e1h1":362,"e2g3":363,"e4c6":364,"e4g4":365,"e7e8":366,"f6d8":367,"f6e5":368,"f7e6":369,"h1b1":370,"h4f5":371,"h7g6":372,"a4b4":373,"a6a5":374,"b1b6":375,"b3c5":376,"b5c4":377,"b5d4":378,"b5d7":379,"b7b6":380,"c1c8":381,"c2f2":382,"c3b3":383,"c3d2":384,"c4d3":385,"c5d4":386,"c7f7":387,"d2f1":388,"d4e4":389,"d6d5":390,"e1f3":391,"e2a6":392,"e2e6":393,"e3c4":394,"e4e3":395,"e5d5":396,"e5f4":397,"f3g2":398,"f4f3":399,"f4g4":400,"f4h2":401,"f8e8":402,"g1g7":403,"g4e6":404,"g4g3":405,"g5f4":406,"g6e7":407,"h4h6":408,"a5b5":409,"a6b6":410,"a7a6":411,"b3b2":412,"b3d5":413,"b5b4":414,"b5c3":415,"b6c5":416,"c2c1":417,"c5c7":418,"c6a6":419,"c7d5":420,"c8c7":421,"d3e5":422,"d3f4":423,"d4e3":424,"d7f7":425,"d8d7":426,"d8f6":427,"e2h2":428,"e3e5":429,"e3e6":430,"e4c5":431,"e4d4":432,"e5d3":433,"e5e4":434,"e6f6":435,"e7d7":436,"f1a1":437,"f2g1":438,"f4f6":439,"f6e7":440,"g1g6":441,"g3c7":442,"g3e4":443,"g3g2":444,"g4h4":445,"g5h3":446,"g7h7":447,"h1a1":448,"h2f4":449,"h3e6":450,"h3h2":451,"h4g4":452,"h5h4":453,"h6g6":454,"h6h8":455,"a2a1":456,"a2b2":457,"a4c2":458,"a5b4":459,"a6a8":460,"a8b8":461,"b1b3":462,"b2d4":463,"b2g7":464,"b3b6":465,"b4c3":466,"b5e8":467,"b7c7":468,"b8e5":469,"c1c6":470,"c2b4":471,"c2c5":472,"c3a4":473,"c6b5":474,"c6c8":475,"c7a7":476,"c7c8":477,"c7d6":478,"d1a1":479,"d2b2":480,"d2d5":481,"d2f2":482,"d3g3":483,"d4d1":484,"d4f4":485,"d5c4":486,"d5f6":487,"d6f8":488,"d7d8q":489,"d8g5":490,"e1c2":491,"e2f4":492,"e3d5":493,"e3h6":494,"e4d2":495,"e5b8":496,"e5c4":497,"e5d4":498,"e5f5":499,"e6e5":500,"e6f4":501,"e6h3":502,"e8d8":503,"f1f8":504,"f4d3":505,"f4h4":506,"f5d5":507,"f5g4":508,"f7d6":509,"f7f8q":510,"f8f7":511,"g1e1":512,"g1g5":513,"g2g1":514,"g3g5":515,"g5f3":516,"g6f5":517,"g6f6":518,"g6f7":519,"g8f8":520,"h4f3":521,"h5e2":522,"h5f5":523,"h5g5":524,"h5h7":525,"h6f4":526,"a1a8":527,"a4a7":528,"a4e8":529,"a6a4":530,"a7f7":531,"b2c2":532,"b5a5":533,"b5d3":534,"b6a5":535,"b6a6":536,"b6c6":537,"b6c7":538,"b7c8":539,"b7f7":540,"b8b7":541,"c1c4":542,"c2b2":543,"c2c7":544,"c4e2":545,"c4e6":546,"c5b4":547,"c5b6":548,"c5d6":549,"c6b6":550,"c6d6":551,"c7d8":552,"c8c6":553,"c8e8":554,"c8h8":555,"d1b1":556,"d1e3":557,"d2d7":558,"d2d8":559,"d2e1":560,"d2g5":561,"d3b1":562,"d3f3":563,"d4a4":564,"d4c3":565,"d4d7":566,"d4e2":567,"d5c5":568,"d5d3":569,"d5e4":570,"d5e5":571,"d5e7":572,"d5f4":573,"d6d8":574,"d6e5":575,"d6e7":576,"d6g3":577,"d7c7":578,"d7d8":579,"d7e7":580,"d8d6":581,"e2d4":582,"e3b6":583,"e3g5":584,"e4g6":585,"e5e8":586,"e6e8":587,"e6f7":588,"e6g6":589,"e7d6":590,"e8b8":591,"f1d2":592,"f2c2":593,"f3d1":594,"f3d3":595,"f4d5":596,"f5d3":597,"f6e6":598,"f6f5":599,"f6g6":600,"f7e7":601,"f7f8":602,"g2c6":603,"g3e1":604,"g4e2":605,"g5d8":606,"g5h5":607,"g5h7":608,"g6c2":609,"g6f8":610,"g7f7":611,"g7g6":612,"h1c1":613,"h1h8":614,"h2f3":615,"h3g2":616,"h4f4":617,"h4h3":618,"h5e5":619,"h5f3":620,"h5f7":621,"h6f6":622,"h8h7":623,"a2b1":624,"a4d4":625,"a7a5":626,"a8d5":627,"b1b5":628,"b1d3":629,"b3a3":630,"b3b7":631,"b3c1":632,"b3d2":633,"b3e3":634,"b4b3":635,"b4b7":636,"b4c4":637,"b4d5":638,"b4d6":639,"b5b7":640,"b5c5":641,"b5e2":642,"b6b5":643,"b7a6":644,"b7b8":645,"b7e7":646,"b8c8":647,"c1d3":648,"c2c8":649,"c2d4":650,"c2h7":651,"c4a3":652,"c4b6":653,"c4c3":654,"c4c8":655,"c4d4":656,"c4e4":657,"c4f7":658,"c5c2":659,"c5c4":660,"c5d3":661,"c5d5":662,"c5e4":663,"c5h5":664,"c6b7":665,"c8b8":666,"d2f4":667,"d3b4":668,"d3d6":669,"d4d3":670,"d4f6":671,"d4h8":672,"d5b5":673,"d5d8":674,"d6c5":675,"d6e8":676,"d6f4":677,"d7a7":678,"d7c6":679,"d7d5":680,"d7d6":681,"d8e8":682,"e1b1":683,"e1c3":684,"e2e7":685,"e3d2":686,"e4h4":687,"e5b2":688,"e5c5":689,"e5e2":690,"e5e7":691,"e6f5":692,"e7b7":693,"e7h7":694,"e8c8":695,"e8e7":696,"f2f7":697,"f2h4":698,"f3c6":699,"f3f6":700,"f4d2":701,"f4e2":702,"f4e4":703,"f4f7":704,"f5e4":705,"f7a7":706,"f7g7":707,"g1c1":708,"g1g3":709,"g1g8":710,"g1h3":711,"g2d5":712,"g2g6":713,"g3g6":714,"g4e3":715,"g4e5":716,"g5g7":717,"g6e6":718,"g6h8":719,"g7f6":720,"g8h8":721,"h1g2":722,"h2d6":723,"h2e5":724,"h3g5":725,"h3h1":726,"h4d8":727,"h6h4":728,"h6h5":729,"h7e7":730,"h7f7":731,"h8c8":732,"h8e5":733,"h8g8":734,"a1a5":735,"a1a7":736,"a1h1":737,"a3b3":738,"a3c4":739,"a3d6":740,"a4a6":741,"a4c6":742,"a4d7":743,"a5a4":744,"a5c5":745,"a7a1":746,"a8a4":747,"a8a7":748,"a8e8":749,"a8f8":750,"b1b4":751,"b1b8":752,"b1e4":753,"b1f1":754,"b1g1":755,"b2a2":756,"b2b6":757,"b2e2":758,"b3b1":759,"b3d1":760,"b4c2":761,"b4e7":762,"b5a3":763,"b5d5":764,"b6d6":765,"b6e6":766,"b7b5":767,"b7e4":768,"b7g7":769,"c1a1":770,"c3c2":771,"c3c5":772,"c3d1":773,"c3e5":774,"c3g7":775,"c4b4":776,"c5d7":777,"c5e6":778,"c6c5":779,"c6d5":780,"c6e6":781,"c7a8":782,"c7d7":783,"c7e8":784,"c7g7":785,"c8d7":786,"d2b4":787,"d2d6":788,"d3b3":789,"d3c5":790,"d3e1":791,"d4d2":792,"d4g7":793,"d5c3":794,"d5e3":795,"d5g5":796,"d6a3":797,"d6e6":798,"d6f7":799,"d7h7":800,"d8f8":801,"e1g2":802,"e3g3":803,"e3h3":804,"e4e6":805,"e5c3":806,"e5e3":807,"e6c7":808,"e6d4":809,"e6d6":810,"e7e8q":811,"e7f6":812,"e7f7":813,"f1e3":814,"f1h3":815,"f2d3":816,"f2d4":817,"f3b7":818,"f4g6":819,"f5c2":820,"f5c8":821,"f5d7":822,"f5e7":823,"f5f8":824,"f5g5":825,"f6f4":826,"f6g5":827,"f6h5":828,"f6h6":829,"f7d7":830,"f8g8":831,"g2g7":832,"g2h1":833,"g4c8":834,"g4f6":835,"g4g2":836,"g4h6":837,"g5d2":838,"g5e3":839,"g5f5":840,"g6e5":841,"g6e8":842,"g7e7":843,"g7g8q":844,"h2e2":845,"h2h6":846,"h3d7":847,"h3e3":848,"h3f4":849,"h3h5":850,"h3h6":851,"h4f2":852,"h4h7":853,"h5h1":854,"h7h6":855,"h8f6":856,"h8f8":857,"a1a3":858,"a2d2":859,"a3c5":860,"a3e7":861,"a4a8":862,"a4c3":863,"a5b3":864,"a5c6":865,"a6c6":866,"a7a3":867,"a7d7":868,"a8a1":869,"a8a6":870,"a8c6":871,"a8c8":872,"a8d8":873,"a8h8":874,"b2b7":875,"b2b8":876,"b2c1":877,"b3a2":878,"b3a5":879,"b3e6":880,"b4a4":881,"b4d3":882,"b4f4":883,"b5b3":884,"b6b8":885,"b6d4":886,"b7d7":887,"b7g2":888,"b8a8":889,"b8b6":890,"b8f4":891,"c1a3":892,"c1f1":893,"c1h1":894,"c2e1":895,"c3b1":896,"c4a4":897,"c4a6":898,"c4c6":899,"c4c7":900,"c4e3":901,"c6d7":902,"c6f6":903,"c6g2":904,"c7a5":905,"c7b6":906,"c7c4":907,"c7d8q":908,"c7g3":909,"c8a8":910,"c8f5":911,"d3d1":912,"d3d5":913,"d3f1":914,"d4b2":915,"d4b4":916,"d4b6":917,"d4c4":918,"d4d6":919,"d4f2":920,"d5b3":921,"d5f3":922,"d5f5":923,"d5h5":924,"d6a6":925,"d6c4":926,"d6c6":927,"d6c7":928,"d6e4":929,"d7b7":930,"d7d2":931,"d7d3":932,"d7d4":933,"d8a8":934,"d8d2":935,"e1b4":936,"e1h4":937,"e2b2":938,"e2c1":939,"e2e8":940,"e2g2":941,"e3b3":942,"e3c5":943,"e3g4":944,"e4b4":945,"e4c3":946,"e4e2":947,"e4e7":948,"e4f2":949,"e4f4":950,"e4g2":951,"e4g3":952,"e5c7":953,"e5e1":954,"e5h2":955,"e5h5":956,"e6b6":957,"e6c5":958,"e6d5":959,"e6e2":960,"e6e3":961,"e6f8":962,"e6g4":963,"e6h6":964,"e7a7":965,"e7c7":966,"e7d5":967,"e7e6":968,"e7f5":969,"e7g6":970,"e7g7":971,"e8a8":972,"e8e6":973,"e8g6":974,"e8g8":975,"f2d2":976,"f4b8":977,"f4c7":978,"f4d4":979,"f5e5":980,"f5h5":981,"f6e8":982,"f6f1":983,"f6f3":984,"f7b7":985,"f7e5":986,"f7e8":987,"f7f2":988,"f7g6":989,"f7h7":990,"f7h8":991,"f8d8":992,"g1a1":993,"g1d4":994,"g1e3":995,"g2b7":996,"g2e2":997,"g3e3":998,"g3f5":999,"g4d4":1000,"g4d7":1001,"g4e4":1002,"g4h2":1003,"g5e5":1004,"g5g4":1005,"g5g8":1006,"g6e4":1007,"g6g1":1008,"g6g4":1009,"g6g8":1010,"g6h4":1011,"g7f8":1012,"g7g8":1013,"g7h6":1014,"h2f2":1015,"h3h7":1016,"h4g2":1017,"h4h2":1018,"h5d1":1019,"h5d5":1020,"h5e8":1021,"h5h2":1022,"h7b7":1023,"h7c2":1024,"h7d3":1025,"h7d7":1026,"h7h8q":1027,"h8a8":1028,"h8g7":1029,"h8h6":1030,"a1a4":1031,"a1e5":1032,"a2a6":1033,"a2a7":1034,"a2c3":1035,"a3a2":1036,"a3a6":1037,"a3a7":1038,"a3b2":1039,"a3c3":1040,"a4a2":1041,"a4c4":1042,"a5a2":1043,"a5a7":1044,"a5a8":1045,"a5b7":1046,"a5d8":1047,"a5g5":1048,"a6b4":1049,"a6c4":1050,"a6d3":1051,"a6e6":1052,"a6f6":1053,"a7b5":1054,"a7b6":1055,"a7c7":1056,"a7f2":1057,"a7h7":1058,"a8b7":1059,"a8f3":1060,"a8g8":1061,"b1f5":1062,"b2b1":1063,"b2d2":1064,"b3b5":1065,"b3b8":1066,"b3f3":1067,"b3f7":1068,"b4a3":1069,"b4a6":1070,"b4b2":1071,"b4b6":1072,"b4d2":1073,"b4e4":1074,"b4g4":1075,"b5b8":1076,"b5e5":1077,"b6a4":1078,"b6b1":1079,"b6b3":1080,"b6c4":1081,"b6g1":1082,"b7a8":1083,"b7c5":1084,"b8b4":1085,"b8c7":1086,"b8d6":1087,"b8e8":1088,"b8f8":1089,"b8g8":1090,"c1e2":1091,"c1h6":1092,"c2c6":1093,"c2g2":1094,"c3a2":1095,"c3a3":1096,"c3c1":1097,"c3c7":1098,"c3e3":1099,"c3f6":1100,"c3h8":1101,"c4a2":1102,"c4a5":1103,"c4c2":1104,"c4d2":1105,"c5b7":1106,"c5c3":1107,"c5e3":1108,"c5e5":1109,"c5e7":1110,"c5f8":1111,"c6a4":1112,"c6a5":1113,"c6a7":1114,"c6b4":1115,"c6b8":1116,"c6d8":1117,"c6e4":1118,"c6e5":1119,"c6e7":1120,"c6e8":1121,"c6g6":1122,"c7a6":1123,"c7e6":1124,"c7f4":1125,"c7h7":1126,"c8c3":1127,"c8d8":1128,"c8e7":1129,"c8f8":1130,"c8g8":1131,"d1b2":1132,"d1c3":1133,"d2a2":1134,"d2b1":1135,"d2h2":1136,"d3d8":1137,"d3f2":1138,"d3h3":1139,"d4b3":1140,"d4c2":1141,"d4d8":1142,"d5a5":1143,"d5a8":1144,"d5f7":1145,"d6b4":1146,"d6b5":1147,"d6b6":1148,"d6b7":1149,"d6d2":1150,"d6d4":1151,"d6f6":1152,"d6g6":1153,"d7a4":1154,"d7b5":1155,"d7f6":1156,"d7g7":1157,"d8c8":1158,"d8d5":1159,"d8e7":1160,"e1a1":1161,"e1g3":1162,"e2g1":1163,"e3c2":1164,"e3c3":1165,"e3d1":1166,"e3f5":1167,"e4a4":1168,"e4e8":1169,"e4h7":1170,"e5a1":1171,"e6a6":1172,"e6d7":1173,"e6d8":1174,"e6e4":1175,"e6g7":1176,"e6g8":1177,"e7c6":1178,"e7e4":1179,"e7e5":1180,"e7f8":1181,"e7g5":1182,"e8b5":1183,"e8c7":1184,"e8d7":1185,"e8e4":1186,"e8f7":1187,"e8g7":1188,"e8h8":1189,"f1a6":1190,"f1g3":1191,"f2e4":1192,"f2f5":1193,"f2h2":1194,"f3b3":1195,"f3c3":1196,"f3g1":1197,"f4f1":1198,"f4f8":1199,"f4h3":1200,"f4h5":1201,"f5c5":1202,"f5e3":1203,"f5f4":1204,"f5g7":1205,"f5h6":1206,"f5h7":1207,"f6c6":1208,"f6h4":1209,"f6h8":1210,"f7d8":1211,"f7h6":1212,"f8a8":1213,"f8c8":1214,"f8e7":1215,"f8f1":1216,"g1b1":1217,"g1d1":1218,"g2a8":1219,"g2b2":1220,"g2f4":1221,"g3g1":1222,"g3g7":1223,"g4b4":1224,"g4c4":1225,"g4g6":1226,"g4g7":1227,"g5b5":1228,"g5g2":1229,"g6f4":1230,"g7a7":1231,"g7b7":1232,"g7c3":1233,"g7e5":1234,"g7e6":1235,"g7g4":1236,"g8a8":1237,"g8g7":1238,"h1e4":1239,"h1g3":1240,"h2a2":1241,"h2h8":1242,"h3c8":1243,"h3d3":1244,"h3f1":1245,"h3f3":1246,"h4d4":1247,"h5f6":1248,"h5g3":1249,"h5h3":1250,"h6g4":1251,"h6h3":1252,"h7a7":1253,"h7g8":1254,"h8e8":1255,"h8h3":1256,"h8h4":1257,"h8h5":1258,"a1c2":1259,"a1c3":1260,"a1d4":1261,"a1g7":1262,"a2e6":1263,"a2f2":1264,"a3a8":1265,"a3d3":1266,"a4a1":1267,"a4b2":1268,"a4b6":1269,"a4c5":1270,"a4d1":1271,"a4e4":1272,"a4g4":1273,"a4h4":1274,"a5c3":1275,"a5c7":1276,"a5d2":1277,"a6a3":1278,"a6b8":1279,"a6c8":1280,"a6d6":1281,"a6f1":1282,"a6g6":1283,"a7a4":1284,"a7b8":1285,"a7c5":1286,"a7e7":1287,"a7g7":1288,"a8a5":1289,"a8e4":1290,"a8g2":1291,"b1h1":1292,"b2b5":1293,"b2d1":1294,"b2d3":1295,"b2f2":1296,"b2f6":1297,"b2h8":1298,"b3d3":1299,"b3g3":1300,"b4b1":1301,"b4b8":1302,"b4c6":1303,"b5f1":1304,"b5f5":1305,"b5g5":1306,"b6b4":1307,"b6d8":1308,"b6e3":1309,"b7a5":1310,"b7a8q":1311,"b7b4":1312,"b7c6":1313,"b8b5":1314,"b8c6":1315,"b8h8":1316,"c1a2":1317,"c1b3":1318,"c1g1":1319,"c2a2":1320,"c2h2":1321,"c3a1":1322,"c3a5":1323,"c3c8":1324,"c3e1":1325,"c3f3":1326,"c3g3":1327,"c3h3":1328,"c4b2":1329,"c4f1":1330,"c5a3":1331,"c5a5":1332,"c5a6":1333,"c5c8":1334,"c6a8":1335,"c6c3":1336,"c6d4":1337,"c7b5":1338,"c7b8":1339,"c7c5":1340,"c7e5":1341,"c8a6":1342,"c8a7":1343,"c8b6":1344,"c8b7":1345,"c8c1":1346,"c8c2":1347,"c8h3":1348,"d2a5":1349,"d2h6":1350,"d4g1":1351,"d4g4":1352,"d4h4":1353,"d5b4":1354,"d5b7":1355,"d5g2":1356,"d6h6":1357,"d7b6":1358,"d7c5":1359,"d7e6":1360,"d7e8":1361,"d8b8":1362,"d8c6":1363,"d8d3":1364,"d8g8":1365,"d8h4":1366,"d8h8":1367,"e1a5":1368,"e2a2":1369,"e2c3":1370,"e3c1":1371,"e3e1":1372,"e3e8":1373,"e3f1":1374,"e4b1":1375,"e4e1":1376,"e5a5":1377,"e5b5":1378,"e5h8":1379,"e6c6":1380,"e6e1":1381,"e6g5":1382,"e7b4":1383,"e7d8":1384,"e7e1":1385,"e7e2":1386,"e7e3":1387,"e7g8":1388,"e7h4":1389,"e8c6":1390,"e8e3":1391,"f1h2":1392,"f2a7":1393,"f2b2":1394,"f2c5":1395,"f2f6":1396,"f3a8":1397,"f3f1":1398,"f3f5":1399,"f3h1":1400,"f4a4":1401,"f4c1":1402,"f4f2":1403,"f5b5":1404,"f5d6":1405,"f5f2":1406,"f5f7":1407,"f5g3":1408,"f6a6":1409,"f6d5":1410,"f6e4":1411,"f6g4":1412,"f6g8":1413,"f7d5":1414,"f7e8q":1415,"f7f1":1416,"f7f3":1417,"f7f8n":1418,"f7g5":1419,"f7g8":1420,"f8a3":1421,"f8b8":1422,"f8d6":1423,"f8f3":1424,"f8f6":1425,"f8g7":1426,"f8h6":1427,"g1a7":1428,"g2d2":1429,"g2e1":1430,"g2g5":1431,"g2g8":1432,"g3b3":1433,"g3b8":1434,"g3c3":1435,"g3d3":1436,"g3f1":1437,"g3h1":1438,"g3h5":1439,"g4g8":1440,"g5c5":1441,"g5d5":1442,"g5g1":1443,"g6b6":1444,"g6d3":1445,"g6d6":1446,"g6g2":1447,"g6g3":1448,"g7d7":1449,"g7f5":1450,"g7g1":1451,"g7h8q":1452,"g8c8":1453,"g8d8":1454,"g8e6":1455,"g8f7":1456,"g8g5":1457,"g8g6":1458,"h1a8":1459,"h1d5":1460,"h1f3":1461,"h2b8":1462,"h2f1":1463,"h2h7":1464,"h3a3":1465,"h3c3":1466,"h3f2":1467,"h3f5":1468,"h3g1":1469,"h3h8":1470,"h4c4":1471,"h4e1":1472,"h4e4":1473,"h4h1":1474,"h4h8":1475,"h5c5":1476,"h5f4":1477,"h6a6":1478,"h6c6":1479,"h6e3":1480,"h6e6":1481,"h6f7":1482,"h6h2":1483,"h7c7":1484,"h7e4":1485,"h7f5":1486,"h7f6":1487,"h7f8":1488,"h7g5":1489,"h7h1":1490,"h7h5":1491,"h8b2":1492,"h8b8":1493,"h8d8":1494,"h8f7":1495,"h8g6":1496,"h8h1":1497},"index_to_move":{"0":"e2e3","1":"d2d4","2":"g1f3","3":"c1f4","4":"c2c3","5":"b1d2","6":"f3e5","7":"f1d3","8":"e1g1","9":"f4g3","10":"h2h3","11":"d4e5","12":"e1c1","13":"e3d4","14":"f2f4","15":"f4e5","16":"h2h4","17":"g2g4","18":"b1c3","19":"a2a3","20":"e3e4","21":"f1e2","22":"d2f3","23":"f2f3","24":"b2b3","25":"g2g3","26":"d2e4","27":"c2c4","28":"f1e1","29":"h4h5","30":"d1e2","31":"g4g5","32":"h2g3","33":"f4g5","34":"a1b1","35":"c3c4","36":"a2a4","37":"d1c2","38":"d4d5","39":"d1d2","40":"h3h4","41":"d3e4","42":"d1f3","43":"c1b1","44":"e5f6","45":"a1c1","46":"f3d4","47":"g3g4","48":"d1d3","49":"g1h1","50":"h1g1","51":"a4a5","52":"f3f4","53":"f3g5","54":"b2b4","55":"c4c5","56":"g3h4","57":"e2d3","58":"e2f3","59":"d3c2","60":"f4f5","61":"h5h6","62":"a1d1","63":"g2f3","64":"e4e5","65":"g1g2","66":"h5g6","67":"e1e2","68":"e2e4","69":"d4c5","70":"c1b2","71":"g1h2","72":"b4b5","73":"f1d1","74":"g3f4","75":"e3f4","76":"g5h4","77":"g5g6","78":"a1e1","79":"c3d4","80":"d2c4","81":"d3f5","82":"f3e4","83":"d2d3","84":"e4d5","85":"g5f6","86":"b3b4","87":"f2g3","88":"h4g3","89":"c3e4","90":"c3d5","91":"c4d5","92":"d1h5","93":"f1g2","94":"d1g1","95":"g1f2","96":"g3e5","97":"c1c2","98":"d3e2","99":"h4g5","100":"a5a6","101":"b2c3","102":"d3g6","103":"c1d2","104":"c1g5","105":"h1h2","106":"a3a4","107":"d1b3","108":"d1e1","109":"f3d2","110":"b1a1","111":"b1a3","112":"c5c6","113":"d5d6","114":"c2e4","115":"f2e3","116":"e2h5","117":"e3e2","118":"g1f1","119":"b5c6","120":"c2d3","121":"b5b6","122":"d1c1","123":"d3c4","124":"f3g4","125":"c6c7","126":"d1f1","127":"d2b3","128":"d3d4","129":"f3g3","130":"h1e1","131":"h6h7","132":"e5d6","133":"e5e6","134":"f3h4","135":"f5f6","136":"a6a7","137":"c3b4","138":"f1f2","139":"f3e3","140":"f4d6","141":"d1d4","142":"d1d5","143":"d1d8","144":"e2c4","145":"e5d7","146":"e1d2","147":"e2d2","148":"h1d1","149":"h3g4","150":"d2e2","151":"d6d7","152":"e1f1","153":"f1b5","154":"g4f5","155":"b3c4","156":"d1g4","157":"d2c3","158":"d3b5","159":"e4f5","160":"e5c6","161":"f3e2","162":"b6b7","163":"d2e3","164":"e5g7","165":"f1g1","166":"f3e1","167":"g2h3","168":"g3h3","169":"a1f1","170":"c3b5","171":"e4f6","172":"f1f3","173":"c1d1","174":"c2d2","175":"d1d7","176":"e1d1","177":"g5h6","178":"h1f1","179":"b1b2","180":"c1c7","181":"c2b3","182":"d1d6","183":"e2b5","184":"e5g6","185":"g3d6","186":"h2g2","187":"h3g3","188":"a4b5","189":"c4b5","190":"e3f3","191":"e4g5","192":"f1c1","193":"h2h1","194":"a3b4","195":"b1c1","196":"e2f2","197":"e2g4","198":"f6f7","199":"g4h5","200":"h1h7","201":"h6g7","202":"d1h1","203":"e1e5","204":"f4h6","205":"g3f2","206":"b7a7","207":"d3e3","208":"d3h7","209":"e1e8","210":"e4d6","211":"g3h2","212":"g5e7","213":"h1h6","214":"h4f6","215":"a3b5","216":"e4d3","217":"e5g3","218":"f2f1","219":"f3h2","220":"g5e6","221":"h1h3","222":"h2g1","223":"a2b3","224":"c4e5","225":"d3d2","226":"d5e6","227":"e5g4","228":"f1b1","229":"f3h3","230":"b4c5","231":"d1a4","232":"d2c2","233":"e1e3","234":"e2d1","235":"e3d3","236":"e4f3","237":"f3h5","238":"f4e3","239":"g2f1","240":"g4f4","241":"b2a3","242":"b5a4","243":"c2g6","244":"e1f2","245":"e5f7","246":"e6e7","247":"f1h1","248":"g2h2","249":"g6g7","250":"c1e3","251":"c5b5","252":"d3a6","253":"e1e4","254":"e3f2","255":"e5f3","256":"e8f8","257":"f3f2","258":"g3f3","259":"g5f7","260":"b3a4","261":"b4a5","262":"b5a6","263":"c2a4","264":"c2d1","265":"d2c1","266":"d4c6","267":"d4e6","268":"e2f1","269":"f1f7","270":"f2e2","271":"g6g5","272":"a4b3","273":"a5b6","274":"a7a8","275":"b1a2","276":"b1d1","277":"c2b1","278":"c3d3","279":"d4f5","280":"e1e6","281":"e2c2","282":"e2e1","283":"e4b7","284":"e4c2","285":"f1f6","286":"f2g2","287":"f3d5","288":"g1e2","289":"g1g4","290":"g2e4","291":"h1h4","292":"h1h5","293":"h4e7","294":"h6g5","295":"h7h8","296":"a1a2","297":"a1a6","298":"a3c2","299":"a7a8q","300":"b2e5","301":"c1e1","302":"c3e2","303":"d5c6","304":"d5c7","305":"e1e7","306":"f1c4","307":"f2e1","308":"g2f2","309":"g4f3","310":"g6h5","311":"h7g7","312":"a1b2","313":"a1g1","314":"a6b7","315":"a7b7","316":"b1b7","317":"b1c2","318":"b1e1","319":"b2a1","320":"b3d4","321":"b5c7","322":"b5d6","323":"b7b8q","324":"c1c5","325":"c2e3","326":"c2f5","327":"c4d6","328":"d2d1","329":"d4b5","330":"d4f3","331":"d5d7","332":"e1d3","333":"e2e5","334":"f1f4","335":"f1f5","336":"f3f7","337":"f5e6","338":"f5g6","339":"f6g7","340":"f7f6","341":"g4h3","342":"g5e4","343":"g6h6","344":"g6h7","345":"h2g4","346":"h4g6","347":"h5g4","348":"h5h8","349":"a4a3","350":"a6b5","351":"b3c2","352":"b3c3","353":"c1c3","354":"c2e2","355":"c4b3","356":"c7b7","357":"c7c6","358":"c7c8q","359":"d3c3","360":"d5d4","361":"d6c8","362":"e1h1","363":"e2g3","364":"e4c6","365":"e4g4","366":"e7e8","367":"f6d8","368":"f6e5","369":"f7e6","370":"h1b1","371":"h4f5","372":"h7g6","373":"a4b4","374":"a6a5","375":"b1b6","376":"b3c5","377":"b5c4","378":"b5d4","379":"b5d7","380":"b7b6","381":"c1c8","382":"c2f2","383":"c3b3","384":"c3d2","385":"c4d3","386":"c5d4","387":"c7f7","388":"d2f1","389":"d4e4","390":"d6d5","391":"e1f3","392":"e2a6","393":"e2e6","394":"e3c4","395":"e4e3","396":"e5d5","397":"e5f4","398":"f3g2","399":"f4f3","400":"f4g4","401":"f4h2","402":"f8e8","403":"g1g7","404":"g4e6","405":"g4g3","406":"g5f4","407":"g6e7","408":"h4h6","409":"a5b5","410":"a6b6","411":"a7a6","412":"b3b2","413":"b3d5","414":"b5b4","415":"b5c3","416":"b6c5","417":"c2c1","418":"c5c7","419":"c6a6","420":"c7d5","421":"c8c7","422":"d3e5","423":"d3f4","424":"d4e3","425":"d7f7","426":"d8d7","427":"d8f6","428":"e2h2","429":"e3e5","430":"e3e6","431":"e4c5","432":"e4d4","433":"e5d3","434":"e5e4","435":"e6f6","436":"e7d7","437":"f1a1","438":"f2g1","439":"f4f6","440":"f6e7","441":"g1g6","442":"g3c7","443":"g3e4","444":"g3g2","445":"g4h4","446":"g5h3","447":"g7h7","448":"h1a1","449":"h2f4","450":"h3e6","451":"h3h2","452":"h4g4","453":"h5h4","454":"h6g6","455":"h6h8","456":"a2a1","457":"a2b2","458":"a4c2","459":"a5b4","460":"a6a8","461":"a8b8","462":"b1b3","463":"b2d4","464":"b2g7","465":"b3b6","466":"b4c3","467":"b5e8","468":"b7c7","469":"b8e5","470":"c1c6","471":"c2b4","472":"c2c5","473":"c3a4","474":"c6b5","475":"c6c8","476":"c7a7","477":"c7c8","478":"c7d6","479":"d1a1","480":"d2b2","481":"d2d5","482":"d2f2","483":"d3g3","484":"d4d1","485":"d4f4","486":"d5c4","487":"d5f6","488":"d6f8","489":"d7d8q","490":"d8g5","491":"e1c2","492":"e2f4","493":"e3d5","494":"e3h6","495":"e4d2","496":"e5b8","497":"e5c4","498":"e5d4","499":"e5f5","500":"e6e5","501":"e6f4","502":"e6h3","503":"e8d8","504":"f1f8","505":"f4d3","506":"f4h4","507":"f5d5","508":"f5g4","509":"f7d6","510":"f7f8q","511":"f8f7","512":"g1e1","513":"g1g5","514":"g2g1","515":"g3g5","516":"g5f3","517":"g6f5","518":"g6f6","519":"g6f7","520":"g8f8","521":"h4f3","522":"h5e2","523":"h5f5","524":"h5g5","525":"h5h7","526":"h6f4","527":"a1a8","528":"a4a7","529":"a4e8","530":"a6a4","531":"a7f7","532":"b2c2","533":"b5a5","534":"b5d3","535":"b6a5","536":"b6a6","537":"b6c6","538":"b6c7","539":"b7c8","540":"b7f7","541":"b8b7","542":"c1c4","543":"c2b2","544":"c2c7","545":"c4e2","546":"c4e6","547":"c5b4","548":"c5b6","549":"c5d6","550":"c6b6","551":"c6d6","552":"c7d8","553":"c8c6","554":"c8e8","555":"c8h8","556":"d1b1","557":"d1e3","558":"d2d7","559":"d2d8","560":"d2e1","561":"d2g5","562":"d3b1","563":"d3f3","564":"d4a4","565":"d4c3","566":"d4d7","567":"d4e2","568":"d5c5","569":"d5d3","570":"d5e4","571":"d5e5","572":"d5e7","573":"d5f4","574":"d6d8","575":"d6e5","576":"d6e7","577":"d6g3","578":"d7c7","579":"d7d8","580":"d7e7","581":"d8d6","582":"e2d4","583":"e3b6","584":"e3g5","585":"e4g6","586":"e5e8","587":"e6e8","588":"e6f7","589":"e6g6","590":"e7d6","591":"e8b8","592":"f1d2","593":"f2c2","594":"f3d1","595":"f3d3","596":"f4d5","597":"f5d3","598":"f6e6","599":"f6f5","600":"f6g6","601":"f7e7","602":"f7f8","603":"g2c6","604":"g3e1","605":"g4e2","606":"g5d8","607":"g5h5","608":"g5h7","609":"g6c2","610":"g6f8","611":"g7f7","612":"g7g6","613":"h1c1","614":"h1h8","615":"h2f3","616":"h3g2","617":"h4f4","618":"h4h3","619":"h5e5","620":"h5f3","621":"h5f7","622":"h6f6","623":"h8h7","624":"a2b1","625":"a4d4","626":"a7a5","627":"a8d5","628":"b1b5","629":"b1d3","630":"b3a3","631":"b3b7","632":"b3c1","633":"b3d2","634":"b3e3","635":"b4b3","636":"b4b7","637":"b4c4","638":"b4d5","639":"b4d6","640":"b5b7","641":"b5c5","642":"b5e2","643":"b6b5","644":"b7a6","645":"b7b8","646":"b7e7","647":"b8c8","648":"c1d3","649":"c2c8","650":"c2d4","651":"c2h7","652":"c4a3","653":"c4b6","654":"c4c3","655":"c4c8","656":"c4d4","657":"c4e4","658":"c4f7","659":"c5c2","660":"c5c4","661":"c5d3","662":"c5d5","663":"c5e4","664":"c5h5","665":"c6b7","666":"c8b8","667":"d2f4","668":"d3b4","669":"d3d6","670":"d4d3","671":"d4f6","672":"d4h8","673":"d5b5","674":"d5d8","675":"d6c5","676":"d6e8","677":"d6f4","678":"d7a7","679":"d7c6","680":"d7d5","681":"d7d6","682":"d8e8","683":"e1b1","684":"e1c3","685":"e2e7","686":"e3d2","687":"e4h4","688":"e5b2","689":"e5c5","690":"e5e2","691":"e5e7","692":"e6f5","693":"e7b7","694":"e7h7","695":"e8c8","696":"e8e7","697":"f2f7","698":"f2h4","699":"f3c6","700":"f3f6","701":"f4d2","702":"f4e2","703":"f4e4","704":"f4f7","705":"f5e4","706":"f7a7","707":"f7g7","708":"g1c1","709":"g1g3","710":"g1g8","711":"g1h3","712":"g2d5","713":"g2g6","714":"g3g6","715":"g4e3","716":"g4e5","717":"g5g7","718":"g6e6","719":"g6h8","720":"g7f6","721":"g8h8","722":"h1g2","723":"h2d6","724":"h2e5","725":"h3g5","726":"h3h1","727":"h4d8","728":"h6h4","729":"h6h5","730":"h7e7","731":"h7f7","732":"h8c8","733":"h8e5","734":"h8g8","735":"a1a5","736":"a1a7","737":"a1h1","738":"a3b3","739":"a3c4","740":"a3d6","741":"a4a6","742":"a4c6","743":"a4d7","744":"a5a4","745":"a5c5","746":"a7a1","747":"a8a4","748":"a8a7","749":"a8e8","750":"a8f8","751":"b1b4","752":"b1b8","753":"b1e4","754":"b1f1","755":"b1g1","756":"b2a2","757":"b2b6","758":"b2e2","759":"b3b1","760":"b3d1","761":"b4c2","762":"b4e7","763":"b5a3","764":"b5d5","765":"b6d6","766":"b6e6","767":"b7b5","768":"b7e4","769":"b7g7","770":"c1a1","771":"c3c2","772":"c3c5","773":"c3d1","774":"c3e5","775":"c3g7","776":"c4b4","777":"c5d7","778":"c5e6","779":"c6c5","780":"c6d5","781":"c6e6","782":"c7a8","783":"c7d7","784":"c7e8","785":"c7g7","786":"c8d7","787":"d2b4","788":"d2d6","789":"d3b3","790":"d3c5","791":"d3e1","792":"d4d2","793":"d4g7","794":"d5c3","795":"d5e3","796":"d5g5","797":"d6a3","798":"d6e6","799":"d6f7","800":"d7h7","801":"d8f8","802":"e1g2","803":"e3g3","804":"e3h3","805":"e4e6","806":"e5c3","807":"e5e3","808":"e6c7","809":"e6d4","810":"e6d6","811":"e7e8q","812":"e7f6","813":"e7f7","814":"f1e3","815":"f1h3","816":"f2d3","817":"f2d4","818":"f3b7","819":"f4g6","820":"f5c2","821":"f5c8","822":"f5d7","823":"f5e7","824":"f5f8","825":"f5g5","826":"f6f4","827":"f6g5","828":"f6h5","829":"f6h6","830":"f7d7","831":"f8g8","832":"g2g7","833":"g2h1","834":"g4c8","835":"g4f6","836":"g4g2","837":"g4h6","838":"g5d2","839":"g5e3","840":"g5f5","841":"g6e5","842":"g6e8","843":"g7e7","844":"g7g8q","845":"h2e2","846":"h2h6","847":"h3d7","848":"h3e3","849":"h3f4","850":"h3h5","851":"h3h6","852":"h4f2","853":"h4h7","854":"h5h1","855":"h7h6","856":"h8f6","857":"h8f8","858":"a1a3","859":"a2d2","860":"a3c5","861":"a3e7","862":"a4a8","863":"a4c3","864":"a5b3","865":"a5c6","866":"a6c6","867":"a7a3","868":"a7d7","869":"a8a1","870":"a8a6","871":"a8c6","872":"a8c8","873":"a8d8","874":"a8h8","875":"b2b7","876":"b2b8","877":"b2c1","878":"b3a2","879":"b3a5","880":"b3e6","881":"b4a4","882":"b4d3","883":"b4f4","884":"b5b3","885":"b6b8","886":"b6d4","887":"b7d7","888":"b7g2","889":"b8a8","890":"b8b6","891":"b8f4","892":"c1a3","893":"c1f1","894":"c1h1","895":"c2e1","896":"c3b1","897":"c4a4","898":"c4a6","899":"c4c6","900":"c4c7","901":"c4e3","902":"c6d7","903":"c6f6","904":"c6g2","905":"c7a5","906":"c7b6","907":"c7c4","908":"c7d8q","909":"c7g3","910":"c8a8","911":"c8f5","912":"d3d1","913":"d3d5","914":"d3f1","915":"d4b2","916":"d4b4","917":"d4b6","918":"d4c4","919":"d4d6","920":"d4f2","921":"d5b3","922":"d5f3","923":"d5f5","924":"d5h5","925":"d6a6","926":"d6c4","927":"d6c6","928":"d6c7","929":"d6e4","930":"d7b7","931":"d7d2","932":"d7d3","933":"d7d4","934":"d8a8","935":"d8d2","936":"e1b4","937":"e1h4","938":"e2b2","939":"e2c1","940":"e2e8","941":"e2g2","942":"e3b3","943":"e3c5","944":"e3g4","945":"e4b4","946":"e4c3","947":"e4e2","948":"e4e7","949":"e4f2","950":"e4f4","951":"e4g2","952":"e4g3","953":"e5c7","954":"e5e1","955":"e5h2","956":"e5h5","957":"e6b6","958":"e6c5","959":"e6d5","960":"e6e2","961":"e6e3","962":"e6f8","963":"e6g4","964":"e6h6","965":"e7a7","966":"e7c7","967":"e7d5","968":"e7e6","969":"e7f5","970":"e7g6","971":"e7g7","972":"e8a8","973":"e8e6","974":"e8g6","975":"e8g8","976":"f2d2","977":"f4b8","978":"f4c7","979":"f4d4","980":"f5e5","981":"f5h5","982":"f6e8","983":"f6f1","984":"f6f3","985":"f7b7","986":"f7e5","987":"f7e8","988":"f7f2","989":"f7g6","990":"f7h7","991":"f7h8","992":"f8d8","993":"g1a1","994":"g1d4","995":"g1e3","996":"g2b7","997":"g2e2","998":"g3e3","999":"g3f5","1000":"g4d4","1001":"g4d7","1002":"g4e4","1003":"g4h2","1004":"g5e5","1005":"g5g4","1006":"g5g8","1007":"g6e4","1008":"g6g1","1009":"g6g4","1010":"g6g8","1011":"g6h4","1012":"g7f8","1013":"g7g8","1014":"g7h6","1015":"h2f2","1016":"h3h7","1017":"h4g2","1018":"h4h2","1019":"h5d1","1020":"h5d5","1021":"h5e8","1022":"h5h2","1023":"h7b7","1024":"h7c2","1025":"h7d3","1026":"h7d7","1027":"h7h8q","1028":"h8a8","1029":"h8g7","1030":"h8h6","1031":"a1a4","1032":"a1e5","1033":"a2a6","1034":"a2a7","1035":"a2c3","1036":"a3a2","1037":"a3a6","1038":"a3a7","1039":"a3b2","1040":"a3c3","1041":"a4a2","1042":"a4c4","1043":"a5a2","1044":"a5a7","1045":"a5a8","1046":"a5b7","1047":"a5d8","1048":"a5g5","1049":"a6b4","1050":"a6c4","1051":"a6d3","1052":"a6e6","1053":"a6f6","1054":"a7b5","1055":"a7b6","1056":"a7c7","1057":"a7f2","1058":"a7h7","1059":"a8b7","1060":"a8f3","1061":"a8g8","1062":"b1f5","1063":"b2b1","1064":"b2d2","1065":"b3b5","1066":"b3b8","1067":"b3f3","1068":"b3f7","1069":"b4a3","1070":"b4a6","1071":"b4b2","1072":"b4b6","1073":"b4d2","1074":"b4e4","1075":"b4g4","1076":"b5b8","1077":"b5e5","1078":"b6a4","1079":"b6b1","1080":"b6b3","1081":"b6c4","1082":"b6g1","1083":"b7a8","1084":"b7c5","1085":"b8b4","1086":"b8c7","1087":"b8d6","1088":"b8e8","1089":"b8f8","1090":"b8g8","1091":"c1e2","1092":"c1h6","1093":"c2c6","1094":"c2g2","1095":"c3a2","1096":"c3a3","1097":"c3c1","1098":"c3c7","1099":"c3e3","1100":"c3f6","1101":"c3h8","1102":"c4a2","1103":"c4a5","1104":"c4c2","1105":"c4d2","1106":"c5b7","1107":"c5c3","1108":"c5e3","1109":"c5e5","1110":"c5e7","1111":"c5f8","1112":"c6a4","1113":"c6a5","1114":"c6a7","1115":"c6b4","1116":"c6b8","1117":"c6d8","1118":"c6e4","1119":"c6e5","1120":"c6e7","1121":"c6e8","1122":"c6g6","1123":"c7a6","1124":"c7e6","1125":"c7f4","1126":"c7h7","1127":"c8c3","1128":"c8d8","1129":"c8e7","1130":"c8f8","1131":"c8g8","1132":"d1b2","1133":"d1c3","1134":"d2a2","1135":"d2b1","1136":"d2h2","1137":"d3d8","1138":"d3f2","1139":"d3h3","1140":"d4b3","1141":"d4c2","1142":"d4d8","1143":"d5a5","1144":"d5a8","1145":"d5f7","1146":"d6b4","1147":"d6b5","1148":"d6b6","1149":"d6b7","1150":"d6d2","1151":"d6d4","1152":"d6f6","1153":"d6g6","1154":"d7a4","1155":"d7b5","1156":"d7f6","1157":"d7g7","1158":"d8c8","1159":"d8d5","1160":"d8e7","1161":"e1a1","1162":"e1g3","1163":"e2g1","1164":"e3c2","1165":"e3c3","1166":"e3d1","1167":"e3f5","1168":"e4a4","1169":"e4e8","1170":"e4h7","1171":"e5a1","1172":"e6a6","1173":"e6d7","1174":"e6d8","1175":"e6e4","1176":"e6g7","1177":"e6g8","1178":"e7c6","1179":"e7e4","1180":"e7e5","1181":"e7f8","1182":"e7g5","1183":"e8b5","1184":"e8c7","1185":"e8d7","1186":"e8e4","1187":"e8f7","1188":"e8g7","1189":"e8h8","1190":"f1a6","1191":"f1g3","1192":"f2e4","1193":"f2f5","1194":"f2h2","1195":"f3b3","1196":"f3c3","1197":"f3g1","1198":"f4f1","1199":"f4f8","1200":"f4h3","1201":"f4h5","1202":"f5c5","1203":"f5e3","1204":"f5f4","1205":"f5g7","1206":"f5h6","1207":"f5h7","1208":"f6c6","1209":"f6h4","1210":"f6h8","1211":"f7d8","1212":"f7h6","1213":"f8a8","1214":"f8c8","1215":"f8e7","1216":"f8f1","1217":"g1b1","1218":"g1d1","1219":"g2a8","1220":"g2b2","1221":"g2f4","1222":"g3g1","1223":"g3g7","1224":"g4b4","1225":"g4c4","1226":"g4g6","1227":"g4g7","1228":"g5b5","1229":"g5g2","1230":"g6f4","1231":"g7a7","1232":"g7b7","1233":"g7c3","1234":"g7e5","1235":"g7e6","1236":"g7g4","1237":"g8a8","1238":"g8g7","1239":"h1e4","1240":"h1g3","1241":"h2a2","1242":"h2h8","1243":"h3c8","1244":"h3d3","1245":"h3f1","1246":"h3f3","1247":"h4d4","1248":"h5f6","1249":"h5g3","1250":"h5h3","1251":"h6g4","1252":"h6h3","1253":"h7a7","1254":"h7g8","1255":"h8e8","1256":"h8h3","1257":"h8h4","1258":"h8h5","1259":"a1c2","1260":"a1c3","1261":"a1d4","1262":"a1g7","1263":"a2e6","1264":"a2f2","1265":"a3a8","1266":"a3d3","1267":"a4a1","1268":"a4b2","1269":"a4b6","1270":"a4c5","1271":"a4d1","1272":"a4e4","1273":"a4g4","1274":"a4h4","1275":"a5c3","1276":"a5c7","1277":"a5d2","1278":"a6a3","1279":"a6b8","1280":"a6c8","1281":"a6d6","1282":"a6f1","1283":"a6g6","1284":"a7a4","1285":"a7b8","1286":"a7c5","1287":"a7e7","1288":"a7g7","1289":"a8a5","1290":"a8e4","1291":"a8g2","1292":"b1h1","1293":"b2b5","1294":"b2d1","1295":"b2d3","1296":"b2f2","1297":"b2f6","1298":"b2h8","1299":"b3d3","1300":"b3g3","1301":"b4b1","1302":"b4b8","1303":"b4c6","1304":"b5f1","1305":"b5f5","1306":"b5g5","1307":"b6b4","1308":"b6d8","1309":"b6e3","1310":"b7a5","1311":"b7a8q","1312":"b7b4","1313":"b7c6","1314":"b8b5","1315":"b8c6","1316":"b8h8","1317":"c1a2","1318":"c1b3","1319":"c1g1","1320":"c2a2","1321":"c2h2","1322":"c3a1","1323":"c3a5","1324":"c3c8","1325":"c3e1","1326":"c3f3","1327":"c3g3","1328":"c3h3","1329":"c4b2","1330":"c4f1","1331":"c5a3","1332":"c5a5","1333":"c5a6","1334":"c5c8","1335":"c6a8","1336":"c6c3","1337":"c6d4","1338":"c7b5","1339":"c7b8","1340":"c7c5","1341":"c7e5","1342":"c8a6","1343":"c8a7","1344":"c8b6","1345":"c8b7","1346":"c8c1","1347":"c8c2","1348":"c8h3","1349":"d2a5","1350":"d2h6","1351":"d4g1","1352":"d4g4","1353":"d4h4","1354":"d5b4","1355":"d5b7","1356":"d5g2","1357":"d6h6","1358":"d7b6","1359":"d7c5","1360":"d7e6","1361":"d7e8","1362":"d8b8","1363":"d8c6","1364":"d8d3","1365":"d8g8","1366":"d8h4","1367":"d8h8","1368":"e1a5","1369":"e2a2","1370":"e2c3","1371":"e3c1","1372":"e3e1","1373":"e3e8","1374":"e3f1","1375":"e4b1","1376":"e4e1","1377":"e5a5","1378":"e5b5","1379":"e5h8","1380":"e6c6","1381":"e6e1","1382":"e6g5","1383":"e7b4","1384":"e7d8","1385":"e7e1","1386":"e7e2","1387":"e7e3","1388":"e7g8","1389":"e7h4","1390":"e8c6","1391":"e8e3","1392":"f1h2","1393":"f2a7","1394":"f2b2","1395":"f2c5","1396":"f2f6","1397":"f3a8","1398":"f3f1","1399":"f3f5","1400":"f3h1","1401":"f4a4","1402":"f4c1","1403":"f4f2","1404":"f5b5","1405":"f5d6","1406":"f5f2","1407":"f5f7","1408":"f5g3","1409":"f6a6","1410":"f6d5","1411":"f6e4","1412":"f6g4","1413":"f6g8","1414":"f7d5","1415":"f7e8q","1416":"f7f1","1417":"f7f3","1418":"f7f8n","1419":"f7g5","1420":"f7g8","1421":"f8a3","1422":"f8b8","1423":"f8d6","1424":"f8f3","1425":"f8f6","1426":"f8g7","1427":"f8h6","1428":"g1a7","1429":"g2d2","1430":"g2e1","1431":"g2g5","1432":"g2g8","1433":"g3b3","1434":"g3b8","1435":"g3c3","1436":"g3d3","1437":"g3f1","1438":"g3h1","1439":"g3h5","1440":"g4g8","1441":"g5c5","1442":"g5d5","1443":"g5g1","1444":"g6b6","1445":"g6d3","1446":"g6d6","1447":"g6g2","1448":"g6g3","1449":"g7d7","1450":"g7f5","1451":"g7g1","1452":"g7h8q","1453":"g8c8","1454":"g8d8","1455":"g8e6","1456":"g8f7","1457":"g8g5","1458":"g8g6","1459":"h1a8","1460":"h1d5","1461":"h1f3","1462":"h2b8","1463":"h2f1","1464":"h2h7","1465":"h3a3","1466":"h3c3","1467":"h3f2","1468":"h3f5","1469":"h3g1","1470":"h3h8","1471":"h4c4","1472":"h4e1","1473":"h4e4","1474":"h4h1","1475":"h4h8","1476":"h5c5","1477":"h5f4","1478":"h6a6","1479":"h6c6","1480":"h6e3","1481":"h6e6","1482":"h6f7","1483":"h6h2","1484":"h7c7","1485":"h7e4","1486":"h7f5","1487":"h7f6","1488":"h7f8","1489":"h7g5","1490":"h7h1","1491":"h7h5","1492":"h8b2","1493":"h8b8","1494":"h8d8","1495":"h8f7","1496":"h8g6","1497":"h8h1"},"vocab_size":1498,"top_moves":[["e2e3",628],["d2d4",614],["g1f3",612],["c1f4",520],["c2c3",448],["b1d2",414],["f3e5",407],["f1d3",403],["e1g1",328],["f4g3",244],["h2h3",243],["d4e5",227],["e1c1",203],["e3d4",198],["f2f4",191],["f4e5",174],["h2h4",173],["g2g4",172],["b1c3",171],["a2a3",164],["e3e4",158],["f1e2",155],["d2f3",150],["f2f3",143],["b2b3",142],["g2g3",134],["d2e4",126],["c2c4",124],["f1e1",124],["h4h5",124],["d1e2",123],["g4g5",120],["h2g3",118],["f4g5",114],["a1b1",113],["c3c4",109],["a2a4",108],["d1c2",106],["d4d5",103],["d1d2",97],["h3h4",92],["d3e4",91],["d1f3",88],["c1b1",84],["e5f6",82],["a1c1",81],["f3d4",78],["g3g4",78],["d1d3",75],["g1h1",75],["h1g1",73],["a4a5",72],["f3f4",72],["f3g5",72],["b2b4",71],["c4c5",71],["g3h4",71],["e2d3",69],["e2f3",68],["d3c2",67],["f4f5",67],["h5h6",67],["a1d1",65],["g2f3",65],["e4e5",63],["g1g2",63],["h5g6",63],["e1e2",62],["e2e4",62],["d4c5",61],["c1b2",60],["g1h2",60],["b4b5",59],["f1d1",59],["g3f4",58],["e3f4",56],["g5h4",56],["g5g6",54],["a1e1",53],["c3d4",53],["d2c4",53],["d3f5",53],["f3e4",53],["d2d3",49],["e4d5",49],["g5f6",49],["b3b4",48],["f2g3",48],["h4g3",48],["c3e4",47],["c3d5",46],["c4d5",46],["d1h5",46],["f1g2",46],["d1g1",45],["g1f2",45],["g3e5",45],["c1c2",44],["d3e2",44],["h4g5",44]]}