{"move_to_index":{"e2e3":0,"g1f3":1,"d2d4":2,"c1f4":3,"e1g1":4,"c2c3":5,"f3e5":6,"b1d2":7,"f1d3":8,"e3e4":9,"d4e5":10,"f1e2":11,"h2h3":12,"b1c3":13,"f4g3":14,"e3d4":15,"g2g3":16,"a2a3":17,"a1b1":18,"h2g3":19,"d2f3":20,"f2f3":21,"c3c4":22,"d4d5":23,"f1e1":24,"d1e2":25,"f2f4":26,"h2h4":27,"c2c4":28,"g4g5":29,"b2b4":30,"d2e4":31,"e2f3":32,"f4e5":33,"b2b3":34,"e1e2":35,"f3f4":36,"f4g5":37,"h4h5":38,"a2a4":39,"e4e5":40,"g1h1":41,"g2g4":42,"g3g4":43,"d1d3":44,"e1c1":45,"f1c1":46,"f3d4":47,"g2f3":48,"a4a5":49,"b4b5":50,"c4c5":51,"d1f3":52,"e2e4":53,"f3g4":54,"d1d2":55,"e2d3":56,"e4d5":57,"h3h4":58,"a1c1":59,"a1d1":60,"b2c3":61,"c3d4":62,"d1b3":63,"d4c5":64,"e5e6":65,"f4e3":66,"f4f5":67,"g1f1":68,"g1h2":69,"g3f4":70,"g5g6":71,"h6h7":72,"b3b4":73,"d3g6":74,"e5f6":75,"f3g3":76,"f3g5":77,"h5h6":78,"a5a6":79,"c1b1":80,"d1h5":81,"d3e2":82,"d3e4":83,"f1d1":84,"f1g2":85,"f2e3":86,"f3h4":87,"h5g6":88,"a3a4":89,"a6a7":90,"c3e4":91,"d3b5":92,"d3c2":93,"e5d6":94,"f3d2":95,"f3e4":96,"h1g1":97,"h4g5":98,"b1d1":99,"c1b2":100,"c1c7":101,"c1g5":102,"c3b5":103,"c5c6":104,"d1d8":105,"e2c4":106,"e2f2":107,"e2h5":108,"e5d7":109,"e6e7":110,"f2g3":111,"g3h4":112,"g5f6":113,"h2g1":114,"a1f1":115,"c4d5":116,"c6c7":117,"d1a1":118,"d1c2":119,"d1g4":120,"d2d3":121,"e1d1":122,"e2d2":123,"f4d6":124,"g1f2":125,"g3d6":126,"g4f5":127,"g4h5":128,"h3g4":129,"a3b4":130,"b1a1":131,"b1b2":132,"b1c1":133,"b5b6":134,"c1d2":135,"d1d4":136,"d2e2":137,"d2h6":138,"d3c4":139,"e1e5":140,"e1f1":141,"e5g3":142,"f1c4":143,"f1f2":144,"f4g4":145,"g5h4":146,"g6g7":147,"h1e1":148,"h1h2":149,"h6g7":150,"a1e1":151,"a2b3":152,"b3c2":153,"b5c6":154,"b6b7":155,"c2e4":156,"c3a4":157,"c3e2":158,"c4b5":159,"c5b6":160,"d1d5":161,"d2e3":162,"d6e7":163,"e2b5":164,"e2g4":165,"e3f4":166,"e4f6":167,"f1b5":168,"f1g1":169,"f2f1":170,"f4h2":171,"f4h6":172,"f6e6":173,"f6g6":174,"g1e2":175,"g1g2":176,"g3e5":177,"g4f4":178,"g5e7":179,"h5f5":180,"a1a7":181,"a1a8":182,"b1b6":183,"b1b7":184,"b1f1":185,"b4a5":186,"b4c5":187,"b5c7":188,"b7f7":189,"c1c2":190,"c2b3":191,"c4b3":192,"c4d3":193,"c4e5":194,"c7c8q":195,"d1e1":196,"d2b3":197,"d2c4":198,"d2d1":199,"d5c6":200,"d5d6":201,"d5e6":202,"d6d7":203,"e1b1":204,"e1d2":205,"e1e3":206,"e1e7":207,"e2f4":208,"e3e6":209,"e4f3":210,"e4h4":211,"e5c6":212,"e6f6":213,"f1b1":214,"f1f3":215,"f1f7":216,"f2e2":217,"f4d5":218,"f5f6":219,"g2f2":220,"g2h3":221,"g4e6":222,"g5h6":223,"h1g2":224,"h4f3":225,"h4g4":226,"h7h8q":227,"a1a2":228,"a4a7":229,"a4b4":230,"a4b5":231,"a7a8":232,"a7a8q":233,"b1a3":234,"b1b4":235,"b1e1":236,"b2e2":237,"b3a4":238,"b3d4":239,"b4c4":240,"b5a6":241,"b5d6":242,"b5e2":243,"b7b6":244,"b7c6":245,"b7c8":246,"b8c8":247,"c1c5":248,"c1d1":249,"c1e3":250,"c1f1":251,"c2a4":252,"c2g6":253,"c3b4":254,"c3d5":255,"c4c6":256,"c4d4":257,"c6b6":258,"c6c4":259,"c6d7":260,"c8d7":261,"d1c1":262,"d1h1":263,"d2f4":264,"d3b1":265,"d3c3":266,"d3d4":267,"d3f5":268,"d3h7":269,"d4c6":270,"d4e3":271,"d4f5":272,"d4h4":273,"d5c5":274,"d6c5":275,"e1e4":276,"e2a6":277,"e2d1":278,"e2e1":279,"e2f1":280,"e2g3":281,"e3d2":282,"e3d3":283,"e3f2":284,"e3f3":285,"e3g5":286,"e3h6":287,"e4c6":288,"e4d6":289,"e4f5":290,"e5c5":291,"e5f7":292,"e6c8":293,"e7e8":294,"e7e8q":295,"e7f7":296,"e7f8":297,"f1f5":298,"f1h1":299,"f3d5":300,"f3e2":301,"f3e3":302,"f3f2":303,"f3g2":304,"f3h2":305,"f4c7":306,"f4f3":307,"f5e5":308,"f5h5":309,"f6d8":310,"f6f5":311,"f7a7":312,"f7g7":313,"g3f2":314,"g3f3":315,"g3g5":316,"g3g7":317,"g3h3":318,"g4f3":319,"g5d2":320,"g5f3":321,"g5f4":322,"g6d6":323,"g6e8":324,"g6h5":325,"g6h7":326,"h1a1":327,"h1h3":328,"h1h6":329,"h1h7":330,"h3g3":331,"h3h5":332,"h4h3":333,"h5e8":334,"h5h2":335,"h6f6":336,"h8e5":337,"a1a3":338,"a1g1":339,"a1h1":340,"a2a1":341,"a3c4":342,"a3h3":343,"a4b6":344,"a4c2":345,"a4c5":346,"a4c6":347,"a4d1":348,"a5a7":349,"a5c3":350,"a6e2":351,"a6e6":352,"a7b6":353,"a7e3":354,"a7e7":355,"a8b8":356,"a8d8":357,"a8e8":358,"b2b1":359,"b2e5":360,"b2f6":361,"b3b5":362,"b3b7":363,"b3c3":364,"b4a4":365,"b5a4":366,"b5a5":367,"b5b2":368,"b5c4":369,"b5d7":370,"b6c6":371,"b7b8q":372,"b7c5":373,"c1c4":374,"c1c8":375,"c2d2":376,"c2d3":377,"c2e1":378,"c2f2":379,"c3c8":380,"c3d2":381,"c3d3":382,"c4a5":383,"c4e2":384,"c4f7":385,"c5a5":386,"c5b7":387,"c5c4":388,"c5d4":389,"c5e6":390,"c6a7":391,"c6b7":392,"c6c5":393,"c6d5":394,"c6f3":395,"c7c6":396,"c7c8":397,"c7e5":398,"c7e6":399,"c7f7":400,"c8c3":401,"c8e6":402,"c8f5":403,"c8f8":404,"d1a4":405,"d1b1":406,"d1d7":407,"d1f1":408,"d2b2":409,"d2c2":410,"d2c3":411,"d2e1":412,"d2f1":413,"d3d6":414,"d3e3":415,"d4c4":416,"d4e4":417,"d4e6":418,"d4f3":419,"d5b3":420,"d5d3":421,"d5f7":422,"d6c6":423,"d6d8":424,"d6e5":425,"d7d6":426,"d7e6":427,"d7e8":428,"d8f8":429,"e1f3":430,"e2c2":431,"e2e7":432,"e3e2":433,"e4d3":434,"e4d4":435,"e4g5":436,"e5d5":437,"e5e2":438,"e5g5":439,"e5g6":440,"e5h5":441,"e6d5":442,"e6d7":443,"e7a7":444,"e7e3":445,"e8b5":446,"e8d8":447,"e8e7":448,"e8h5":449,"f1f6":450,"f1f8":451,"f2f5":452,"f2f7":453,"f3a8":454,"f3e1":455,"f3h5":456,"f4e4":457,"f4h4":458,"f5g4":459,"f5g6":460,"f6e7":461,"f6g5":462,"f7d6":463,"f7d7":464,"f7e7":465,"f7f6":466,"g1g3":467,"g1h3":468,"g3c7":469,"g3d3":470,"g3g2":471,"g3h5":472,"g4f6":473,"g4g3":474,"g4h3":475,"g4h4":476,"g5d8":477,"g5e3":478,"g5e4":479,"g5e6":480,"g5f7":481,"g6e4":482,"g6f7":483,"g7d7":484,"g7f6":485,"g7g8q":486,"h1b1":487,"h1f1":488,"h1h5":489,"h1h8":490,"h2d6":491,"h2e5":492,"h2f4":493,"h2g4":494,"h2h5":495,"h3f3":496,"h3g2":497,"h3h2":498,"h3h8":499,"h4a4":500,"h4d4":501,"h4e7":502,"h4f4":503,"h4g3":504,"h4g6":505,"h4h1":506,"h5d5":507,"h5e2":508,"h5f3":509,"h5f7":510,"h5h4":511,"h5h7":512,"h6b6":513,"h6f4":514,"h6f8":515,"h6h8":516,"h7g8":517,"h7h4":518,"h7h6":519,"h8h7":520,"a1a4":521,"a1b2":522,"a1d4":523,"a1e5":524,"a2b4":525,"a2d5":526,"a2e2":527,"a3a7":528,"a3a8":529,"a3b3":530,"a3c2":531,"a4a6":532,"a4b3":533,"a4d7":534,"a5a4":535,"a5b6":536,"a5c6":537,"a5e5":538,"a6a5":539,"a6a8":540,"a6b7":541,"a6c5":542,"a6h6":543,"a7a4":544,"a7a6":545,"a7b5":546,"a7b7":547,"a7b8":548,"a7c7":549,"a7d4":550,"a7f7":551,"a7g7":552,"a7h7":553,"a8a7":554,"a8c6":555,"a8d5":556,"a8e4":557,"a8f8":558,"a8h1":559,"a8h8":560,"b1b3":561,"b1b8":562,"b1c2":563,"b1d3":564,"b1h1":565,"b2a1":566,"b2a2":567,"b2a3":568,"b2b5":569,"b2b6":570,"b2b8":571,"b2c2":572,"b2h2":573,"b3a2":574,"b3c5":575,"b3d5":576,"b3e6":577,"b3f3":578,"b3f7":579,"b4a3":580,"b4b3":581,"b4b7":582,"b4b8":583,"b4d4":584,"b4d6":585,"b4e7":586,"b4g4":587,"b5a3":588,"b5b7":589,"b5b8":590,"b5d3":591,"b5f1":592,"b6a5":593,"b6a6":594,"b6b2":595,"b6b4":596,"b6b5":597,"b6c5":598,"b6c7":599,"b6d4":600,"b6d5":601,"b6f6":602,"b6g6":603,"b7b4":604,"b7c7":605,"b7d7":606,"b7e7":607,"b8b5":608,"b8b6":609,"b8b7":610,"b8d8":611,"b8f4":612,"b8h8":613,"c1a1":614,"c1b3":615,"c1c3":616,"c1c6":617,"c1e1":618,"c1g1":619,"c2b2":620,"c2c1":621,"c2c5":622,"c2c6":623,"c2c7":624,"c2d1":625,"c2e2":626,"c2f5":627,"c2g2":628,"c2h2":629,"c2h7":630,"c3a2":631,"c3c6":632,"c3c7":633,"c3d1":634,"c3e5":635,"c3f6":636,"c3g3":637,"c3g7":638,"c3h8":639,"c4a2":640,"c4a6":641,"c4b2":642,"c4b4":643,"c4c7":644,"c4e3":645,"c4f4":646,"c4h4":647,"c5b4":648,"c5c7":649,"c5d6":650,"c5e3":651,"c5g5":652,"c6a4":653,"c6a6":654,"c6a8":655,"c6c1":656,"c6c8":657,"c6d6":658,"c6e7":659,"c6e8":660,"c6h6":661,"c7a5":662,"c7a6":663,"c7a7":664,"c7a8":665,"c7b6":666,"c7d6":667,"c7f4":668,"c7g7":669,"c7h2":670,"c8a8":671,"c8b7":672,"c8c5":673,"c8c6":674,"c8c7":675,"c8e8":676,"d1d6":677,"d1e3":678,"d2b4":679,"d2c1":680,"d2d6":681,"d2g5":682,"d3a3":683,"d3a6":684,"d3b3":685,"d3d2":686,"d3d5":687,"d3f4":688,"d4b3":689,"d4c3":690,"d4d2":691,"d4d3":692,"d4d8":693,"d4g7":694,"d5a8":695,"d5b6":696,"d5c3":697,"d5c4":698,"d5c7":699,"d5d4":700,"d5d7":701,"d5e5":702,"d5f5":703,"d5h5":704,"d6b6":705,"d6c4":706,"d6c8":707,"d6d2":708,"d6e8":709,"d6f5":710,"d6g3":711,"d7a7":712,"d7b7":713,"d7c5":714,"d7c7":715,"d7c8":716,"d7d1":717,"d7d3":718,"d7d4":719,"d7d8":720,"d7e7":721,"d7f7":722,"d7f8":723,"d8d1":724,"d8d7":725,"d8e7":726,"d8e8":727,"d8f6":728,"d8h4":729,"d8h8":730,"e1a1":731,"e1c2":732,"e1d3":733,"e1e6":734,"e1e8":735,"e1f2":736,"e2a2":737,"e2b2":738,"e2c1":739,"e2c3":740,"e2e5":741,"e2e6":742,"e2e8":743,"e2g2":744,"e3a3":745,"e3a7":746,"e3c1":747,"e3c3":748,"e3c4":749,"e3c5":750,"e3e5":751,"e3e7":752,"e3g3":753,"e3g4":754,"e3h3":755,"e4b7":756,"e4c5":757,"e4e2":758,"e4e8":759,"e4f4":760,"e4g2":761,"e4g3":762,"e4g6":763,"e4h7":764,"e5a1":765,"e5b2":766,"e5b8":767,"e5c4":768,"e5d4":769,"e5e3":770,"e5e4":771,"e5f3":772,"e5f4":773,"e5f5":774,"e5g7":775,"e5h2":776,"e6b3":777,"e6d4":778,"e6d6":779,"e6e2":780,"e6e4":781,"e6e5":782,"e6e8":783,"e6f4":784,"e7b4":785,"e7b7":786,"e7d5":787,"e7d6":788,"e7d7":789,"e7e5":790,"e7e6":791,"e7g7":792,"e8a8":793,"e8b8":794,"e8c8":795,"e8e2":796,"e8e3":797,"e8f6":798,"e8f8":799,"e8g6":800,"e8g8":801,"e8h8":802,"f1a1":803,"f1e3":804,"f1f4":805,"f1g3":806,"f2c5":807,"f2e1":808,"f2f8":809,"f2g4":810,"f2h2":811,"f3b7":812,"f3d1":813,"f3f1":814,"f3f6":815,"f3g1":816,"f3h3":817,"f4e6":818,"f4f6":819,"f4h5":820,"f5c2":821,"f5d5":822,"f5e4":823,"f5e6":824,"f5f2":825,"f5f3":826,"f5f4":827,"f5g5":828,"f5g7":829,"f5h3":830,"f5h6":831,"f6d5":832,"f6e4":833,"f6f7":834,"f6f8":835,"f6g4":836,"f6h6":837,"f6h7":838,"f6h8":839,"f7b7":840,"f7d5":841,"f7e6":842,"f7f1":843,"f7g8":844,"f8a8":845,"f8f2":846,"f8f4":847,"f8f6":848,"f8h8":849,"g1a1":850,"g1b1":851,"g1c1":852,"g1d1":853,"g1d4":854,"g1g6":855,"g2c6":856,"g2e4":857,"g2f1":858,"g2g5":859,"g3f1":860,"g3g6":861,"g3g8":862,"g3h2":863,"g4b4":864,"g4d4":865,"g4e2":866,"g4e5":867,"g4f2":868,"g4g6":869,"g5f5":870,"g5g2":871,"g5g3":872,"g5g7":873,"g5h7":874,"g6f6":875,"g6g4":876,"g6g5":877,"g6g8":878,"g7g5":879,"g7g6":880,"g7g8":881,"g7h5":882,"g8b8":883,"g8d5":884,"g8d8":885,"g8e6":886,"g8f7":887,"g8g5":888,"g8h7":889,"h1c1":890,"h1h4":891,"h2b2":892,"h2c7":893,"h2f3":894,"h2g2":895,"h3a3":896,"h3h6":897,"h4d8":898,"h4e4":899,"h4f5":900,"h4h2":901,"h4h6":902,"h4h8":903,"h5f4":904,"h5g4":905,"h5h3":906,"h6d6":907,"h6g5":908,"h6h3":909,"h6h4":910,"h6h5":911,"h7c2":912,"h7c7":913,"h7g6":914,"h7h1":915,"h7h8":916,"h8c3":917,"h8c8":918,"h8e8":919,"h8g8":920,"h8h2":921,"h8h6":922},"index_to_move":{"0":"e2e3","1":"g1f3","2":"d2d4","3":"c1f4","4":"e1g1","5":"c2c3","6":"f3e5","7":"b1d2","8":"f1d3","9":"e3e4","10":"d4e5","11":"f1e2","12":"h2h3","13":"b1c3","14":"f4g3","15":"e3d4","16":"g2g3","17":"a2a3","18":"a1b1","19":"h2g3","20":"d2f3","21":"f2f3","22":"c3c4","23":"d4d5","24":"f1e1","25":"d1e2","26":"f2f4","27":"h2h4","28":"c2c4","29":"g4g5","30":"b2b4","31":"d2e4","32":"e2f3","33":"f4e5","34":"b2b3","35":"e1e2","36":"f3f4","37":"f4g5","38":"h4h5","39":"a2a4","40":"e4e5","41":"g1h1","42":"g2g4","43":"g3g4","44":"d1d3","45":"e1c1","46":"f1c1","47":"f3d4","48":"g2f3","49":"a4a5","50":"b4b5","51":"c4c5","52":"d1f3","53":"e2e4","54":"f3g4","55":"d1d2","56":"e2d3","57":"e4d5","58":"h3h4","59":"a1c1","60":"a1d1","61":"b2c3","62":"c3d4","63":"d1b3","64":"d4c5","65":"e5e6","66":"f4e3","67":"f4f5","68":"g1f1","69":"g1h2","70":"g3f4","71":"g5g6","72":"h6h7","73":"b3b4","74":"d3g6","75":"e5f6","76":"f3g3","77":"f3g5","78":"h5h6","79":"a5a6","80":"c1b1","81":"d1h5","82":"d3e2","83":"d3e4","84":"f1d1","85":"f1g2","86":"f2e3","87":"f3h4","88":"h5g6","89":"a3a4","90":"a6a7","91":"c3e4","92":"d3b5","93":"d3c2","94":"e5d6","95":"f3d2","96":"f3e4","97":"h1g1","98":"h4g5","99":"b1d1","100":"c1b2","101":"c1c7","102":"c1g5","103":"c3b5","104":"c5c6","105":"d1d8","106":"e2c4","107":"e2f2","108":"e2h5","109":"e5d7","110":"e6e7","111":"f2g3","112":"g3h4","113":"g5f6","114":"h2g1","115":"a1f1","116":"c4d5","117":"c6c7","118":"d1a1","119":"d1c2","120":"d1g4","121":"d2d3","122":"e1d1","123":"e2d2","124":"f4d6","125":"g1f2","126":"g3d6","127":"g4f5","128":"g4h5","129":"h3g4","130":"a3b4","131":"b1a1","132":"b1b2","133":"b1c1","134":"b5b6","135":"c1d2","136":"d1d4","137":"d2e2","138":"d2h6","139":"d3c4","140":"e1e5","141":"e1f1","142":"e5g3","143":"f1c4","144":"f1f2","145":"f4g4","146":"g5h4","147":"g6g7","148":"h1e1","149":"h1h2","150":"h6g7","151":"a1e1","152":"a2b3","153":"b3c2","154":"b5c6","155":"b6b7","156":"c2e4","157":"c3a4","158":"c3e2","159":"c4b5","160":"c5b6","161":"d1d5","162":"d2e3","163":"d6e7","164":"e2b5","165":"e2g4","166":"e3f4","167":"e4f6","168":"f1b5","169":"f1g1","170":"f2f1","171":"f4h2","172":"f4h6","173":"f6e6","174":"f6g6","175":"g1e2","176":"g1g2","177":"g3e5","178":"g4f4","179":"g5e7","180":"h5f5","181":"a1a7","182":"a1a8","183":"b1b6","184":"b1b7","185":"b1f1","186":"b4a5","187":"b4c5","188":"b5c7","189":"b7f7","190":"c1c2","191":"c2b3","192":"c4b3","193":"c4d3","194":"c4e5","195":"c7c8q","196":"d1e1","197":"d2b3","198":"d2c4","199":"d2d1","200":"d5c6","201":"d5d6","202":"d5e6","203":"d6d7","204":"e1b1","205":"e1d2","206":"e1e3","207":"e1e7","208":"e2f4","209":"e3e6","210":"e4f3","211":"e4h4","212":"e5c6","213":"e6f6","214":"f1b1","215":"f1f3","216":"f1f7","217":"f2e2","218":"f4d5","219":"f5f6","220":"g2f2","221":"g2h3","222":"g4e6","223":"g5h6","224":"h1g2","225":"h4f3","226":"h4g4","227":"h7h8q","228":"a1a2","229":"a4a7","230":"a4b4","231":"a4b5","232":"a7a8","233":"a7a8q","234":"b1a3","235":"b1b4","236":"b1e1","237":"b2e2","238":"b3a4","239":"b3d4","240":"b4c4","241":"b5a6","242":"b5d6","243":"b5e2","244":"b7b6","245":"b7c6","246":"b7c8","247":"b8c8","248":"c1c5","249":"c1d1","250":"c1e3","251":"c1f1","252":"c2a4","253":"c2g6","254":"c3b4","255":"c3d5","256":"c4c6","257":"c4d4","258":"c6b6","259":"c6c4","260":"c6d7","261":"c8d7","262":"d1c1","263":"d1h1","264":"d2f4","265":"d3b1","266":"d3c3","267":"d3d4","268":"d3f5","269":"d3h7","270":"d4c6","271":"d4e3","272":"d4f5","273":"d4h4","274":"d5c5","275":"d6c5","276":"e1e4","277":"e2a6","278":"e2d1","279":"e2e1","280":"e2f1","281":"e2g3","282":"e3d2","283":"e3d3","284":"e3f2","285":"e3f3","286":"e3g5","287":"e3h6","288":"e4c6","289":"e4d6","290":"e4f5","291":"e5c5","292":"e5f7","293":"e6c8","294":"e7e8","295":"e7e8q","296":"e7f7","297":"e7f8","298":"f1f5","299":"f1h1","300":"f3d5","301":"f3e2","302":"f3e3","303":"f3f2","304":"f3g2","305":"f3h2","306":"f4c7","307":"f4f3","308":"f5e5","309":"f5h5","310":"f6d8","311":"f6f5","312":"f7a7","313":"f7g7","314":"g3f2","315":"g3f3","316":"g3g5","317":"g3g7","318":"g3h3","319":"g4f3","320":"g5d2","321":"g5f3","322":"g5f4","323":"g6d6","324":"g6e8","325":"g6h5","326":"g6h7","327":"h1a1","328":"h1h3","329":"h1h6","330":"h1h7","331":"h3g3","332":"h3h5","333":"h4h3","334":"h5e8","335":"h5h2","336":"h6f6","337":"h8e5","338":"a1a3","339":"a1g1","340":"a1h1","341":"a2a1","342":"a3c4","343":"a3h3","344":"a4b6","345":"a4c2","346":"a4c5","347":"a4c6","348":"a4d1","349":"a5a7","350":"a5c3","351":"a6e2","352":"a6e6","353":"a7b6","354":"a7e3","355":"a7e7","356":"a8b8","357":"a8d8","358":"a8e8","359":"b2b1","360":"b2e5","361":"b2f6","362":"b3b5","363":"b3b7","364":"b3c3","365":"b4a4","366":"b5a4","367":"b5a5","368":"b5b2","369":"b5c4","370":"b5d7","371":"b6c6","372":"b7b8q","373":"b7c5","374":"c1c4","375":"c1c8","376":"c2d2","377":"c2d3","378":"c2e1","379":"c2f2","380":"c3c8","381":"c3d2","382":"c3d3","383":"c4a5","384":"c4e2","385":"c4f7","386":"c5a5","387":"c5b7","388":"c5c4","389":"c5d4","390":"c5e6","391":"c6a7","392":"c6b7","393":"c6c5","394":"c6d5","395":"c6f3","396":"c7c6","397":"c7c8","398":"c7e5","399":"c7e6","400":"c7f7","401":"c8c3","402":"c8e6","403":"c8f5","404":"c8f8","405":"d1a4","406":"d1b1","407":"d1d7","408":"d1f1","409":"d2b2","410":"d2c2","411":"d2c3","412":"d2e1","413":"d2f1","414":"d3d6","415":"d3e3","416":"d4c4","417":"d4e4","418":"d4e6","419":"d4f3","420":"d5b3","421":"d5d3","422":"d5f7","423":"d6c6","424":"d6d8","425":"d6e5","426":"d7d6","427":"d7e6","428":"d7e8","429":"d8f8","430":"e1f3","431":"e2c2","432":"e2e7","433":"e3e2","434":"e4d3","435":"e4d4","436":"e4g5","437":"e5d5","438":"e5e2","439":"e5g5","440":"e5g6","441":"e5h5","442":"e6d5","443":"e6d7","444":"e7a7","445":"e7e3","446":"e8b5","447":"e8d8","448":"e8e7","449":"e8h5","450":"f1f6","451":"f1f8","452":"f2f5","453":"f2f7","454":"f3a8","455":"f3e1","456":"f3h5","457":"f4e4","458":"f4h4","459":"f5g4","460":"f5g6","461":"f6e7","462":"f6g5","463":"f7d6","464":"f7d7","465":"f7e7","466":"f7f6","467":"g1g3","468":"g1h3","469":"g3c7","470":"g3d3","471":"g3g2","472":"g3h5","473":"g4f6","474":"g4g3","475":"g4h3","476":"g4h4","477":"g5d8","478":"g5e3","479":"g5e4","480":"g5e6","481":"g5f7","482":"g6e4","483":"g6f7","484":"g7d7","485":"g7f6","486":"g7g8q","487":"h1b1","488":"h1f1","489":"h1h5","490":"h1h8","491":"h2d6","492":"h2e5","493":"h2f4","494":"h2g4","495":"h2h5","496":"h3f3","497":"h3g2","498":"h3h2","499":"h3h8","500":"h4a4","501":"h4d4","502":"h4e7","503":"h4f4","504":"h4g3","505":"h4g6","506":"h4h1","507":"h5d5","508":"h5e2","509":"h5f3","510":"h5f7","511":"h5h4","512":"h5h7","513":"h6b6","514":"h6f4","515":"h6f8","516":"h6h8","517":"h7g8","518":"h7h4","519":"h7h6","520":"h8h7","521":"a1a4","522":"a1b2","523":"a1d4","524":"a1e5","525":"a2b4","526":"a2d5","527":"a2e2","528":"a3a7","529":"a3a8","530":"a3b3","531":"a3c2","532":"a4a6","533":"a4b3","534":"a4d7","535":"a5a4","536":"a5b6","537":"a5c6","538":"a5e5","539":"a6a5","540":"a6a8","541":"a6b7","542":"a6c5","543":"a6h6","544":"a7a4","545":"a7a6","546":"a7b5","547":"a7b7","548":"a7b8","549":"a7c7","550":"a7d4","551":"a7f7","552":"a7g7","553":"a7h7","554":"a8a7","555":"a8c6","556":"a8d5","557":"a8e4","558":"a8f8","559":"a8h1","560":"a8h8","561":"b1b3","562":"b1b8","563":"b1c2","564":"b1d3","565":"b1h1","566":"b2a1","567":"b2a2","568":"b2a3","569":"b2b5","570":"b2b6","571":"b2b8","572":"b2c2","573":"b2h2","574":"b3a2","575":"b3c5","576":"b3d5","577":"b3e6","578":"b3f3","579":"b3f7","580":"b4a3","581":"b4b3","582":"b4b7","583":"b4b8","584":"b4d4","585":"b4d6","586":"b4e7","587":"b4g4","588":"b5a3","589":"b5b7","590":"b5b8","591":"b5d3","592":"b5f1","593":"b6a5","594":"b6a6","595":"b6b2","596":"b6b4","597":"b6b5","598":"b6c5","599":"b6c7","600":"b6d4","601":"b6d5","602":"b6f6","603":"b6g6","604":"b7b4","605":"b7c7","606":"b7d7","607":"b7e7","608":"b8b5","609":"b8b6","610":"b8b7","611":"b8d8","612":"b8f4","613":"b8h8","614":"c1a1","615":"c1b3","616":"c1c3","617":"c1c6","618":"c1e1","619":"c1g1","620":"c2b2","621":"c2c1","622":"c2c5","623":"c2c6","624":"c2c7","625":"c2d1","626":"c2e2","627":"c2f5","628":"c2g2","629":"c2h2","630":"c2h7","631":"c3a2","632":"c3c6","633":"c3c7","634":"c3d1","635":"c3e5","636":"c3f6","637":"c3g3","638":"c3g7","639":"c3h8","640":"c4a2","641":"c4a6","642":"c4b2","643":"c4b4","644":"c4c7","645":"c4e3","646":"c4f4","647":"c4h4","648":"c5b4","649":"c5c7","650":"c5d6","651":"c5e3","652":"c5g5","653":"c6a4","654":"c6a6","655":"c6a8","656":"c6c1","657":"c6c8","658":"c6d6","659":"c6e7","660":"c6e8","661":"c6h6","662":"c7a5","663":"c7a6","664":"c7a7","665":"c7a8","666":"c7b6","667":"c7d6","668":"c7f4","669":"c7g7","670":"c7h2","671":"c8a8","672":"c8b7","673":"c8c5","674":"c8c6","675":"c8c7","676":"c8e8","677":"d1d6","678":"d1e3","679":"d2b4","680":"d2c1","681":"d2d6","682":"d2g5","683":"d3a3","684":"d3a6","685":"d3b3","686":"d3d2","687":"d3d5","688":"d3f4","689":"d4b3","690":"d4c3","691":"d4d2","692":"d4d3","693":"d4d8","694":"d4g7","695":"d5a8","696":"d5b6","697":"d5c3","698":"d5c4","699":"d5c7","700":"d5d4","701":"d5d7","702":"d5e5","703":"d5f5","704":"d5h5","705":"d6b6","706":"d6c4","707":"d6c8","708":"d6d2","709":"d6e8","710":"d6f5","711":"d6g3","712":"d7a7","713":"d7b7","714":"d7c5","715":"d7c7","716":"d7c8","717":"d7d1","718":"d7d3","719":"d7d4","720":"d7d8","721":"d7e7","722":"d7f7","723":"d7f8","724":"d8d1","725":"d8d7","726":"d8e7","727":"d8e8","728":"d8f6","729":"d8h4","730":"d8h8","731":"e1a1","732":"e1c2","733":"e1d3","734":"e1e6","735":"e1e8","736":"e1f2","737":"e2a2","738":"e2b2","739":"e2c1","740":"e2c3","741":"e2e5","742":"e2e6","743":"e2e8","744":"e2g2","745":"e3a3","746":"e3a7","747":"e3c1","748":"e3c3","749":"e3c4","750":"e3c5","751":"e3e5","752":"e3e7","753":"e3g3","754":"e3g4","755":"e3h3","756":"e4b7","757":"e4c5","758":"e4e2","759":"e4e8","760":"e4f4","761":"e4g2","762":"e4g3","763":"e4g6","764":"e4h7","765":"e5a1","766":"e5b2","767":"e5b8","768":"e5c4","769":"e5d4","770":"e5e3","771":"e5e4","772":"e5f3","773":"e5f4","774":"e5f5","775":"e5g7","776":"e5h2","777":"e6b3","778":"e6d4","779":"e6d6","780":"e6e2","781":"e6e4","782":"e6e5","783":"e6e8","784":"e6f4","785":"e7b4","786":"e7b7","787":"e7d5","788":"e7d6","789":"e7d7","790":"e7e5","791":"e7e6","792":"e7g7","793":"e8a8","794":"e8b8","795":"e8c8","796":"e8e2","797":"e8e3","798":"e8f6","799":"e8f8","800":"e8g6","801":"e8g8","802":"e8h8","803":"f1a1","804":"f1e3","805":"f1f4","806":"f1g3","807":"f2c5","808":"f2e1","809":"f2f8","810":"f2g4","811":"f2h2","812":"f3b7","813":"f3d1","814":"f3f1","815":"f3f6","816":"f3g1","817":"f3h3","818":"f4e6","819":"f4f6","820":"f4h5","821":"f5c2","822":"f5d5","823":"f5e4","824":"f5e6","825":"f5f2","826":"f5f3","827":"f5f4","828":"f5g5","829":"f5g7","830":"f5h3","831":"f5h6","832":"f6d5","833":"f6e4","834":"f6f7","835":"f6f8","836":"f6g4","837":"f6h6","838":"f6h7","839":"f6h8","840":"f7b7","841":"f7d5","842":"f7e6","843":"f7f1","844":"f7g8","845":"f8a8","846":"f8f2","847":"f8f4","848":"f8f6","849":"f8h8","850":"g1a1","851":"g1b1","852":"g1c1","853":"g1d1","854":"g1d4","855":"g1g6","856":"g2c6","857":"g2e4","858":"g2f1","859":"g2g5","860":"g3f1","861":"g3g6","862":"g3g8","863":"g3h2","864":"g4b4","865":"g4d4","866":"g4e2","867":"g4e5","868":"g4f2","869":"g4g6","870":"g5f5","871":"g5g2","872":"g5g3","873":"g5g7","874":"g5h7","875":"g6f6","876":"g6g4","877":"g6g5","878":"g6g8","879":"g7g5","880":"g7g6","881":"g7g8","882":"g7h5","883":"g8b8","884":"g8d5","885":"g8d8","886":"g8e6","887":"g8f7","888":"g8g5","889":"g8h7","890":"h1c1","891":"h1h4","892":"h2b2","893":"h2c7","894":"h2f3","895":"h2g2","896":"h3a3","897":"h3h6","898":"h4d8","899":"h4e4","900":"h4f5","901":"h4h2","902":"h4h6","903":"h4h8","904":"h5f4","905":"h5g4","906":"h5h3","907":"h6d6","908":"h6g5","909":"h6h3","910":"h6h4","911":"h6h5","912":"h7c2","913":"h7c7","914":"h7g6","915":"h7h1","916":"h7h8","917":"h8c3","918":"h8c8","919":"h8e8","920":"h8g8","921":"h8h2","922":"h8h6"},"vocab_size":923,"top_moves":[["e2e3",95],["g1f3",86],["d2d4",85],["c1f4",73],["e1g1",65],["c2c3",63],["f3e5",55],["b1d2",51],["f1d3",46],["e3e4",41],["d4e5",36],["f1e2",34],["h2h3",34],["b1c3",33],["f4g3",32],["e3d4",30],["g2g3",30],["a2a3",29],["a1b1",28],["h2g3",27],["d2f3",25],["f2f3",25],["c3c4",24],["d4d5",24],["f1e1",24],["d1e2",23],["f2f4",23],["h2h4",22],["c2c4",21],["g4g5",21],["b2b4",20],["d2e4",20],["e2f3",20],["f4e5",20],["b2b3",19],["e1e2",19],["f3f4",19],["f4g5",19],["h4h5",19],["a2a4",18],["e4e5",18],["g1h1",17],["g2g4",17],["g3g4",17],["d1d3",15],["e1c1",15],["f1c1",15],["f3d4",15],["g2f3",15],["a4a5",14],["b4b5",14],["c4c5",14],["d1f3",14],["e2e4",14],["f3g4",14],["d1d2",13],["e2d3",13],["e4d5",13],["h3h4",13],["a1c1",12],["a1d1",12],["b2c3",12],["c3d4",12],["d1b3",12],["d4c5",12],["e5e6",12],["f4e3",12],["f4f5",12],["g1f1",12],["g1h2",12],["g3f4",12],["g5g6",12],["h6h7",12],["b3b4",11],["d3g6",11],["e5f6",11],["f3g3",11],["f3g5",11],["h5h6",11],["a5a6",10],["c1b1",10],["d1h5",10],["d3e2",10],["d3e4",10],["f1d1",10],["f1g2",10],["f2e3",10],["f3h4",10],["h5g6",10],["a3a4",9],["a6a7",9],["c3e4",9],["d3b5",9],["d3c2",9],["e5d6",9],["f3d2",9],["f3e4",9],["h1g1",9],["h4g5",9],["b1d1",8]]}