{"move_to_index":{"e7e6":0,"g8f6":1,"c7c6":2,"d7d5":3,"e8g8":4,"b8c6":5,"f8e7":6,"c8g4":7,"h7h6":8,"b8d7":9,"e6e5":10,"d7d6":11,"g7g6":12,"a7a6":13,"c6c5":14,"d5e4":15,"a8c8":16,"c6d5":17,"f8d6":18,"e7f6":19,"g4h5":20,"h7h5":21,"b7b5":22,"d7e5":23,"f8d8":24,"a7a5":25,"f7f6":26,"c8f5":27,"d8e7":28,"e8e7":29,"f6e4":30,"f7f5":31,"f8g7":32,"g7g5":33,"a5a4":34,"b7b6":35,"c6e5":36,"f6d5":37,"f8e8":38,"b5b4":39,"c5d4":40,"e5e4":41,"f6f5":42,"g5g4":43,"f6g5":44,"h7g6":45,"c7c5":46,"d6e5":47,"f6d7":48,"f6g4":49,"g5h4":50,"h5h4":51,"d5c4":52,"d5d4":53,"d6d7":54,"h5g6":55,"c8b7":56,"e7d6":57,"e7e5":58,"f5f4":59,"g8f8":60,"h6h5":61,"a8e8":62,"c8d7":63,"d8a5":64,"d8d5":65,"g7f6":66,"g8h8":67,"h4h3":68,"c5c4":69,"d6d5":70,"d8b6":71,"e8c8":72,"f5g6":73,"f8c8":74,"g4f3":75,"g6f5":76,"g8e7":77,"a6a5":78,"c6b4":79,"c6d4":80,"d7b6":81,"e4e3":82,"e6f5":83,"g4g3":84,"g8g7":85,"h3h2":86,"a8b8":87,"a8d8":88,"b7c6":89,"d8d7":90,"f5g4":91,"f6e5":92,"f6h5":93,"g8h7":94,"h8g8":95,"a4a2":96,"b4b3":97,"b6b5":98,"d7c5":99,"d7c6":100,"d8c7":101,"d8c8":102,"e5d4":103,"e6d5":104,"e7g6":105,"f8b4":106,"h4g4":107,"a2a4":108,"a3a2":109,"b7a6":110,"c8c4":111,"c8c5":112,"d7f6":113,"d8d4":114,"d8d6":115,"d8f6":116,"e5d3":117,"e7c5":118,"e7h4":119,"e8f8":120,"g4h4":121,"g6g5":122,"h5g4":123,"a8a6":124,"b4c3":125,"c4d3":126,"c6b5":127,"c8d8":128,"d6c5":129,"d8e8":130,"e5c4":131,"e5f3":132,"e5f4":133,"e7d7":134,"f7e6":135,"f7g6":136,"f8g8":137,"g6e5":138,"g7h6":139,"a2b2":140,"a4a3":141,"a4b3":142,"a8f8":143,"b3b2":144,"b4d3":145,"c2b3":146,"c3c2":147,"c5e4":148,"c8c7":149,"c8e6":150,"d2d1":151,"d4d3":152,"d5d3":153,"d6c6":154,"d8d1":155,"d8d2":156,"d8g5":157,"e4g3":158,"e7f8":159,"e7g5":160,"e8d7":161,"f4f3":162,"f5e4":163,"g3f1":164,"g4e2":165,"g6h5":166,"g8f7":167,"h8e8":168,"a8a2":169,"b3c4":170,"b4d2":171,"b5c4":172,"b6c4":173,"c1d1":174,"c2c3":175,"c4c3":176,"c8c3":177,"d3b2":178,"d3c2":179,"d3c3":180,"d3e3":181,"d4c3":182,"d4d5":183,"d5e3":184,"d5e5":185,"d5f4":186,"d6f5":187,"d8h4":188,"e3c4":189,"e4c3":190,"e4d2":191,"e4f3":192,"e4f4":193,"e5c6":194,"e7b4":195,"e7d8":196,"e8a8":197,"e8e1":198,"e8e3":199,"f4e3":200,"f4e4":201,"f5g3":202,"f6g6":203,"f8h6":204,"h2h3":205,"h4g3":206,"h4g5":207,"h5e2":208,"h5f3":209,"a4b4":210,"a5b6":211,"a6b5":212,"a7b6":213,"a8g8":214,"b2c4":215,"b3c3":216,"b4d6":217,"b5a4":218,"b6c7":219,"b6d5":220,"b6d7":221,"c4b6":222,"c6d6":223,"c7c4":224,"c7d6":225,"c7d7":226,"c8b8":227,"c8c2":228,"d1e1":229,"d6d1":230,"d7e6":231,"d7e7":232,"d7e8":233,"d8b8":234,"d8g8":235,"e8f7":236,"f4g4":237,"f5d3":238,"f5d6":239,"f5e3":240,"f5g5":241,"f5h3":242,"f6e6":243,"f8f2":244,"g1f1":245,"g2g3":246,"g2h1":247,"g3g2":248,"g4e3":249,"g4e5":250,"g4f6":251,"g4h3":252,"g4h6":253,"g5f4":254,"g6d3":255,"g6f6":256,"g7e5":257,"g7f8":258,"g8g3":259,"g8g5":260,"h5g3":261,"h6g5":262,"h8h5":263,"a4c6":264,"a5b4":265,"a6a7":266,"a6d3":267,"a8a3":268,"a8a7":269,"b2c2":270,"b3a3":271,"b3d3":272,"b4a4":273,"b4c5":274,"b4d4":275,"b6a4":276,"b6c5":277,"b7b4":278,"b8a6":279,"b8b3":280,"b8b7":281,"b8d6":282,"c2e2":283,"c3c4":284,"c3d3":285,"c4b3":286,"c4d2":287,"c4d6":288,"c4e3":289,"c4f4":290,"c5b4":291,"c5c1":292,"c5d5":293,"c5d6":294,"c5e6":295,"c6b7":296,"c6c3":297,"c6d7":298,"c6e4":299,"c7g3":300,"c8a8":301,"c8c1":302,"c8f8":303,"d1d2":304,"d2d4":305,"d3d2":306,"d4f5":307,"d5b6":308,"d5c6":309,"d5d8":310,"d5e6":311,"d6b4":312,"d6b6":313,"d6c7":314,"d6f4":315,"d7a4":316,"d7f8":317,"d8d3":318,"e1a1":319,"e2b2":320,"e3e2":321,"e3f1":322,"e3g2":323,"e4e1":324,"e5c3":325,"e5d5":326,"e5f7":327,"e5g4":328,"e7c6":329,"e7f5":330,"e8d8":331,"e8e2":332,"e8e6":333,"f1e3":334,"f3e1":335,"f3f1":336,"f3f2":337,"f4d3":338,"f4g6":339,"f5h7":340,"f6g7":341,"f7e7":342,"f7e8":343,"f7g7":344,"f8f4":345,"f8f7":346,"g2g1":347,"g3f2":348,"g3g4":349,"g4e6":350,"g4f4":351,"g4f5":352,"g4g5":353,"g5e3":354,"g5h5":355,"g6h4":356,"g6h7":357,"g8g1":358,"g8h6":359,"h1g1":360,"h1g2":361,"h2h1q":362,"h3d3":363,"h3f5":364,"h3g2":365,"h3h4":366,"h6g6":367,"h7g7":368,"h8g7":369,"h8h7":370,"a1a2":371,"a1a4":372,"a1c1":373,"a2a1":374,"a2a1q":375,"a2a8":376,"a2c2":377,"a2d2":378,"a2f2":379,"a3a1":380,"a3b2":381,"a4c5":382,"a5a3":383,"a5d2":384,"a6a2":385,"a6c6":386,"a6c7":387,"a6f1":388,"a7a8":389,"a7b7":390,"b1b3":391,"b2a2":392,"b2b1n":393,"b2b1q":394,"b2d2":395,"b2d3":396,"b3a4":397,"b3d1":398,"b3d5":399,"b4b5":400,"b4c2":401,"b4c6":402,"b5c5":403,"b5d3":404,"b5e5":405,"b6a6":406,"b6b2":407,"b6d6":408,"b6e6":409,"b7b3":410,"b7d6":411,"b7e7":412,"b7f3":413,"b8b2":414,"b8c7":415,"b8c8":416,"b8d8":417,"c1c2":418,"c2b2":419,"c2d1":420,"c2e4":421,"c2f2":422,"c3a3":423,"c3c1":424,"c3d2":425,"c3e2":426,"c3e5":427,"c3f3":428,"c3h3":429,"c4b4":430,"c4c2":431,"c4c8":432,"c5b5":433,"c5c2":434,"c5c6":435,"c5c8":436,"c5d3":437,"c5f2":438,"c6c1":439,"c6e7":440,"c7b5":441,"c7b6":442,"c7b8":443,"c7c2":444,"c7d8":445,"c7e5":446,"c7f4":447,"d1c2":448,"d2b3":449,"d2d7":450,"d2f3":451,"d2g2":452,"d3b4":453,"d3c4":454,"d3d5":455,"d3e2":456,"d3h3":457,"d4d2":458,"d4d6":459,"d4h4":460,"d5c5":461,"d5d2":462,"d5d6":463,"d5f6":464,"d6a3":465,"d6b7":466,"d6b8":467,"d6d4":468,"d6e7":469,"d6g3":470,"d6h2":471,"d7c7":472,"d7d1":473,"d7d4":474,"d7h3":475,"e1c2":476,"e1e3":477,"e1f1":478,"e1f3":479,"e2a2":480,"e2b5":481,"e2e1":482,"e2g4":483,"e3b6":484,"e3d3":485,"e3e4":486,"e3f2":487,"e4a4":488,"e4d5":489,"e4f2":490,"e4f5":491,"e4g4":492,"e5b2":493,"e5c5":494,"e5e1":495,"e5e2":496,"e5g3":497,"e5g7":498,"e5h2":499,"e6c5":500,"e6c6":501,"e6d4":502,"e6f7":503,"e6g5":504,"e6g6":505,"e7b7":506,"e7c7":507,"e7e2":508,"e7e8":509,"e7f7":510,"e8e4":511,"f1f2":512,"f1g1":513,"f1h2":514,"f1h3":515,"f2b2":516,"f2c2":517,"f2e2":518,"f2f1q":519,"f2g2":520,"f2h2":521,"f3f4":522,"f4e5":523,"f4g2":524,"f4g3":525,"f5f6":526,"f5g7":527,"f5h4":528,"f6d4":529,"f6h7":530,"f7d6":531,"f7g5":532,"f7h5":533,"f8a8":534,"f8e6":535,"f8f6":536,"g1h1":537,"g2e3":538,"g2h3":539,"g3f5":540,"g5e4":541,"g5f3":542,"g5f5":543,"g5h3":544,"g5h6":545,"g6e4":546,"g6f4":547,"g6h6":548,"g7f7":549,"g7h5":550,"g8d8":551,"h2g1":552,"h2h1":553,"h3f2":554,"h4f3":555,"h4f6":556,"h5f4":557,"h5f6":558,"h6e3":559,"h6f5":560,"h6f8":561,"h6g7":562,"h6h7":563,"h7d3":564,"h7g8":565,"h8c8":566,"h8f7":567,"h8f8":568,"a1a8":569,"a1b1":570,"a1d4":571,"a1e5":572,"a1f6":573,"a1g7":574,"a2a3":575,"a2c3":576,"a2e2":577,"a3a4":578,"a3a7":579,"a3b3":580,"a3b4":581,"a3b5":582,"a3d3":583,"a3e3":584,"a4a5":585,"a4a6":586,"a4b2":587,"a4b5":588,"a4c4":589,"a5a6":590,"a5b5":591,"a5c3":592,"a5c5":593,"a5c7":594,"a5d8":595,"a6a4":596,"a6b7":597,"a6d6":598,"a6e2":599,"a7a1":600,"a7c6":601,"a8a1":602,"a8a4":603,"a8a5":604,"b1b4":605,"b1c3":606,"b1d2":607,"b1g1":608,"b2a1":609,"b2a3":610,"b2b3":611,"b2b4":612,"b2b7":613,"b2e2":614,"b2e5":615,"b2f2":616,"b2g2":617,"b2h2":618,"b3a2":619,"b3a5":620,"b3b5":621,"b3c1":622,"b3c5":623,"b3h3":624,"b4a2":625,"b4a5":626,"b4c4":627,"b4d5":628,"b4e1":629,"b4e4":630,"b5a5":631,"b5b3":632,"b5c3":633,"b5d6":634,"b6b3":635,"b6c6":636,"b6c8":637,"b6d8":638,"b6e3":639,"b6g6":640,"b7b8":641,"b7c7":642,"b8b1":643,"b8b6":644,"b8e5":645,"b8e8":646,"b8g8":647,"c1c3":648,"c1c5":649,"c1d3":650,"c1h1":651,"c2a2":652,"c2b4":653,"c2c1n":654,"c2c4":655,"c2d2":656,"c2d3":657,"c2d4":658,"c2e1":659,"c2g2":660,"c3a4":661,"c3b2":662,"c3b3":663,"c3d5":664,"c3e4":665,"c3g3":666,"c4a3":667,"c4c5":668,"c4c7":669,"c4d4":670,"c4e2":671,"c4e4":672,"c4e5":673,"c4h4":674,"c5a3":675,"c5a4":676,"c5a5":677,"c5b3":678,"c5b6":679,"c5c7":680,"c5e3":681,"c5e5":682,"c5f5":683,"c5f8":684,"c5g5":685,"c6a5":686,"c6c7":687,"c6c8":688,"c6d8":689,"c6e8":690,"c6g2":691,"c7b7":692,"c7c1":693,"c7e7":694,"c7f7":695,"c8a6":696,"c8a7":697,"c8c6":698,"c8e7":699,"c8e8":700,"c8g8":701,"d1a1":702,"d1c1":703,"d1e2":704,"d1f3":705,"d1g1":706,"d1h1":707,"d2a2":708,"d2b2":709,"d2c3":710,"d2d5":711,"d2e2":712,"d2e3":713,"d2f1":714,"d2f2":715,"d2h6":716,"d3a6":717,"d3b5":718,"d3c1":719,"d3d1":720,"d3d4":721,"d3d8":722,"d3e1":723,"d3e4":724,"d3e5":725,"d3f4":726,"d4a1":727,"d4b3":728,"d4b6":729,"d4d7":730,"d4f3":731,"d4f4":732,"d4g4":733,"d5b3":734,"d5b4":735,"d5b7":736,"d5c3":737,"d5c7":738,"d5d1":739,"d5e7":740,"d5f5":741,"d5h1":742,"d6b5":743,"d6c4":744,"d6d3":745,"d6e4":746,"d6e6":747,"d6e8":748,"d6f8":749,"d6g6":750,"d7d2":751,"d7d3":752,"d7h7":753,"d8a8":754,"d8e6":755,"e1d1":756,"e1d3":757,"e1e8":758,"e1f2":759,"e1g2":760,"e1h1":761,"e2d3":762,"e2e1n":763,"e2e4":764,"e2e5":765,"e2e8":766,"e2f1":767,"e2f2":768,"e2g2":769,"e2g3":770,"e2h5":771,"e3c1":772,"e3c2":773,"e3d2":774,"e3d4":775,"e3f4":776,"e3f5":777,"e3g1":778,"e3g3":779,"e3g4":780,"e3g5":781,"e4c4":782,"e4c5":783,"e4c6":784,"e4d6":785,"e4e2":786,"e4f6":787,"e4g5":788,"e5b8":789,"e5e6":790,"e5e7":791,"e5f5":792,"e5f6":793,"e5g6":794,"e5h8":795,"e6b3":796,"e6d6":797,"e6e2":798,"e6e4":799,"e6e7":800,"e6f6":801,"e7a3":802,"e7c8":803,"e8e5":804,"e8h5":805,"f1b1":806,"f1e1":807,"f1g2":808,"f1g3":809,"f1h1":810,"f2c5":811,"f2d2":812,"f2d3":813,"f2e3":814,"f2f1":815,"f2f3":816,"f2g3":817,"f2g4":818,"f2h3":819,"f2h4":820,"f3b7":821,"f3c6":822,"f3d5":823,"f3e2":824,"f3e3":825,"f3e4":826,"f3e5":827,"f3g1":828,"f3g3":829,"f3g5":830,"f3h2":831,"f4c7":832,"f4d4":833,"f4e2":834,"f4f5":835,"f4f6":836,"f4h3":837,"f4h4":838,"f4h5":839,"f5c2":840,"f5d5":841,"f5e5":842,"f5e6":843,"f6a1":844,"f6c3":845,"f6d6":846,"f6e7":847,"f6f2":848,"f6f4":849,"f6h4":850,"f7e5":851,"f7f8":852,"f7g8":853,"f8b8":854,"f8c5":855,"f8f1":856,"f8f3":857,"f8f5":858,"f8g6":859,"g1b6":860,"g1f2":861,"g1f3":862,"g1g2":863,"g1g3":864,"g1g4":865,"g2a2":866,"g2e1":867,"g2f3":868,"g2f4":869,"g2g1q":870,"g2g4":871,"g2h2":872,"g3a3":873,"g3c3":874,"g3c7":875,"g3d3":876,"g3d6":877,"g3e3":878,"g3f3":879,"g3h1":880,"g3h2":881,"g3h4":882,"g4f2":883,"g4g1":884,"g4g2":885,"g5c1":886,"g5c5":887,"g5d2":888,"g5e5":889,"g5e6":890,"g5e7":891,"g5f6":892,"g5g7":893,"g6f7":894,"g6g1":895,"g6g2":896,"g6g7":897,"g6h8":898,"g7a1":899,"g7c3":900,"g7d4":901,"g7e7":902,"g7f5":903,"g7h8":904,"g8d5":905,"g8e8":906,"g8g2":907,"g8g4":908,"g8g6":909,"h1c1":910,"h1f1":911,"h1h2":912,"h1h3":913,"h2b2":914,"h2c2":915,"h2e5":916,"h2f1":917,"h2f3":918,"h2g3":919,"h2g4":920,"h2h4":921,"h3d7":922,"h3f4":923,"h3g3":924,"h4b4":925,"h4d4":926,"h4e1":927,"h4e4":928,"h4e7":929,"h4f2":930,"h4f5":931,"h4g2":932,"h4h1":933,"h4h2":934,"h4h6":935,"h5d1":936,"h5e5":937,"h5g7":938,"h6f4":939,"h6g4":940,"h7d7":941,"h7e7":942,"h7f8":943,"h7g5":944,"h8a8":945,"h8d8":946,"h8h2":947},"index_to_move":{"0":"e7e6","1":"g8f6","2":"c7c6","3":"d7d5","4":"e8g8","5":"b8c6","6":"f8e7","7":"c8g4","8":"h7h6","9":"b8d7","10":"e6e5","11":"d7d6","12":"g7g6","13":"a7a6","14":"c6c5","15":"d5e4","16":"a8c8","17":"c6d5","18":"f8d6","19":"e7f6","20":"g4h5","21":"h7h5","22":"b7b5","23":"d7e5","24":"f8d8","25":"a7a5","26":"f7f6","27":"c8f5","28":"d8e7","29":"e8e7","30":"f6e4","31":"f7f5","32":"f8g7","33":"g7g5","34":"a5a4","35":"b7b6","36":"c6e5","37":"f6d5","38":"f8e8","39":"b5b4","40":"c5d4","41":"e5e4","42":"f6f5","43":"g5g4","44":"f6g5","45":"h7g6","46":"c7c5","47":"d6e5","48":"f6d7","49":"f6g4","50":"g5h4","51":"h5h4","52":"d5c4","53":"d5d4","54":"d6d7","55":"h5g6","56":"c8b7","57":"e7d6","58":"e7e5","59":"f5f4","60":"g8f8","61":"h6h5","62":"a8e8","63":"c8d7","64":"d8a5","65":"d8d5","66":"g7f6","67":"g8h8","68":"h4h3","69":"c5c4","70":"d6d5","71":"d8b6","72":"e8c8","73":"f5g6","74":"f8c8","75":"g4f3","76":"g6f5","77":"g8e7","78":"a6a5","79":"c6b4","80":"c6d4","81":"d7b6","82":"e4e3","83":"e6f5","84":"g4g3","85":"g8g7","86":"h3h2","87":"a8b8","88":"a8d8","89":"b7c6","90":"d8d7","91":"f5g4","92":"f6e5","93":"f6h5","94":"g8h7","95":"h8g8","96":"a4a2","97":"b4b3","98":"b6b5","99":"d7c5","100":"d7c6","101":"d8c7","102":"d8c8","103":"e5d4","104":"e6d5","105":"e7g6","106":"f8b4","107":"h4g4","108":"a2a4","109":"a3a2","110":"b7a6","111":"c8c4","112":"c8c5","113":"d7f6","114":"d8d4","115":"d8d6","116":"d8f6","117":"e5d3","118":"e7c5","119":"e7h4","120":"e8f8","121":"g4h4","122":"g6g5","123":"h5g4","124":"a8a6","125":"b4c3","126":"c4d3","127":"c6b5","128":"c8d8","129":"d6c5","130":"d8e8","131":"e5c4","132":"e5f3","133":"e5f4","134":"e7d7","135":"f7e6","136":"f7g6","137":"f8g8","138":"g6e5","139":"g7h6","140":"a2b2","141":"a4a3","142":"a4b3","143":"a8f8","144":"b3b2","145":"b4d3","146":"c2b3","147":"c3c2","148":"c5e4","149":"c8c7","150":"c8e6","151":"d2d1","152":"d4d3","153":"d5d3","154":"d6c6","155":"d8d1","156":"d8d2","157":"d8g5","158":"e4g3","159":"e7f8","160":"e7g5","161":"e8d7","162":"f4f3","163":"f5e4","164":"g3f1","165":"g4e2","166":"g6h5","167":"g8f7","168":"h8e8","169":"a8a2","170":"b3c4","171":"b4d2","172":"b5c4","173":"b6c4","174":"c1d1","175":"c2c3","176":"c4c3","177":"c8c3","178":"d3b2","179":"d3c2","180":"d3c3","181":"d3e3","182":"d4c3","183":"d4d5","184":"d5e3","185":"d5e5","186":"d5f4","187":"d6f5","188":"d8h4","189":"e3c4","190":"e4c3","191":"e4d2","192":"e4f3","193":"e4f4","194":"e5c6","195":"e7b4","196":"e7d8","197":"e8a8","198":"e8e1","199":"e8e3","200":"f4e3","201":"f4e4","202":"f5g3","203":"f6g6","204":"f8h6","205":"h2h3","206":"h4g3","207":"h4g5","208":"h5e2","209":"h5f3","210":"a4b4","211":"a5b6","212":"a6b5","213":"a7b6","214":"a8g8","215":"b2c4","216":"b3c3","217":"b4d6","218":"b5a4","219":"b6c7","220":"b6d5","221":"b6d7","222":"c4b6","223":"c6d6","224":"c7c4","225":"c7d6","226":"c7d7","227":"c8b8","228":"c8c2","229":"d1e1","230":"d6d1","231":"d7e6","232":"d7e7","233":"d7e8","234":"d8b8","235":"d8g8","236":"e8f7","237":"f4g4","238":"f5d3","239":"f5d6","240":"f5e3","241":"f5g5","242":"f5h3","243":"f6e6","244":"f8f2","245":"g1f1","246":"g2g3","247":"g2h1","248":"g3g2","249":"g4e3","250":"g4e5","251":"g4f6","252":"g4h3","253":"g4h6","254":"g5f4","255":"g6d3","256":"g6f6","257":"g7e5","258":"g7f8","259":"g8g3","260":"g8g5","261":"h5g3","262":"h6g5","263":"h8h5","264":"a4c6","265":"a5b4","266":"a6a7","267":"a6d3","268":"a8a3","269":"a8a7","270":"b2c2","271":"b3a3","272":"b3d3","273":"b4a4","274":"b4c5","275":"b4d4","276":"b6a4","277":"b6c5","278":"b7b4","279":"b8a6","280":"b8b3","281":"b8b7","282":"b8d6","283":"c2e2","284":"c3c4","285":"c3d3","286":"c4b3","287":"c4d2","288":"c4d6","289":"c4e3","290":"c4f4","291":"c5b4","292":"c5c1","293":"c5d5","294":"c5d6","295":"c5e6","296":"c6b7","297":"c6c3","298":"c6d7","299":"c6e4","300":"c7g3","301":"c8a8","302":"c8c1","303":"c8f8","304":"d1d2","305":"d2d4","306":"d3d2","307":"d4f5","308":"d5b6","309":"d5c6","310":"d5d8","311":"d5e6","312":"d6b4","313":"d6b6","314":"d6c7","315":"d6f4","316":"d7a4","317":"d7f8","318":"d8d3","319":"e1a1","320":"e2b2","321":"e3e2","322":"e3f1","323":"e3g2","324":"e4e1","325":"e5c3","326":"e5d5","327":"e5f7","328":"e5g4","329":"e7c6","330":"e7f5","331":"e8d8","332":"e8e2","333":"e8e6","334":"f1e3","335":"f3e1","336":"f3f1","337":"f3f2","338":"f4d3","339":"f4g6","340":"f5h7","341":"f6g7","342":"f7e7","343":"f7e8","344":"f7g7","345":"f8f4","346":"f8f7","347":"g2g1","348":"g3f2","349":"g3g4","350":"g4e6","351":"g4f4","352":"g4f5","353":"g4g5","354":"g5e3","355":"g5h5","356":"g6h4","357":"g6h7","358":"g8g1","359":"g8h6","360":"h1g1","361":"h1g2","362":"h2h1q","363":"h3d3","364":"h3f5","365":"h3g2","366":"h3h4","367":"h6g6","368":"h7g7","369":"h8g7","370":"h8h7","371":"a1a2","372":"a1a4","373":"a1c1","374":"a2a1","375":"a2a1q","376":"a2a8","377":"a2c2","378":"a2d2","379":"a2f2","380":"a3a1","381":"a3b2","382":"a4c5","383":"a5a3","384":"a5d2","385":"a6a2","386":"a6c6","387":"a6c7","388":"a6f1","389":"a7a8","390":"a7b7","391":"b1b3","392":"b2a2","393":"b2b1n","394":"b2b1q","395":"b2d2","396":"b2d3","397":"b3a4","398":"b3d1","399":"b3d5","400":"b4b5","401":"b4c2","402":"b4c6","403":"b5c5","404":"b5d3","405":"b5e5","406":"b6a6","407":"b6b2","408":"b6d6","409":"b6e6","410":"b7b3","411":"b7d6","412":"b7e7","413":"b7f3","414":"b8b2","415":"b8c7","416":"b8c8","417":"b8d8","418":"c1c2","419":"c2b2","420":"c2d1","421":"c2e4","422":"c2f2","423":"c3a3","424":"c3c1","425":"c3d2","426":"c3e2","427":"c3e5","428":"c3f3","429":"c3h3","430":"c4b4","431":"c4c2","432":"c4c8","433":"c5b5","434":"c5c2","435":"c5c6","436":"c5c8","437":"c5d3","438":"c5f2","439":"c6c1","440":"c6e7","441":"c7b5","442":"c7b6","443":"c7b8","444":"c7c2","445":"c7d8","446":"c7e5","447":"c7f4","448":"d1c2","449":"d2b3","450":"d2d7","451":"d2f3","452":"d2g2","453":"d3b4","454":"d3c4","455":"d3d5","456":"d3e2","457":"d3h3","458":"d4d2","459":"d4d6","460":"d4h4","461":"d5c5","462":"d5d2","463":"d5d6","464":"d5f6","465":"d6a3","466":"d6b7","467":"d6b8","468":"d6d4","469":"d6e7","470":"d6g3","471":"d6h2","472":"d7c7","473":"d7d1","474":"d7d4","475":"d7h3","476":"e1c2","477":"e1e3","478":"e1f1","479":"e1f3","480":"e2a2","481":"e2b5","482":"e2e1","483":"e2g4","484":"e3b6","485":"e3d3","486":"e3e4","487":"e3f2","488":"e4a4","489":"e4d5","490":"e4f2","491":"e4f5","492":"e4g4","493":"e5b2","494":"e5c5","495":"e5e1","496":"e5e2","497":"e5g3","498":"e5g7","499":"e5h2","500":"e6c5","501":"e6c6","502":"e6d4","503":"e6f7","504":"e6g5","505":"e6g6","506":"e7b7","507":"e7c7","508":"e7e2","509":"e7e8","510":"e7f7","511":"e8e4","512":"f1f2","513":"f1g1","514":"f1h2","515":"f1h3","516":"f2b2","517":"f2c2","518":"f2e2","519":"f2f1q","520":"f2g2","521":"f2h2","522":"f3f4","523":"f4e5","524":"f4g2","525":"f4g3","526":"f5f6","527":"f5g7","528":"f5h4","529":"f6d4","530":"f6h7","531":"f7d6","532":"f7g5","533":"f7h5","534":"f8a8","535":"f8e6","536":"f8f6","537":"g1h1","538":"g2e3","539":"g2h3","540":"g3f5","541":"g5e4","542":"g5f3","543":"g5f5","544":"g5h3","545":"g5h6","546":"g6e4","547":"g6f4","548":"g6h6","549":"g7f7","550":"g7h5","551":"g8d8","552":"h2g1","553":"h2h1","554":"h3f2","555":"h4f3","556":"h4f6","557":"h5f4","558":"h5f6","559":"h6e3","560":"h6f5","561":"h6f8","562":"h6g7","563":"h6h7","564":"h7d3","565":"h7g8","566":"h8c8","567":"h8f7","568":"h8f8","569":"a1a8","570":"a1b1","571":"a1d4","572":"a1e5","573":"a1f6","574":"a1g7","575":"a2a3","576":"a2c3","577":"a2e2","578":"a3a4","579":"a3a7","580":"a3b3","581":"a3b4","582":"a3b5","583":"a3d3","584":"a3e3","585":"a4a5","586":"a4a6","587":"a4b2","588":"a4b5","589":"a4c4","590":"a5a6","591":"a5b5","592":"a5c3","593":"a5c5","594":"a5c7","595":"a5d8","596":"a6a4","597":"a6b7","598":"a6d6","599":"a6e2","600":"a7a1","601":"a7c6","602":"a8a1","603":"a8a4","604":"a8a5","605":"b1b4","606":"b1c3","607":"b1d2","608":"b1g1","609":"b2a1","610":"b2a3","611":"b2b3","612":"b2b4","613":"b2b7","614":"b2e2","615":"b2e5","616":"b2f2","617":"b2g2","618":"b2h2","619":"b3a2","620":"b3a5","621":"b3b5","622":"b3c1","623":"b3c5","624":"b3h3","625":"b4a2","626":"b4a5","627":"b4c4","628":"b4d5","629":"b4e1","630":"b4e4","631":"b5a5","632":"b5b3","633":"b5c3","634":"b5d6","635":"b6b3","636":"b6c6","637":"b6c8","638":"b6d8","639":"b6e3","640":"b6g6","641":"b7b8","642":"b7c7","643":"b8b1","644":"b8b6","645":"b8e5","646":"b8e8","647":"b8g8","648":"c1c3","649":"c1c5","650":"c1d3","651":"c1h1","652":"c2a2","653":"c2b4","654":"c2c1n","655":"c2c4","656":"c2d2","657":"c2d3","658":"c2d4","659":"c2e1","660":"c2g2","661":"c3a4","662":"c3b2","663":"c3b3","664":"c3d5","665":"c3e4","666":"c3g3","667":"c4a3","668":"c4c5","669":"c4c7","670":"c4d4","671":"c4e2","672":"c4e4","673":"c4e5","674":"c4h4","675":"c5a3","676":"c5a4","677":"c5a5","678":"c5b3","679":"c5b6","680":"c5c7","681":"c5e3","682":"c5e5","683":"c5f5","684":"c5f8","685":"c5g5","686":"c6a5","687":"c6c7","688":"c6c8","689":"c6d8","690":"c6e8","691":"c6g2","692":"c7b7","693":"c7c1","694":"c7e7","695":"c7f7","696":"c8a6","697":"c8a7","698":"c8c6","699":"c8e7","700":"c8e8","701":"c8g8","702":"d1a1","703":"d1c1","704":"d1e2","705":"d1f3","706":"d1g1","707":"d1h1","708":"d2a2","709":"d2b2","710":"d2c3","711":"d2d5","712":"d2e2","713":"d2e3","714":"d2f1","715":"d2f2","716":"d2h6","717":"d3a6","718":"d3b5","719":"d3c1","720":"d3d1","721":"d3d4","722":"d3d8","723":"d3e1","724":"d3e4","725":"d3e5","726":"d3f4","727":"d4a1","728":"d4b3","729":"d4b6","730":"d4d7","731":"d4f3","732":"d4f4","733":"d4g4","734":"d5b3","735":"d5b4","736":"d5b7","737":"d5c3","738":"d5c7","739":"d5d1","740":"d5e7","741":"d5f5","742":"d5h1","743":"d6b5","744":"d6c4","745":"d6d3","746":"d6e4","747":"d6e6","748":"d6e8","749":"d6f8","750":"d6g6","751":"d7d2","752":"d7d3","753":"d7h7","754":"d8a8","755":"d8e6","756":"e1d1","757":"e1d3","758":"e1e8","759":"e1f2","760":"e1g2","761":"e1h1","762":"e2d3","763":"e2e1n","764":"e2e4","765":"e2e5","766":"e2e8","767":"e2f1","768":"e2f2","769":"e2g2","770":"e2g3","771":"e2h5","772":"e3c1","773":"e3c2","774":"e3d2","775":"e3d4","776":"e3f4","777":"e3f5","778":"e3g1","779":"e3g3","780":"e3g4","781":"e3g5","782":"e4c4","783":"e4c5","784":"e4c6","785":"e4d6","786":"e4e2","787":"e4f6","788":"e4g5","789":"e5b8","790":"e5e6","791":"e5e7","792":"e5f5","793":"e5f6","794":"e5g6","795":"e5h8","796":"e6b3","797":"e6d6","798":"e6e2","799":"e6e4","800":"e6e7","801":"e6f6","802":"e7a3","803":"e7c8","804":"e8e5","805":"e8h5","806":"f1b1","807":"f1e1","808":"f1g2","809":"f1g3","810":"f1h1","811":"f2c5","812":"f2d2","813":"f2d3","814":"f2e3","815":"f2f1","816":"f2f3","817":"f2g3","818":"f2g4","819":"f2h3","820":"f2h4","821":"f3b7","822":"f3c6","823":"f3d5","824":"f3e2","825":"f3e3","826":"f3e4","827":"f3e5","828":"f3g1","829":"f3g3","830":"f3g5","831":"f3h2","832":"f4c7","833":"f4d4","834":"f4e2","835":"f4f5","836":"f4f6","837":"f4h3","838":"f4h4","839":"f4h5","840":"f5c2","841":"f5d5","842":"f5e5","843":"f5e6","844":"f6a1","845":"f6c3","846":"f6d6","847":"f6e7","848":"f6f2","849":"f6f4","850":"f6h4","851":"f7e5","852":"f7f8","853":"f7g8","854":"f8b8","855":"f8c5","856":"f8f1","857":"f8f3","858":"f8f5","859":"f8g6","860":"g1b6","861":"g1f2","862":"g1f3","863":"g1g2","864":"g1g3","865":"g1g4","866":"g2a2","867":"g2e1","868":"g2f3","869":"g2f4","870":"g2g1q","871":"g2g4","872":"g2h2","873":"g3a3","874":"g3c3","875":"g3c7","876":"g3d3","877":"g3d6","878":"g3e3","879":"g3f3","880":"g3h1","881":"g3h2","882":"g3h4","883":"g4f2","884":"g4g1","885":"g4g2","886":"g5c1","887":"g5c5","888":"g5d2","889":"g5e5","890":"g5e6","891":"g5e7","892":"g5f6","893":"g5g7","894":"g6f7","895":"g6g1","896":"g6g2","897":"g6g7","898":"g6h8","899":"g7a1","900":"g7c3","901":"g7d4","902":"g7e7","903":"g7f5","904":"g7h8","905":"g8d5","906":"g8e8","907":"g8g2","908":"g8g4","909":"g8g6","910":"h1c1","911":"h1f1","912":"h1h2","913":"h1h3","914":"h2b2","915":"h2c2","916":"h2e5","917":"h2f1","918":"h2f3","919":"h2g3","920":"h2g4","921":"h2h4","922":"h3d7","923":"h3f4","924":"h3g3","925":"h4b4","926":"h4d4","927":"h4e1","928":"h4e4","929":"h4e7","930":"h4f2","931":"h4f5","932":"h4g2","933":"h4h1","934":"h4h2","935":"h4h6","936":"h5d1","937":"h5e5","938":"h5g7","939":"h6f4","940":"h6g4","941":"h7d7","942":"h7e7","943":"h7f8","944":"h7g5","945":"h8a8","946":"h8d8","947":"h8h2"},"vocab_size":948,"top_moves":[["e7e6",84],["g8f6",83],["c7c6",81],["d7d5",80],["e8g8",70],["b8c6",51],["f8e7",51],["c8g4",43],["h7h6",43],["b8d7",40],["e6e5",39],["d7d6",35],["g7g6",35],["a7a6",33],["c6c5",33],["d5e4",31],["a8c8",30],["c6d5",30],["f8d6",29],["e7f6",28],["g4h5",26],["h7h5",26],["b7b5",23],["d7e5",23],["f8d8",23],["a7a5",22],["f7f6",22],["c8f5",21],["d8e7",21],["e8e7",21],["f6e4",21],["f7f5",21],["f8g7",21],["g7g5",21],["a5a4",20],["b7b6",20],["c6e5",19],["f6d5",19],["f8e8",19],["b5b4",18],["c5d4",18],["e5e4",18],["f6f5",18],["g5g4",18],["f6g5",17],["h7g6",17],["c7c5",16],["d6e5",16],["f6d7",16],["f6g4",16],["g5h4",16],["h5h4",16],["d5c4",15],["d5d4",15],["d6d7",15],["h5g6",15],["c8b7",14],["e7d6",14],["e7e5",14],["f5f4",14],["g8f8",14],["h6h5",14],["a8e8",13],["c8d7",13],["d8a5",13],["d8d5",13],["g7f6",13],["g8h8",13],["h4h3",13],["c5c4",12],["d6d5",12],["d8b6",12],["e8c8",12],["f5g6",12],["f8c8",12],["g4f3",12],["g6f5",12],["g8e7",12],["a6a5",11],["c6b4",11],["c6d4",11],["d7b6",11],["e4e3",11],["e6f5",11],["g4g3",11],["g8g7",11],["h3h2",11],["a8b8",10],["a8d8",10],["b7c6",10],["d8d7",10],["f5g4",10],["f6e5",10],["f6h5",10],["g8h7",10],["h8g8",10],["a4a2",9],["b4b3",9],["b6b5",9],["d7c5",9]]}