{"move_to_index":{"d2d4":0,"c1f4":1,"e2e3":2,"g1f3":3,"c2c3":4,"b1d2":5,"e1g1":6,"f1e2":7,"d4c5":8,"e3e4":9,"f2f3":10,"h2h3":11,"a1b1":12,"b2b3":13,"c4d5":14,"c6c7":15,"d1d4":16,"f1d1":17,"a2a3":18,"a2a4":19,"b1a1":20,"b4b5":21,"b5c6":22,"c1c8":23,"c2c4":24,"c2d4":25,"c3c4":26,"c5c6":27,"d1c1":28,"d1c2":29,"d2e4":30,"d2f3":31,"e1c1":32,"e1f3":33,"e2h5":34,"e4d6":35,"e4e5":36,"e4e7":37,"f1d3":38,"f1e1":39,"f3d2":40,"f3e1":41,"f3f4":42,"f4e5":43,"f4g3":44,"g1f2":45,"g2g3":46,"g3g4":47,"g4g5":48,"g4h4":49,"h2f1":50,"h2g3":51,"h3g4":52,"h5g6":53,"a1a3":54,"a1c1":55,"a1d1":56,"a1f1":57,"a3b4":58,"a3c2":59,"a3c3":60,"a4a5":61,"a5a6":62,"a6a7":63,"a6b6":64,"a7a8q":65,"a8c6":66,"b1a3":67,"b1c3":68,"b1d3":69,"b1e1":70,"b1f1":71,"b2b4":72,"b2c3":73,"b2d4":74,"b3b4":75,"b3d4":76,"b4c2":77,"b5b6":78,"b5d3":79,"b5e2":80,"b6b8":81,"b7f3":82,"c1b1":83,"c1b2":84,"c1c7":85,"c1e3":86,"c2b4":87,"c2c1":88,"c2d3":89,"c2e1":90,"c3b4":91,"c3d4":92,"c3d5":93,"c4c5":94,"c4e4":95,"c5d6":96,"c6b5":97,"c6g6":98,"c7c8":99,"c7c8q":100,"c7f7":101,"c8d8":102,"d1b1":103,"d1d2":104,"d1d5":105,"d1d7":106,"d1e1":107,"d1f3":108,"d2b3":109,"d2c1":110,"d2c4":111,"d2d1":112,"d2d5":113,"d2f1":114,"d3b5":115,"d3c4":116,"d3d5":117,"d3e4":118,"d3f5":119,"d4b6":120,"d4c2":121,"d4c6":122,"d4d8":123,"d4e2":124,"d4e4":125,"d4e5":126,"d5b7":127,"d5c4":128,"d5d2":129,"d6a6":130,"d6d7":131,"d6f7":132,"d7d8q":133,"d7e6":134,"d7e7":135,"d8d6":136,"d8d7":137,"d8f8":138,"e1b1":139,"e1c2":140,"e1e4":141,"e2c4":142,"e2d2":143,"e2d3":144,"e2f1":145,"e2f4":146,"e3e2":147,"e4f3":148,"e5e6":149,"e5h2":150,"e6e7":151,"e6g6":152,"e7c7":153,"e7e4":154,"e7e8q":155,"e8c6":156,"f1b5":157,"f1c1":158,"f1d2":159,"f1f2":160,"f1g1":161,"f1h2":162,"f2e3":163,"f2f1":164,"f2g3":165,"f3d1":166,"f3d4":167,"f3e2":168,"f3e4":169,"f3e5":170,"f3g4":171,"f3g5":172,"f3h2":173,"f4d5":174,"f4e3":175,"f4g4":176,"f4g5":177,"f4h6":178,"g1f1":179,"g1h1":180,"g2g4":181,"g2h3":182,"g5d2":183,"g5g7":184,"g5h4":185,"g6c6":186,"g6d3":187,"g6g5":188,"g7b2":189,"g7d7":190,"h1g2":191,"h2d6":192,"h3h4":193,"h4g3":194,"h4g4":195,"h4h5":196,"h5h6":197,"h6g5":198,"h6h7":199,"h7h8q":200,"h8g7":201},"index_to_move":{"0":"d2d4","1":"c1f4","2":"e2e3","3":"g1f3","4":"c2c3","5":"b1d2","6":"e1g1","7":"f1e2","8":"d4c5","9":"e3e4","10":"f2f3","11":"h2h3","12":"a1b1","13":"b2b3","14":"c4d5","15":"c6c7","16":"d1d4","17":"f1d1","18":"a2a3","19":"a2a4","20":"b1a1","21":"b4b5","22":"b5c6","23":"c1c8","24":"c2c4","25":"c2d4","26":"c3c4","27":"c5c6","28":"d1c1","29":"d1c2","30":"d2e4","31":"d2f3","32":"e1c1","33":"e1f3","34":"e2h5","35":"e4d6","36":"e4e5","37":"e4e7","38":"f1d3","39":"f1e1","40":"f3d2","41":"f3e1","42":"f3f4","43":"f4e5","44":"f4g3","45":"g1f2","46":"g2g3","47":"g3g4","48":"g4g5","49":"g4h4","50":"h2f1","51":"h2g3","52":"h3g4","53":"h5g6","54":"a1a3","55":"a1c1","56":"a1d1","57":"a1f1","58":"a3b4","59":"a3c2","60":"a3c3","61":"a4a5","62":"a5a6","63":"a6a7","64":"a6b6","65":"a7a8q","66":"a8c6","67":"b1a3","68":"b1c3","69":"b1d3","70":"b1e1","71":"b1f1","72":"b2b4","73":"b2c3","74":"b2d4","75":"b3b4","76":"b3d4","77":"b4c2","78":"b5b6","79":"b5d3","80":"b5e2","81":"b6b8","82":"b7f3","83":"c1b1","84":"c1b2","85":"c1c7","86":"c1e3","87":"c2b4","88":"c2c1","89":"c2d3","90":"c2e1","91":"c3b4","92":"c3d4","93":"c3d5","94":"c4c5","95":"c4e4","96":"c5d6","97":"c6b5","98":"c6g6","99":"c7c8","100":"c7c8q","101":"c7f7","102":"c8d8","103":"d1b1","104":"d1d2","105":"d1d5","106":"d1d7","107":"d1e1","108":"d1f3","109":"d2b3","110":"d2c1","111":"d2c4","112":"d2d1","113":"d2d5","114":"d2f1","115":"d3b5","116":"d3c4","117":"d3d5","118":"d3e4","119":"d3f5","120":"d4b6","121":"d4c2","122":"d4c6","123":"d4d8","124":"d4e2","125":"d4e4","126":"d4e5","127":"d5b7","128":"d5c4","129":"d5d2","130":"d6a6","131":"d6d7","132":"d6f7","133":"d7d8q","134":"d7e6","135":"d7e7","136":"d8d6","137":"d8d7","138":"d8f8","139":"e1b1","140":"e1c2","141":"e1e4","142":"e2c4","143":"e2d2","144":"e2d3","145":"e2f1","146":"e2f4","147":"e3e2","148":"e4f3","149":"e5e6","150":"e5h2","151":"e6e7","152":"e6g6","153":"e7c7","154":"e7e4","155":"e7e8q","156":"e8c6","157":"f1b5","158":"f1c1","159":"f1d2","160":"f1f2","161":"f1g1","162":"f1h2","163":"f2e3","164":"f2f1","165":"f2g3","166":"f3d1","167":"f3d4","168":"f3e2","169":"f3e4","170":"f3e5","171":"f3g4","172":"f3g5","173":"f3h2","174":"f4d5","175":"f4e3","176":"f4g4","177":"f4g5","178":"f4h6","179":"g1f1","180":"g1h1","181":"g2g4","182":"g2h3","183":"g5d2","184":"g5g7","185":"g5h4","186":"g6c6","187":"g6d3","188":"g6g5","189":"g7b2","190":"g7d7","191":"h1g2","192":"h2d6","193":"h3h4","194":"h4g3","195":"h4g4","196":"h4h5","197":"h5h6","198":"h6g5","199":"h6h7","200":"h7h8q","201":"h8g7"},"vocab_size":202,"top_moves":[["d2d4",20],["c1f4",18],["e2e3",18],["g1f3",14],["c2c3",12],["b1d2",10],["e1g1",10],["f1e2",10],["d4c5",8],["e3e4",8],["f2f3",8],["h2h3",8],["a1b1",6],["b2b3",6],["c4d5",6],["c6c7",6],["d1d4",6],["f1d1",6],["a2a3",4],["a2a4",4],["b1a1",4],["b4b5",4],["b5c6",4],["c1c8",4],["c2c4",4],["c2d4",4],["c3c4",4],["c5c6",4],["d1c1",4],["d1c2",4],["d2e4",4],["d2f3",4],["e1c1",4],["e1f3",4],["e2h5",4],["e4d6",4],["e4e5",4],["e4e7",4],["f1d3",4],["f1e1",4],["f3d2",4],["f3e1",4],["f3f4",4],["f4e5",4],["f4g3",4],["g1f2",4],["g2g3",4],["g3g4",4],["g4g5",4],["g4h4",4],["h2f1",4],["h2g3",4],["h3g4",4],["h5g6",4],["a1a3",2],["a1c1",2],["a1d1",2],["a1f1",2],["a3b4",2],["a3c2",2],["a3c3",2],["a4a5",2],["a5a6",2],["a6a7",2],["a6b6",2],["a7a8q",2],["a8c6",2],["b1a3",2],["b1c3",2],["b1d3",2],["b1e1",2],["b1f1",2],["b2b4",2],["b2c3",2],["b2d4",2],["b3b4",2],["b3d4",2],["b4c2",2],["b5b6",2],["b5d3",2],["b5e2",2],["b6b8",2],["b7f3",2],["c1b1",2],["c1b2",2],["c1c7",2],["c1e3",2],["c2b4",2],["c2c1",2],["c2d3",2],["c2e1",2],["c3b4",2],["c3d4",2],["c3d5",2],["c4c5",2],["c4e4",2],["c5d6",2],["c6b5",2],["c6g6",2],["c7c8",2]]}