{"move_to_index":{"c7c6":0,"d7d5":1,"e7e6":2,"e8g8":3,"c6d5":4,"d5e4":5,"f8e7":6,"g8f6":7,"a4a3":8,"a5a4":9,"b8d7":10,"f8e8":11,"h7h6":12,"a2a1q":13,"a3a2":14,"a8e8":15,"b6a5":16,"c8d7":17,"d7b6":18,"d7c6":19,"e4g5":20,"e6e5":21,"e8e3":22,"f3g2":23,"f5f4":24,"f6e4":25,"f7g6":26,"g2g1q":27,"g6g5":28,"g7g6":29,"g8f8":30,"g8g7":31,"a1c3":32,"a1e5":33,"a5b4":34,"a5b5":35,"a5c7":36,"a5e5":37,"a6a5":38,"a7a5":39,"a7a6":40,"a8d8":41,"b4a5":42,"b4c5":43,"b4d2":44,"b5d3":45,"b6c8":46,"b6d5":47,"b6g1":48,"b7b6":49,"b7c6":50,"b7d6":51,"b8c6":52,"c3e1":53,"c4e5":54,"c5b4":55,"c5d6":56,"c6b6":57,"c6c5":58,"c6d8":59,"c7b6":60,"c8b7":61,"c8d6":62,"c8f5":63,"d1d5":64,"d2d3":65,"d2d4":66,"d3f1":67,"d3g3":68,"d4d2":69,"d5a5":70,"d5c3":71,"d5c4":72,"d5c6":73,"d5f6":74,"d5h5":75,"d6c4":76,"d6e4":77,"d6e6":78,"d8b7":79,"d8d1":80,"d8d2":81,"d8d4":82,"d8d5":83,"d8e7":84,"d8e8":85,"d8f6":86,"e1g1":87,"e3e2":88,"e4d5":89,"e4f3":90,"e4f6":91,"e5f4":92,"e5f5":93,"e5g3":94,"e6d5":95,"e6f4":96,"e6f5":97,"e7b4":98,"e7c5":99,"e7e3":100,"e7e8":101,"e7f6":102,"e8d8":103,"e8e7":104,"e8f7":105,"f3d1":106,"f3h2":107,"f4e3":108,"f4f3":109,"f4h3":110,"f5f3":111,"f6d5":112,"f6e7":113,"f6f5":114,"f6g6":115,"f6h5":116,"f7f6":117,"f8d6":118,"f8d8":119,"g1d4":120,"g3g2":121,"g4g3":122,"g5e6":123,"g5f3":124,"g5g4":125,"g6g7":126,"g6h5":127,"g7h6":128,"g7h7":129,"h1e4":130,"h2f3":131,"h2h1q":132,"h3g5":133,"h3h2":134,"h4h3":135,"h5a5":136,"h5g3":137,"h5h4":138,"h6h5":139,"h7g6":140,"h7g8":141},"index_to_move":{"0":"c7c6","1":"d7d5","2":"e7e6","3":"e8g8","4":"c6d5","5":"d5e4","6":"f8e7","7":"g8f6","8":"a4a3","9":"a5a4","10":"b8d7","11":"f8e8","12":"h7h6","13":"a2a1q","14":"a3a2","15":"a8e8","16":"b6a5","17":"c8d7","18":"d7b6","19":"d7c6","20":"e4g5","21":"e6e5","22":"e8e3","23":"f3g2","24":"f5f4","25":"f6e4","26":"f7g6","27":"g2g1q","28":"g6g5","29":"g7g6","30":"g8f8","31":"g8g7","32":"a1c3","33":"a1e5","34":"a5b4","35":"a5b5","36":"a5c7","37":"a5e5","38":"a6a5","39":"a7a5","40":"a7a6","41":"a8d8","42":"b4a5","43":"b4c5","44":"b4d2","45":"b5d3","46":"b6c8","47":"b6d5","48":"b6g1","49":"b7b6","50":"b7c6","51":"b7d6","52":"b8c6","53":"c3e1","54":"c4e5","55":"c5b4","56":"c5d6","57":"c6b6","58":"c6c5","59":"c6d8","60":"c7b6","61":"c8b7","62":"c8d6","63":"c8f5","64":"d1d5","65":"d2d3","66":"d2d4","67":"d3f1","68":"d3g3","69":"d4d2","70":"d5a5","71":"d5c3","72":"d5c4","73":"d5c6","74":"d5f6","75":"d5h5","76":"d6c4","77":"d6e4","78":"d6e6","79":"d8b7","80":"d8d1","81":"d8d2","82":"d8d4","83":"d8d5","84":"d8e7","85":"d8e8","86":"d8f6","87":"e1g1","88":"e3e2","89":"e4d5","90":"e4f3","91":"e4f6","92":"e5f4","93":"e5f5","94":"e5g3","95":"e6d5","96":"e6f4","97":"e6f5","98":"e7b4","99":"e7c5","100":"e7e3","101":"e7e8","102":"e7f6","103":"e8d8","104":"e8e7","105":"e8f7","106":"f3d1","107":"f3h2","108":"f4e3","109":"f4f3","110":"f4h3","111":"f5f3","112":"f6d5","113":"f6e7","114":"f6f5","115":"f6g6","116":"f6h5","117":"f7f6","118":"f8d6","119":"f8d8","120":"g1d4","121":"g3g2","122":"g4g3","123":"g5e6","124":"g5f3","125":"g5g4","126":"g6g7","127":"g6h5","128":"g7h6","129":"g7h7","130":"h1e4","131":"h2f3","132":"h2h1q","133":"h3g5","134":"h3h2","135":"h4h3","136":"h5a5","137":"h5g3","138":"h5h4","139":"h6h5","140":"h7g6","141":"h7g8"},"vocab_size":142,"top_moves":[["c7c6",10],["d7d5",10],["e7e6",10],["e8g8",10],["c6d5",8],["d5e4",8],["f8e7",8],["g8f6",8],["a4a3",6],["a5a4",6],["b8d7",6],["f8e8",6],["h7h6",6],["a2a1q",4],["a3a2",4],["a8e8",4],["b6a5",4],["c8d7",4],["d7b6",4],["d7c6",4],["e4g5",4],["e6e5",4],["e8e3",4],["f3g2",4],["f5f4",4],["f6e4",4],["f7g6",4],["g2g1q",4],["g6g5",4],["g7g6",4],["g8f8",4],["g8g7",4],["a1c3",2],["a1e5",2],["a5b4",2],["a5b5",2],["a5c7",2],["a5e5",2],["a6a5",2],["a7a5",2],["a7a6",2],["a8d8",2],["b4a5",2],["b4c5",2],["b4d2",2],["b5d3",2],["b6c8",2],["b6d5",2],["b6g1",2],["b7b6",2],["b7c6",2],["b7d6",2],["b8c6",2],["c3e1",2],["c4e5",2],["c5b4",2],["c5d6",2],["c6b6",2],["c6c5",2],["c6d8",2],["c7b6",2],["c8b7",2],["c8d6",2],["c8f5",2],["d1d5",2],["d2d3",2],["d2d4",2],["d3f1",2],["d3g3",2],["d4d2",2],["d5a5",2],["d5c3",2],["d5c4",2],["d5c6",2],["d5f6",2],["d5h5",2],["d6c4",2],["d6e4",2],["d6e6",2],["d8b7",2],["d8d1",2],["d8d2",2],["d8d4",2],["d8d5",2],["d8e7",2],["d8e8",2],["d8f6",2],["e1g1",2],["e3e2",2],["e4d5",2],["e4f3",2],["e4f6",2],["e5f4",2],["e5f5",2],["e5g3",2],["e6d5",2],["e6f4",2],["e6f5",2],["e7b4",2],["e7c5",2]]}